// WidgetBlueprintGeneratedClass BonusShop_Offer_BG.BonusShop_Offer_BG_C
// Size: 0x358 (Inherited: 0x318)
struct UBonusShop_Offer_BG_C : UUserWidget {
	struct UImage* BL_Box; // 0x318(0x08)
	struct UImage* BotBorder; // 0x320(0x08)
	struct UImage* BR_Box; // 0x328(0x08)
	struct UImage* LeftBorder_2; // 0x330(0x08)
	struct UImage* RightBorder; // 0x338(0x08)
	struct UImage* TL_Box; // 0x340(0x08)
	struct UImage* TopLine; // 0x348(0x08)
	struct UImage* TR_Box; // 0x350(0x08)
};

