// UserDefinedStruct CharacterTileColorParams.CharacterTileColorParams
// Size: 0x38 (Inherited: 0x00)
struct FCharacterTileColorParams {
	float PortraitOpacity_9_61B725E7418B85BE0315C3AE6D4E4CDB; // 0x00(0x04)
	float IsSelected_15_03820FEB4EECD66D3A4A20AE9BB4548A; // 0x04(0x04)
	struct FLinearColor Default_Color_Stroke_19_CD90F15A4AAEB942F35981B58CE066C5; // 0x08(0x10)
	struct FLinearColor Default_Color_Body_21_B30BD0AC437A27A6CC331D9E5F0E6038; // 0x18(0x10)
	float IsFocused_25_B0618051415827D29928DFA1C1063DFA; // 0x28(0x04)
	float IsSelectedUnhover_28_D3CEB31A4968AB99D436F9BA7CD737E9; // 0x2c(0x04)
	float IsDisabled_31_4B223AF0404877B34A137DB9102D2BD9; // 0x30(0x04)
	float IsLockedIn_34_B586C48749AA78D1CB05FFBCAFF63D5F; // 0x34(0x04)
};

