// WidgetBlueprintGeneratedClass CodeOfConduct.CodeOfConduct_C
// Size: 0x440 (Inherited: 0x318)
struct UCodeOfConduct_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x08)
	struct USharedButtonMaster_C* Accept; // 0x320(0x08)
	struct UImage* Image; // 0x328(0x08)
	struct UImage* Image_6; // 0x330(0x08)
	struct UImage* Image_7; // 0x338(0x08)
	struct UImage* Image_8; // 0x340(0x08)
	struct UImage* Image_9; // 0x348(0x08)
	struct UImage* Image_10; // 0x350(0x08)
	struct UImage* Image_11; // 0x358(0x08)
	struct UImage* Image_12; // 0x360(0x08)
	struct UImage* Image_13; // 0x368(0x08)
	struct UImage* Image_14; // 0x370(0x08)
	struct UImage* Image_15; // 0x378(0x08)
	struct UImage* Image_16; // 0x380(0x08)
	struct UImage* Image_17; // 0x388(0x08)
	struct UImage* Image_18; // 0x390(0x08)
	struct UImage* Image_19; // 0x398(0x08)
	struct UImage* Image_20; // 0x3a0(0x08)
	struct UImage* Image_21; // 0x3a8(0x08)
	struct UImage* Image_22; // 0x3b0(0x08)
	struct UImage* Image_23; // 0x3b8(0x08)
	struct UImage* Image_24; // 0x3c0(0x08)
	struct UImage* Image_25; // 0x3c8(0x08)
	struct UImage* Image_26; // 0x3d0(0x08)
	struct UImage* Image_27; // 0x3d8(0x08)
	struct UImage* Image_28; // 0x3e0(0x08)
	struct UImage* Image_29; // 0x3e8(0x08)
	struct UImage* Image_30; // 0x3f0(0x08)
	struct UImage* Image_31; // 0x3f8(0x08)
	struct UImage* Image_32; // 0x400(0x08)
	struct UImage* Image_33; // 0x408(0x08)
	struct UImage* Image_34; // 0x410(0x08)
	struct UImage* Image_72; // 0x418(0x08)
	struct UImage* Image_88; // 0x420(0x08)
	struct UImage* Image_180; // 0x428(0x08)
	struct UImage* Image_219; // 0x430(0x08)
	struct UImage* Image_275; // 0x438(0x08)

	void BndEvt__Accept_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature(); // Function CodeOfConduct.CodeOfConduct_C.BndEvt__Accept_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature // (BlueprintEvent) // @ game+0x1b42740
	void ExecuteUbergraph_CodeOfConduct(int32_t EntryPoint); // Function CodeOfConduct.CodeOfConduct_C.ExecuteUbergraph_CodeOfConduct // (Final|UbergraphFunction) // @ game+0x1b42740
};

