// Class Engine.Actor
// Size: 0x460 (Inherited: 0x30)
struct AActor : UObject {
	struct FActorTickFunction PrimaryActorTick; // 0x30(0x30)
	char pad_60[0x4]; // 0x60(0x04)
	char bNetTemporary : 1; // 0x64(0x01)
	char pad_64_1 : 1; // 0x64(0x01)
	char bOnlyRelevantToOwner : 1; // 0x64(0x01)
	char bAlwaysRelevant : 1; // 0x64(0x01)
	char bStaticActorLocation : 1; // 0x64(0x01)
	char bAlwaysRelevantToAlliesAndViewer : 1; // 0x64(0x01)
	char bReplicateMovement : 1; // 0x64(0x01)
	char bCallPreReplication : 1; // 0x64(0x01)
	char bCallPreReplicationForReplay : 1; // 0x65(0x01)
	char bHidden : 1; // 0x65(0x01)
	char bLocallyHidden : 1; // 0x65(0x01)
	char pad_65_3 : 5; // 0x65(0x01)
	char pad_66[0x2]; // 0x66(0x02)
	struct FMulticastInlineDelegate OnActorHiddenChanged; // 0x68(0x10)
	char pad_78[0xa0]; // 0x78(0xa0)
	char bTearOff : 1; // 0x118(0x01)
	char bForceNetAddressable : 1; // 0x118(0x01)
	char bExchangedRoles : 1; // 0x118(0x01)
	char bNetLoadOnClient : 1; // 0x118(0x01)
	char bNetUseOwnerRelevancy : 1; // 0x118(0x01)
	char bRelevantForNetworkReplays : 1; // 0x118(0x01)
	char bRelevantForLevelBounds : 1; // 0x118(0x01)
	char bReplayRewindable : 1; // 0x118(0x01)
	char bAllowTickBeforeBeginPlay : 1; // 0x119(0x01)
	char bAutoDestroyWhenFinished : 1; // 0x119(0x01)
	char bCanBeDamaged : 1; // 0x119(0x01)
	char bBlockInput : 1; // 0x119(0x01)
	char bCollideWhenPlacing : 1; // 0x119(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x119(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x119(0x01)
	char bIgnoresOriginShifting : 1; // 0x119(0x01)
	char bEnableAutoLODGeneration : 1; // 0x11a(0x01)
	char bIsEditorOnlyActor : 1; // 0x11a(0x01)
	char bChildActorsManuallySpawn : 1; // 0x11a(0x01)
	char bActorSeamlessTraveled : 1; // 0x11a(0x01)
	char bReplicates : 1; // 0x11a(0x01)
	char bCanBeInCluster : 1; // 0x11a(0x01)
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x11a(0x01)
	char pad_11A_7 : 1; // 0x11a(0x01)
	char bReplicateUsingRegisteredSubObjectList : 1; // 0x11b(0x01)
	char pad_11B_1 : 7; // 0x11b(0x01)
	char pad_11C_0 : 1; // 0x11c(0x01)
	char bActorEnableCollision : 1; // 0x11c(0x01)
	char bActorIsBeingDestroyed : 1; // 0x11c(0x01)
	char pad_11C_3 : 4; // 0x11c(0x01)
	char bAsyncPhysicsTickEnabled : 1; // 0x11c(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x11d(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x11e(0x01)
	char pad_11F[0x1]; // 0x11f(0x01)
	float InitialLifeSpan; // 0x120(0x04)
	float CustomTimeDilation; // 0x124(0x04)
	enum class ENetRole RemoteRole; // 0x128(0x01)
	char pad_129[0x3]; // 0x129(0x03)
	int32_t RayTracingGroupId; // 0x12c(0x04)
	struct FRepAttachment AttachmentReplication; // 0x130(0x68)
	struct FRepMovement ReplicatedMovement; // 0x198(0x70)
	struct AActor* Owner; // 0x208(0x08)
	struct FName NetDriverName; // 0x210(0x0c)
	enum class ENetRole Role; // 0x21c(0x01)
	enum class ENetDormancy NetDormancy; // 0x21d(0x01)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x21e(0x01)
	enum class EAutoReceiveInput AutoReceiveInput; // 0x21f(0x01)
	int32_t InputPriority; // 0x220(0x04)
	char pad_224[0x4]; // 0x224(0x04)
	struct UInputComponent* InputComponent; // 0x228(0x08)
	float NetCullDistanceSquared; // 0x230(0x04)
	int32_t NetTag; // 0x234(0x04)
	float NetUpdateFrequency; // 0x238(0x04)
	float MinNetUpdateFrequency; // 0x23c(0x04)
	float NetPriority; // 0x240(0x04)
	enum class EPhysicsReplicationMode PhysicsReplicationMode; // 0x244(0x01)
	char pad_245[0x2b]; // 0x245(0x2b)
	struct APawn* Instigator; // 0x270(0x08)
	struct TArray<struct AActor*> Children; // 0x278(0x10)
	struct USceneComponent* RootComponent; // 0x288(0x08)
	struct FTimerHandle TimerHandle_LifeSpanExpired; // 0x290(0x08)
	struct TArray<struct FName> Layers; // 0x298(0x10)
	struct TWeakObjectPtr<struct UChildActorComponent> ParentComponent; // 0x2a8(0x08)
	struct TArray<struct FName> Tags; // 0x2b0(0x10)
	struct FMulticastSparseDelegate OnTakeAnyDamage; // 0x2c0(0x01)
	struct FMulticastSparseDelegate OnTakePointDamage; // 0x2c1(0x01)
	struct FMulticastSparseDelegate OnTakeRadialDamage; // 0x2c2(0x01)
	struct FMulticastSparseDelegate OnActorBeginOverlap; // 0x2c3(0x01)
	struct FMulticastSparseDelegate OnActorEndOverlap; // 0x2c4(0x01)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x2c5(0x01)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0x2c6(0x01)
	struct FMulticastSparseDelegate OnClicked; // 0x2c7(0x01)
	struct FMulticastSparseDelegate OnReleased; // 0x2c8(0x01)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x2c9(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x2ca(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0x2cb(0x01)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x2cc(0x01)
	struct FMulticastSparseDelegate OnActorHit; // 0x2cd(0x01)
	char pad_2CE[0x2]; // 0x2ce(0x02)
	struct FMulticastInlineDelegate PostActorBeginPlay; // 0x2d0(0x10)
	struct FMulticastSparseDelegate OnDestroyed; // 0x2e0(0x01)
	struct FMulticastSparseDelegate OnEndPlay; // 0x2e1(0x01)
	char pad_2E2[0x6]; // 0x2e2(0x06)
	struct FMulticastInlineDelegate OnForceNetUpdate; // 0x2e8(0x10)
	struct FMulticastInlineDelegate OnClientRoleChanged; // 0x2f8(0x10)
	char pad_308[0x128]; // 0x308(0x128)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x430(0x10)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x440(0x10)
	char pad_450[0x10]; // 0x450(0x10)

	bool WasRecentlyRendered(float Tolerance); // Function Engine.Actor.WasRecentlyRendered // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5d350
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void TearOff(); // Function Engine.Actor.TearOff // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x28a8d00
	void SetTickGroup(enum class ETickingGroup NewTickGroup); // Function Engine.Actor.SetTickGroup // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5d450
	void SetTickableWhenPaused(bool bTickableWhenPaused); // Function Engine.Actor.SetTickableWhenPaused // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5e9f0
	void SetReplicates(bool bInReplicates); // Function Engine.Actor.SetReplicates // (Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3d67360
	void SetReplicateMovement(bool bInReplicateMovement); // Function Engine.Actor.SetReplicateMovement // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d67260
	void SetRayTracingGroupId(int32_t InRaytracingGroupId); // Function Engine.Actor.SetRayTracingGroupId // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d66ef0
	void SetPhysicsReplicationMode(enum class EPhysicsReplicationMode ReplicationMode); // Function Engine.Actor.SetPhysicsReplicationMode // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d670d0
	void SetOwner(struct AActor* NewOwner); // Function Engine.Actor.SetOwner // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5e110
	void SetNetDormancy(enum class ENetDormancy NewDormancy); // Function Engine.Actor.SetNetDormancy // (Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3d5df00
	void SetLifeSpan(float InLifespan); // Function Engine.Actor.SetLifeSpan // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5e4d0
	void SetAutoDestroyWhenFinished(bool bVal); // Function Engine.Actor.SetAutoDestroyWhenFinished // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d67560
	void SetActorTickInterval(float TickInterval); // Function Engine.Actor.SetActorTickInterval // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5e260
	void SetActorTickEnabled(bool bEnabled); // Function Engine.Actor.SetActorTickEnabled // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5e370
	void SetActorScale3D(struct FVector NewScale3D); // Function Engine.Actor.SetActorScale3D // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3d653f0
	void SetActorRelativeScale3D(struct FVector NewRelativeScale); // Function Engine.Actor.SetActorRelativeScale3D // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3d61820
	void SetActorLocallyHidden(bool NewHidden, struct FName Tag); // Function Engine.Actor.SetActorLocallyHidden // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d67710
	void SetActorHiddenInGame(bool bNewHidden); // Function Engine.Actor.SetActorHiddenInGame // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d616b0
	void SetActorEnableCollision(bool bNewActorEnableCollision); // Function Engine.Actor.SetActorEnableCollision // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d615b0
	void RewindForReplay(); // Function Engine.Actor.RewindForReplay // (RequiredAPI|Native|Event|Public|BlueprintEvent) // @ game+0x3bf0820
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.RemoveTickPrerequisiteComponent // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5eb10
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.Actor.RemoveTickPrerequisiteActor // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5ec10
	void ReceiveTick(float DeltaSeconds); // Function Engine.Actor.ReceiveTick // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveRadialDamage(float DamageReceived, struct UDamageType* DamageType, struct FVector Origin, struct FHitResult& HitInfo, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveRadialDamage // (RequiredAPI|BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x1b42740
	void ReceivePointDamage(float Damage, struct UDamageType* DamageType, struct FVector HitLocation, struct FVector HitNormal, struct UPrimitiveComponent* HitComponent, struct FName BoneName, struct FVector ShotFromDirection, struct AController* InstigatedBy, struct AActor* DamageCauser, struct FHitResult& HitInfo); // Function Engine.Actor.ReceivePointDamage // (RequiredAPI|BlueprintAuthorityOnly|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x1b42740
	void ReceiveOnOwnerChanged(struct AActor* PrevOwner); // Function Engine.Actor.ReceiveOnOwnerChanged // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0x1b42740
	void ReceiveHit(struct UPrimitiveComponent* MyComp, struct AActor* Other, struct UPrimitiveComponent* OtherComp, bool bSelfMoved, struct FVector HitLocation, struct FVector HitNormal, struct FVector NormalImpulse, struct FHitResult& Hit); // Function Engine.Actor.ReceiveHit // (RequiredAPI|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x1b42740
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // Function Engine.Actor.ReceiveEndPlay // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0x1b42740
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // (RequiredAPI|Event|Protected|BlueprintEvent) // @ game+0x1b42740
	void ReceiveAsyncPhysicsTick(float DeltaSeconds, float SimSeconds); // Function Engine.Actor.ReceiveAsyncPhysicsTick // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveAnyDamage(float Damage, struct UDamageType* DamageType, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveAnyDamage // (RequiredAPI|BlueprintAuthorityOnly|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveActorOnReleased(struct FKey ButtonReleased); // Function Engine.Actor.ReceiveActorOnReleased // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveActorOnInputTouchLeave(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveActorOnInputTouchEnter(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveActorOnInputTouchEnd(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveActorOnInputTouchBegin(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveActorOnClicked(struct FKey ButtonPressed); // Function Engine.Actor.ReceiveActorOnClicked // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveActorEndOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorEndOverlap // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveActorBeginOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorBeginOverlap // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void PrestreamTextures(float Seconds, bool bEnableStreaming, int32_t CinematicTextureGroups); // Function Engine.Actor.PrestreamTextures // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5d0f0
	void OnRep_Role(); // Function Engine.Actor.OnRep_Role // (RequiredAPI|Native|Public) // @ game+0x3d671f0
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // (RequiredAPI|Native|Public) // @ game+0x3bf07f0
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // (RequiredAPI|Native|Public) // @ game+0x3d5e210
	void OnRep_OwnerWithPrevOwner(struct AActor* PrevOwner); // Function Engine.Actor.OnRep_OwnerWithPrevOwner // (RequiredAPI|Native|Protected) // @ game+0x3d67460
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // (Final|RequiredAPI|Native|Private) // @ game+0x28a8ad0
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // (RequiredAPI|Native|Public) // @ game+0x3d66ff0
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // (RequiredAPI|Native|Public) // @ game+0x3d671c0
	void MakeNoise(float Loudness, struct APawn* NoiseInstigator, struct FVector NoiseLocation, float MaxRange, struct FName Tag); // Function Engine.Actor.MakeNoise // (Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3d5c300
	bool K2_TeleportTo(struct FVector DestLocation, struct FRotator DestRotation); // Function Engine.Actor.K2_TeleportTo // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3d5da30
	bool K2_SetActorTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorTransform // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d630a0
	bool K2_SetActorRotation(struct FRotator NewRotation, bool bTeleportPhysics); // Function Engine.Actor.K2_SetActorRotation // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3d658f0
	void K2_SetActorRelativeTransform(struct FTransform& NewRelativeTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeTransform // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d61920
	void K2_SetActorRelativeRotation(struct FRotator NewRelativeRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeRotation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d61c80
	void K2_SetActorRelativeLocation(struct FVector NewRelativeLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeLocation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d620c0
	bool K2_SetActorLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorLocationAndRotation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d65500
	bool K2_SetActorLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorLocation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d660d0
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void K2_OnEndViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnEndViewTarget // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void K2_OnBecomeViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnBecomeViewTarget // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	struct USceneComponent* K2_GetRootComponent(); // Function Engine.Actor.K2_GetRootComponent // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d65b50
	struct FTimerHandle K2_GetLifeSpanTimer(); // Function Engine.Actor.K2_GetLifeSpanTimer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5e470
	struct TArray<struct UActorComponent*> K2_GetComponentsByClass(struct UActorComponent* ComponentClass); // Function Engine.Actor.K2_GetComponentsByClass // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5cc40
	struct FRotator K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d65fd0
	struct FVector K2_GetActorLocation(); // Function Engine.Actor.K2_GetActorLocation // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d66420
	void K2_DetachFromActor(enum class EDetachmentRule LocationRule, enum class EDetachmentRule RotationRule, enum class EDetachmentRule ScaleRule); // Function Engine.Actor.K2_DetachFromActor // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5f0c0
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d61550
	bool K2_AttachToComponent(struct USceneComponent* Parent, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachToComponent // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5fc70
	bool K2_AttachToActor(struct AActor* ParentActor, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachToActor // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5f4d0
	void K2_AttachRootComponentToActor(struct AActor* InParentActor, struct FName InSocketName, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentToActor // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5f930
	void K2_AttachRootComponentTo(struct USceneComponent* InParent, struct FName InSocketName, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentTo // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d600a0
	void K2_AddActorWorldTransformKeepScale(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldTransformKeepScale // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d63400
	void K2_AddActorWorldTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldTransform // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d63850
	void K2_AddActorWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldRotation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d63ca0
	void K2_AddActorWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldOffset // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d640e0
	void K2_AddActorLocalTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalTransform // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d62410
	void K2_AddActorLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalRotation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d62820
	void K2_AddActorLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalOffset // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d62c60
	bool IsSpawnedActor(); // Function Engine.Actor.IsSpawnedActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5e910
	bool IsOverlappingActor(struct AActor* Other); // Function Engine.Actor.IsOverlappingActor // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5dff0
	bool IsChildActor(); // Function Engine.Actor.IsChildActor // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5dea0
	bool IsActorTickEnabled(); // Function Engine.Actor.IsActorTickEnabled // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5e350
	bool IsActorBeingDestroyed(); // Function Engine.Actor.IsActorBeingDestroyed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5e8e0
	bool HasAuthority(); // Function Engine.Actor.HasAuthority // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d61520
	bool HasActorBegunPlay(); // Function Engine.Actor.HasActorBegunPlay // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5e940
	float GetVerticalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetVerticalDistanceTo // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d64a80
	struct FVector GetVelocity(); // Function Engine.Actor.GetVelocity // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d65b00
	struct FTransform GetTransform(); // Function Engine.Actor.GetTransform // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d664a0
	bool GetTickableWhenPaused(); // Function Engine.Actor.GetTickableWhenPaused // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5eaf0
	float GetSquaredHorizontalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetSquaredHorizontalDistanceTo // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d64c40
	float GetSquaredDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetSquaredDistanceTo // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d64fc0
	float GetResimulationThreshold(); // Function Engine.Actor.GetResimulationThreshold // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d67020
	enum class ENetRole GetRemoteRole(); // Function Engine.Actor.GetRemoteRole // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d67220
	int32_t GetRayTracingGroupId(); // Function Engine.Actor.GetRayTracingGroupId // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d66ec0
	enum class EPhysicsReplicationMode GetPhysicsReplicationMode(); // Function Engine.Actor.GetPhysicsReplicationMode // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d670b0
	struct UChildActorComponent* GetParentComponent(); // Function Engine.Actor.GetParentComponent // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5dc70
	struct AActor* GetParentActor(); // Function Engine.Actor.GetParentActor // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5dc20
	struct AActor* GetOwner(); // Function Engine.Actor.GetOwner // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5e0f0
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*>& OverlappingComponents); // Function Engine.Actor.GetOverlappingComponents // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5e5d0
	void GetOverlappingActors(struct TArray<struct AActor*>& OverlappingActors, struct AActor* ClassFilter); // Function Engine.Actor.GetOverlappingActors // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5e700
	enum class ENetRole GetLocalRole(); // Function Engine.Actor.GetLocalRole // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d67240
	bool GetLocallyHidden(); // Function Engine.Actor.GetLocallyHidden // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d67b70
	float GetLifeSpan(); // Function Engine.Actor.GetLifeSpan // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5e490
	struct FTransform GetLevelTransform(); // Function Engine.Actor.GetLevelTransform // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5d8b0
	struct ULevel* GetLevel(); // Function Engine.Actor.GetLevel // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5d9a0
	struct AController* GetInstigatorController(); // Function Engine.Actor.GetInstigatorController // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d66510
	struct APawn* GetInstigator(); // Function Engine.Actor.GetInstigator // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d66550
	struct FVector GetInputVectorAxisValue(struct FKey InputAxisKey); // Function Engine.Actor.GetInputVectorAxisValue // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d66570
	float GetInputAxisValue(struct FName InputAxisName); // Function Engine.Actor.GetInputAxisValue // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d66aa0
	float GetInputAxisKeyValue(struct FKey InputAxisKey); // Function Engine.Actor.GetInputAxisKeyValue // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d66820
	float GetHorizontalDotProductTo(struct AActor* OtherActor); // Function Engine.Actor.GetHorizontalDotProductTo // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d64500
	float GetHorizontalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetHorizontalDistanceTo // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d64e00
	bool GetHiddenInGame(); // Function Engine.Actor.GetHiddenInGame // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d67b50
	float GetGameTimeSinceCreation(); // Function Engine.Actor.GetGameTimeSinceCreation // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5e970
	float GetDotProductTo(struct AActor* OtherActor); // Function Engine.Actor.GetDotProductTo // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d647b0
	float GetDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetDistanceTo // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d651a0
	struct TArray<struct UActorComponent*> GetComponentsByTag(struct UActorComponent* ComponentClass, struct FName Tag); // Function Engine.Actor.GetComponentsByTag // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5c860
	struct TArray<struct UActorComponent*> GetComponentsByInterface(struct UInterface* Interface); // Function Engine.Actor.GetComponentsByInterface // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5c680
	struct UActorComponent* GetComponentByClass(struct UActorComponent* ComponentClass); // Function Engine.Actor.GetComponentByClass // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5ce30
	struct AActor* GetAttachRootActor(); // Function Engine.Actor.GetAttachRootActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5d830
	struct FName GetAttachParentSocketName(); // Function Engine.Actor.GetAttachParentSocketName // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5d7c0
	struct AActor* GetAttachParentActor(); // Function Engine.Actor.GetAttachParentActor // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5d880
	void GetAttachedActors(struct TArray<struct AActor*>& OutActors, bool bResetArray, bool bRecursivelyIncludeAttachedActors); // Function Engine.Actor.GetAttachedActors // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5d540
	void GetAllChildActors(struct TArray<struct AActor*>& ChildActors, bool bIncludeDescendants); // Function Engine.Actor.GetAllChildActors // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5dcb0
	struct FVector GetActorUpVector(); // Function Engine.Actor.GetActorUpVector // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d65ef0
	float GetActorTimeDilation(); // Function Engine.Actor.GetActorTimeDilation // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5ef10
	float GetActorTickInterval(); // Function Engine.Actor.GetActorTickInterval // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5e240
	struct FVector GetActorScale3D(); // Function Engine.Actor.GetActorScale3D // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d65380
	struct FVector GetActorRightVector(); // Function Engine.Actor.GetActorRightVector // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d65e80
	struct FVector GetActorRelativeScale3D(); // Function Engine.Actor.GetActorRelativeScale3D // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d617b0
	struct FVector GetActorForwardVector(); // Function Engine.Actor.GetActorForwardVector // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d65f60
	void GetActorEyesViewPoint(struct FVector& OutLocation, struct FRotator& OutRotation); // Function Engine.Actor.GetActorEyesViewPoint // (RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5cf40
	bool GetActorEnableCollision(); // Function Engine.Actor.GetActorEnableCollision // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d61580
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector& Origin, struct FVector& BoxExtent, bool bIncludeFromChildActors); // Function Engine.Actor.GetActorBounds // (RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d65b70
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5d320
	void FlushNetDormancy(); // Function Engine.Actor.FlushNetDormancy // (Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3d5dee0
	void FinishAddComponent(struct UActorComponent* Component, bool bManualAttachment, struct FTransform& RelativeTransform); // Function Engine.Actor.FinishAddComponent // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d603f0
	struct UActorComponent* FindComponentByTag(struct UActorComponent* ComponentClass, struct FName Tag); // Function Engine.Actor.FindComponentByTag // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5ca80
	void EnableInput(struct APlayerController* PlayerController); // Function Engine.Actor.EnableInput // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d66dc0
	void DisableInput(struct APlayerController* PlayerController); // Function Engine.Actor.DisableInput // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d66bc0
	void DetachRootComponentFromParent(bool bMaintainWorldPosition); // Function Engine.Actor.DetachRootComponentFromParent // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5f320
	void CreateInputComponent(struct UInputComponent* InputComponentToCreate); // Function Engine.Actor.CreateInputComponent // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d66cc0
	void ClearActorLocallyHidden(); // Function Engine.Actor.ClearActorLocallyHidden // (Final|RequiredAPI|Native|Public) // @ game+0x3d676f0
	bool CanTriggerResimulation(); // Function Engine.Actor.CanTriggerResimulation // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d67080
	void AuthSetActorGameplayHidden(bool NewHidden, struct FName Tag); // Function Engine.Actor.AuthSetActorGameplayHidden // (Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3d67940
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.AddTickPrerequisiteComponent // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5ed10
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.Actor.AddTickPrerequisiteActor // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5ee10
	struct UActorComponent* AddComponentByClass(struct UActorComponent* Class, bool bManualAttachment, struct FTransform& RelativeTransform, bool bDeferredFinish); // Function Engine.Actor.AddComponentByClass // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d60a30
	struct UActorComponent* AddComponent(struct FName TemplateName, bool bManualAttachment, struct FTransform& RelativeTransform, struct UObject* ComponentTemplateContext, bool bDeferredFinish); // Function Engine.Actor.AddComponent // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d61120
	bool ActorHasTag(struct FName Tag); // Function Engine.Actor.ActorHasTag // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d5ef90
};

// Class Engine.HUD
// Size: 0x560 (Inherited: 0x460)
struct AHUD : AActor {
	struct APlayerController* PlayerOwner; // 0x460(0x08)
	char bLostFocusPaused : 1; // 0x468(0x01)
	char bShowHUD : 1; // 0x468(0x01)
	char bShowDebugInfo : 1; // 0x468(0x01)
	char pad_468_3 : 5; // 0x468(0x01)
	char pad_469[0x3]; // 0x469(0x03)
	int32_t CurrentTargetIndex; // 0x46c(0x04)
	char bShowHitBoxDebugInfo : 1; // 0x470(0x01)
	char bShowOverlays : 1; // 0x470(0x01)
	char bEnableDebugTextShadow : 1; // 0x470(0x01)
	char pad_470_3 : 5; // 0x470(0x01)
	char pad_471[0x7]; // 0x471(0x07)
	struct TArray<struct AActor*> PostRenderedActors; // 0x478(0x10)
	char pad_488[0x8]; // 0x488(0x08)
	struct TArray<struct FName> DebugDisplay; // 0x490(0x10)
	struct TArray<struct FName> ToggledDebugCategories; // 0x4a0(0x10)
	struct TArray<struct FName> DisabledInstanceNames; // 0x4b0(0x10)
	struct UCanvas* Canvas; // 0x4c0(0x08)
	struct UCanvas* DebugCanvas; // 0x4c8(0x08)
	struct TArray<struct FDebugTextInfo> DebugTextList; // 0x4d0(0x10)
	struct AActor* ShowDebugTargetDesiredClass; // 0x4e0(0x08)
	struct AActor* ShowDebugTargetActor; // 0x4e8(0x08)
	char pad_4F0[0x70]; // 0x4f0(0x70)

	void ShowHUD(); // Function Engine.HUD.ShowHUD // (RequiredAPI|Exec|Native|Public) // @ game+0x3c7de60
	void ShowDebugToggleSubCategory(struct FName Category); // Function Engine.HUD.ShowDebugToggleSubCategory // (Final|RequiredAPI|Exec|Native|Public) // @ game+0x4371970
	void ShowDebugToggleDisableInstanceName(struct FName InstanceName); // Function Engine.HUD.ShowDebugToggleDisableInstanceName // (Final|Exec|Native|Public) // @ game+0x4371860
	void ShowDebugForReticleTargetToggle(struct AActor* DesiredClass); // Function Engine.HUD.ShowDebugForReticleTargetToggle // (Final|RequiredAPI|Exec|Native|Public) // @ game+0x4371750
	void ShowDebug(struct FName DebugType); // Function Engine.HUD.ShowDebug // (RequiredAPI|Exec|Native|Public) // @ game+0x4371a80
	void RemoveDebugText(struct AActor* SrcActor, bool bLeaveDurationText); // Function Engine.HUD.RemoveDebugText // (Final|RequiredAPI|Net|NetReliableNative|Event|Public|NetClient) // @ game+0x43708b0
	void RemoveAllDebugStrings(); // Function Engine.HUD.RemoveAllDebugStrings // (Final|RequiredAPI|Net|NetReliableNative|Event|Public|NetClient) // @ game+0x4370b30
	void ReceiveHitBoxRelease(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxRelease // (RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveHitBoxEndCursorOver(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxEndCursorOver // (RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveHitBoxClick(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxClick // (RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveHitBoxBeginCursorOver(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxBeginCursorOver // (RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveDrawHUD(int32_t SizeX, int32_t SizeY); // Function Engine.HUD.ReceiveDrawHUD // (RequiredAPI|BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1b42740
	struct FVector Project(struct FVector Location, bool bClampToZeroPlane); // Function Engine.HUD.Project // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x436cba0
	void PreviousDebugTarget(); // Function Engine.HUD.PreviousDebugTarget // (RequiredAPI|Exec|Native|Public) // @ game+0x42ce250
	void NextDebugTarget(); // Function Engine.HUD.NextDebugTarget // (RequiredAPI|Exec|Native|Public) // @ game+0x42ce280
	void GetTextSize(struct FString Text, float& OutWidth, float& OutHeight, struct UFont* Font, float Scale); // Function Engine.HUD.GetTextSize // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x43704f0
	struct APlayerController* GetOwningPlayerController(); // Function Engine.HUD.GetOwningPlayerController // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x436c070
	struct APawn* GetOwningPawn(); // Function Engine.HUD.GetOwningPawn // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x436c030
	void GetActorsInSelectionRectangle(struct AActor* ClassFilter, struct FVector2D& FirstPoint, struct FVector2D& SecondPoint, struct TArray<struct AActor*>& OutActors, bool bIncludeNonCollidingComponents, bool bActorMustBeFullyEnclosed); // Function Engine.HUD.GetActorsInSelectionRectangle // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x436c400
	void DrawTextureSimple(struct UTexture* Texture, float ScreenX, float ScreenY, float Scale, bool bScalePosition); // Function Engine.HUD.DrawTextureSimple // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x436e700
	void DrawTexture(struct UTexture* Texture, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float TextureU, float TextureV, float TextureUWidth, float TextureVHeight, struct FLinearColor TintColor, enum class EBlendMode BlendMode, float Scale, bool bScalePosition, float Rotation, struct FVector2D RotPivot); // Function Engine.HUD.DrawTexture // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x436eb30
	void DrawText(struct FString Text, struct FLinearColor TextColor, float ScreenX, float ScreenY, struct UFont* Font, float Scale, bool bScalePosition); // Function Engine.HUD.DrawText // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x4370010
	void DrawRect(struct FLinearColor RectColor, float ScreenX, float ScreenY, float ScreenW, float ScreenH); // Function Engine.HUD.DrawRect // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x436f6e0
	void DrawMaterialTriangle(struct UMaterialInterface* Material, struct FVector2D V0_Pos, struct FVector2D V1_Pos, struct FVector2D V2_Pos, struct FVector2D V0_UV, struct FVector2D V1_UV, struct FVector2D V2_UV, struct FLinearColor V0_Color, struct FLinearColor V1_Color, struct FLinearColor V2_Color); // Function Engine.HUD.DrawMaterialTriangle // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x436cf50
	void DrawMaterialSimple(struct UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float Scale, bool bScalePosition); // Function Engine.HUD.DrawMaterialSimple // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x436d730
	void DrawMaterial(struct UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float MaterialU, float MaterialV, float MaterialUWidth, float MaterialVHeight, float Scale, bool bScalePosition, float Rotation, struct FVector2D RotPivot); // Function Engine.HUD.DrawMaterial // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x436dd20
	void DrawLine(float StartScreenX, float StartScreenY, float EndScreenX, float EndScreenY, struct FLinearColor LineColor, float LineThickness); // Function Engine.HUD.DrawLine // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x436fb40
	void Deproject(float ScreenX, float ScreenY, struct FVector& WorldPosition, struct FVector& WorldDirection); // Function Engine.HUD.Deproject // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x436c850
	void AddHitBox(struct FVector2D Position, struct FVector2D Size, struct FName InName, bool bConsumesInput, int32_t Priority); // Function Engine.HUD.AddHitBox // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x436c090
	void AddDebugText(struct FString DebugText, struct AActor* SrcActor, float Duration, struct FVector Offset, struct FVector DesiredOffset, struct FColor TextColor, bool bSkipOverwriteCheck, bool bAbsoluteLocation, bool bKeepAttachedToActor, struct UFont* InFont, float FontScale, bool bDrawShadow); // Function Engine.HUD.AddDebugText // (Final|RequiredAPI|Net|NetReliableNative|Event|Public|HasDefaults|NetClient) // @ game+0x4370c30
};

// Class Engine.BlueprintFunctionLibrary
// Size: 0x30 (Inherited: 0x30)
struct UBlueprintFunctionLibrary : UObject {
};

// Class Engine.ActorComponent
// Size: 0xd8 (Inherited: 0x30)
struct UActorComponent : UObject {
	char pad_30[0x18]; // 0x30(0x18)
	struct FActorComponentTickFunction PrimaryComponentTick; // 0x48(0x30)
	struct TArray<struct FName> ComponentTags; // 0x78(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x88(0x10)
	char pad_98[0x4]; // 0x98(0x04)
	int32_t UCSSerializationIndex; // 0x9c(0x04)
	char pad_A0_0 : 3; // 0xa0(0x01)
	char bNetAddressable : 1; // 0xa0(0x01)
	char bReplicateUsingRegisteredSubObjectList : 1; // 0xa0(0x01)
	char bReplicates : 1; // 0xa0(0x01)
	char pad_A0_6 : 2; // 0xa0(0x01)
	char pad_A1[0x7]; // 0xa1(0x07)
	uint64_t TickTimingsAccumulatedTotal; // 0xa8(0x08)
	uint64_t TickTimingsAccumulatedBP; // 0xb0(0x08)
	uint64_t TickTimingsStart; // 0xb8(0x08)
	char pad_C0[0x1]; // 0xc0(0x01)
	char pad_C1_0 : 4; // 0xc1(0x01)
	char bAutoActivate : 1; // 0xc1(0x01)
	char bIsActive : 1; // 0xc1(0x01)
	char bEditableWhenInherited : 1; // 0xc1(0x01)
	char pad_C1_7 : 1; // 0xc1(0x01)
	char bCanEverAffectNavigation : 1; // 0xc2(0x01)
	char pad_C2_1 : 1; // 0xc2(0x01)
	char bIsEditorOnly : 1; // 0xc2(0x01)
	char pad_C2_3 : 5; // 0xc2(0x01)
	char pad_C3[0x1]; // 0xc3(0x01)
	enum class EComponentCreationMethod CreationMethod; // 0xc4(0x01)
	struct FMulticastSparseDelegate OnComponentActivated; // 0xc5(0x01)
	struct FMulticastSparseDelegate OnComponentDeactivated; // 0xc6(0x01)
	char pad_C7[0x11]; // 0xc7(0x11)

	void ToggleActive(); // Function Engine.ActorComponent.ToggleActive // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa38f0
	void SetTickGroup(enum class ETickingGroup NewTickGroup); // Function Engine.ActorComponent.SetTickGroup // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa30a0
	void SetTickableWhenPaused(bool bTickableWhenPaused); // Function Engine.ActorComponent.SetTickableWhenPaused // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa36c0
	void SetIsReplicated(bool ShouldReplicate); // Function Engine.ActorComponent.SetIsReplicated // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa35c0
	void SetComponentTickIntervalAndCooldown(float TickInterval); // Function Engine.ActorComponent.SetComponentTickIntervalAndCooldown // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa32a0
	void SetComponentTickInterval(float TickInterval); // Function Engine.ActorComponent.SetComponentTickInterval // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa3390
	void SetComponentTickEnabled(bool bEnabled); // Function Engine.ActorComponent.SetComponentTickEnabled // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa34c0
	void SetCanEverAffectNavigation(bool bRelevant); // Function Engine.ActorComponent.SetCanEverAffectNavigation // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa2ba0
	void SetAutoActivate(bool bNewAutoActivate); // Function Engine.ActorComponent.SetAutoActivate // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa37c0
	void SetActive(bool bNewActive, bool bReset); // Function Engine.ActorComponent.SetActive // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa3920
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.RemoveTickPrerequisiteComponent // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa2ca0
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.RemoveTickPrerequisiteActor // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa2da0
	void ReceiveTick(float DeltaSeconds); // Function Engine.ActorComponent.ReceiveTick // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // Function Engine.ActorComponent.ReceiveEndPlay // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ReceiveAsyncPhysicsTick(float DeltaSeconds, float SimSeconds); // Function Engine.ActorComponent.ReceiveAsyncPhysicsTick // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // (RequiredAPI|Native|Public) // @ game+0x3bf0820
	void K2_DestroyComponent(struct UObject* Object); // Function Engine.ActorComponent.K2_DestroyComponent // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa3190
	bool IsComponentTickEnabled(); // Function Engine.ActorComponent.IsComponentTickEnabled // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3fa3480
	bool IsBeingDestroyed(); // Function Engine.ActorComponent.IsBeingDestroyed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3fa3c10
	bool IsActive(); // Function Engine.ActorComponent.IsActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3fa38c0
	struct AActor* GetOwner(); // Function Engine.ActorComponent.GetOwner // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3fa3bf0
	float GetComponentTickInterval(); // Function Engine.ActorComponent.GetComponentTickInterval // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3fa3280
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x28a8d30
	bool ComponentHasTag(struct FName Tag); // Function Engine.ActorComponent.ComponentHasTag // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3fa3ac0
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.AddTickPrerequisiteComponent // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa2ea0
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.AddTickPrerequisiteActor // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3fa2fa0
	void Activate(bool bReset); // Function Engine.ActorComponent.Activate // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3a32a70
};

// Class Engine.SceneComponent
// Size: 0x330 (Inherited: 0xd8)
struct USceneComponent : UActorComponent {
	char pad_D8[0x8]; // 0xd8(0x08)
	struct TWeakObjectPtr<struct APhysicsVolume> PhysicsVolume; // 0xe0(0x08)
	struct USceneComponent* AttachParent; // 0xe8(0x08)
	struct FName AttachSocketName; // 0xf0(0x0c)
	char pad_FC[0x4]; // 0xfc(0x04)
	struct TArray<struct USceneComponent*> AttachChildren; // 0x100(0x10)
	struct TArray<struct USceneComponent*> ClientAttachedChildren; // 0x110(0x10)
	char pad_120[0x50]; // 0x120(0x50)
	struct FVector RelativeLocation; // 0x170(0x18)
	struct FRotator RelativeRotation; // 0x188(0x18)
	struct FVector RelativeScale3D; // 0x1a0(0x18)
	struct FVector ComponentVelocity; // 0x1b8(0x18)
	char bComponentToWorldUpdated : 1; // 0x1d0(0x01)
	char pad_1D0_1 : 1; // 0x1d0(0x01)
	char bAbsoluteLocation : 1; // 0x1d0(0x01)
	char bAbsoluteRotation : 1; // 0x1d0(0x01)
	char bAbsoluteScale : 1; // 0x1d0(0x01)
	char bVisible : 1; // 0x1d0(0x01)
	char pad_1D0_6 : 2; // 0x1d0(0x01)
	char pad_1D1[0x4f]; // 0x1d1(0x4f)
	char bRenderInTargetViewMode : 1; // 0x220(0x01)
	char bShouldBeAttached : 1; // 0x220(0x01)
	char bShouldSnapLocationWhenAttached : 1; // 0x220(0x01)
	char bShouldSnapRotationWhenAttached : 1; // 0x220(0x01)
	char bShouldSnapScaleWhenAttached : 1; // 0x220(0x01)
	char bIgnoreTransformUpdatesFromParent : 1; // 0x220(0x01)
	char bShouldUpdatePhysicsVolume : 1; // 0x220(0x01)
	char bSkipChildTransformPropagation : 1; // 0x220(0x01)
	char bForceSkipUpdateOverlaps : 1; // 0x221(0x01)
	char bHiddenInGame : 1; // 0x221(0x01)
	char bBoundsChangeTriggersStreamingDataRebuild : 1; // 0x221(0x01)
	char bUseAttachParentBound : 1; // 0x221(0x01)
	char bComputeFastLocalBounds : 1; // 0x221(0x01)
	char bComputeBoundsOnceForGame : 1; // 0x221(0x01)
	char bComputedBoundsOnceForGame : 1; // 0x221(0x01)
	char bIsNotRenderAttachmentRoot : 1; // 0x221(0x01)
	char pad_222[0x1]; // 0x222(0x01)
	enum class EComponentMobility Mobility; // 0x223(0x01)
	enum class EDetailMode DetailMode; // 0x224(0x01)
	struct FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0x225(0x01)
	char pad_226[0x10a]; // 0x226(0x10a)

	void ToggleVisibility(bool bPropagateToChildren); // Function Engine.SceneComponent.ToggleVisibility // (Final|Native|Public|BlueprintCallable) // @ game+0x3d0d9f0
	void SetWorldScale3D(struct FVector NewScale); // Function Engine.SceneComponent.SetWorldScale3D // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3d10ac0
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren); // Function Engine.SceneComponent.SetVisibility // (Final|Native|Public|BlueprintCallable) // @ game+0x3d0db00
	void SetShouldUpdatePhysicsVolume(bool bInShouldUpdatePhysicsVolume); // Function Engine.SceneComponent.SetShouldUpdatePhysicsVolume // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d130a0
	void SetRenderInTargetViewMode(bool bValue); // Function Engine.SceneComponent.SetRenderInTargetViewMode // (Final|Native|Public|BlueprintCallable) // @ game+0x3d0d760
	void SetRelativeScale3D(struct FVector NewScale3D); // Function Engine.SceneComponent.SetRelativeScale3D // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3d12350
	void SetMobility(enum class EComponentMobility NewMobility); // Function Engine.SceneComponent.SetMobility // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d0cb60
	void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren); // Function Engine.SceneComponent.SetHiddenInGame // (Final|Native|Public|BlueprintCallable) // @ game+0x3d0d860
	void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale); // Function Engine.SceneComponent.SetAbsolute // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d0d0c0
	void ResetRelativeTransform(); // Function Engine.SceneComponent.ResetRelativeTransform // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d12450
	void OnRep_Visibility(bool OldValue); // Function Engine.SceneComponent.OnRep_Visibility // (Final|RequiredAPI|Native|Private) // @ game+0x3d12ed0
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform // (Final|RequiredAPI|Native|Private) // @ game+0x3d13080
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName // (Final|RequiredAPI|Native|Private) // @ game+0x3d13000
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent // (Final|RequiredAPI|Native|Private) // @ game+0x3d13060
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren // (Final|RequiredAPI|Native|Private) // @ game+0x3d13040
	void K2_SetWorldTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldTransform // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d10760
	void K2_SetWorldRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldRotation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d10bc0
	void K2_SetWorldLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldLocationAndRotation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d0cc60
	void K2_SetWorldLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldLocation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d10f60
	void K2_SetRelativeTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeTransform // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d124e0
	void K2_SetRelativeRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeRotation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d12840
	void K2_SetRelativeLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeLocationAndRotation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d0d320
	void K2_SetRelativeLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeLocation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d12b90
	struct FTransform K2_GetComponentToWorld(); // Function Engine.SceneComponent.K2_GetComponentToWorld // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0f870
	struct FVector K2_GetComponentScale(); // Function Engine.SceneComponent.K2_GetComponentScale // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0f8d0
	struct FRotator K2_GetComponentRotation(); // Function Engine.SceneComponent.K2_GetComponentRotation // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0f900
	struct FVector K2_GetComponentLocation(); // Function Engine.SceneComponent.K2_GetComponentLocation // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0f9c0
	void K2_DetachFromComponent(enum class EDetachmentRule LocationRule, enum class EDetachmentRule RotationRule, enum class EDetachmentRule ScaleRule, bool bCallModify); // Function Engine.SceneComponent.K2_DetachFromComponent // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d0e5e0
	bool K2_AttachToComponent(struct USceneComponent* Parent, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachToComponent // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d0ea50
	bool K2_AttachTo(struct USceneComponent* InParent, struct FName InSocketName, enum class EAttachLocation AttachType, bool bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachTo // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d0ee50
	void K2_AddWorldTransformKeepScale(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldTransformKeepScale // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d0f9f0
	void K2_AddWorldTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldTransform // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d0fd50
	void K2_AddWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldRotation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d100b0
	void K2_AddWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldOffset // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d10400
	void K2_AddRelativeRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddRelativeRotation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d11cb0
	void K2_AddRelativeLocation(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddRelativeLocation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d12010
	void K2_AddLocalTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalTransform // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d112b0
	void K2_AddLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalRotation // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d11610
	void K2_AddLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalOffset // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d11960
	bool IsVisible(); // Function Engine.SceneComponent.IsVisible // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0dc90
	bool IsSimulatingPhysics(struct FName BoneName); // Function Engine.SceneComponent.IsSimulatingPhysics // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0f690
	bool IsAnySimulatingPhysics(); // Function Engine.SceneComponent.IsAnySimulatingPhysics // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0f650
	struct FVector GetUpVector(); // Function Engine.SceneComponent.GetUpVector // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0f7f0
	struct FTransform GetSocketTransform(struct FName InSocketName, enum class ERelativeTransformSpace TransformSpace); // Function Engine.SceneComponent.GetSocketTransform // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0e1f0
	struct FRotator GetSocketRotation(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketRotation // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0df70
	struct FQuat GetSocketQuaternion(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketQuaternion // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0de40
	struct FVector GetSocketLocation(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketLocation // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0e0b0
	bool GetShouldUpdatePhysicsVolume(); // Function Engine.SceneComponent.GetShouldUpdatePhysicsVolume // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d131e0
	struct FVector GetRightVector(); // Function Engine.SceneComponent.GetRightVector // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0f7b0
	bool GetRenderInTargetViewMode(); // Function Engine.SceneComponent.GetRenderInTargetViewMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0d730
	struct FTransform GetRelativeTransform(); // Function Engine.SceneComponent.GetRelativeTransform // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d12470
	struct APhysicsVolume* GetPhysicsVolume(); // Function Engine.SceneComponent.GetPhysicsVolume // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0d700
	void GetParentComponents(struct TArray<struct USceneComponent*>& Parents); // Function Engine.SceneComponent.GetParentComponents // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0f470
	int32_t GetNumChildrenComponents(); // Function Engine.SceneComponent.GetNumChildrenComponents // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x37a6250
	struct FVector GetForwardVector(); // Function Engine.SceneComponent.GetForwardVector // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0f830
	struct FVector GetComponentVelocity(); // Function Engine.SceneComponent.GetComponentVelocity // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0dcd0
	void GetChildrenComponents(bool bIncludeAllDescendants, struct TArray<struct USceneComponent*>& Children); // Function Engine.SceneComponent.GetChildrenComponents // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0f170
	struct USceneComponent* GetChildComponent(int32_t ChildIndex); // Function Engine.SceneComponent.GetChildComponent // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0f360
	struct FName GetAttachSocketName(); // Function Engine.SceneComponent.GetAttachSocketName // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0f600
	struct USceneComponent* GetAttachParent(); // Function Engine.SceneComponent.GetAttachParent // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0f630
	struct TArray<struct FName> GetAllSocketNames(); // Function Engine.SceneComponent.GetAllSocketNames // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0e400
	bool DoesSocketExist(struct FName InSocketName); // Function Engine.SceneComponent.DoesSocketExist // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d0dd20
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify); // Function Engine.SceneComponent.DetachFromParent // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d0e8b0
	bool AreTexturesFullyStreamedIn(); // Function Engine.SceneComponent.AreTexturesFullyStreamedIn // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d0cb20
};

// Class Engine.PrimitiveComponent
// Size: 0x690 (Inherited: 0x330)
struct UPrimitiveComponent : USceneComponent {
	char pad_330[0x18]; // 0x330(0x18)
	enum class EUmbraComponentMode UmbraCullingMode; // 0x348(0x01)
	enum class EPrepassCullMode PrepassCullMode; // 0x349(0x01)
	char pad_34A[0x2]; // 0x34a(0x02)
	float MinDrawDistance; // 0x34c(0x04)
	float LDMaxDrawDistance; // 0x350(0x04)
	float CachedMaxDrawDistance; // 0x354(0x04)
	float CachedVertexFogIntensityFromVolumes; // 0x358(0x04)
	enum class ESceneDepthPriorityGroup DepthPriorityGroup; // 0x35c(0x01)
	enum class ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup; // 0x35d(0x01)
	enum class EIndirectLightingCacheQuality IndirectLightingCacheQuality; // 0x35e(0x01)
	enum class ELightmapType LightmapType; // 0x35f(0x01)
	enum class EHLODBatchingPolicy HLODBatchingPolicy; // 0x360(0x01)
	char bEnableAutoLODGeneration : 1; // 0x361(0x01)
	char bIsActorTextureStreamingBuiltData : 1; // 0x361(0x01)
	char bIsValidTextureStreamingBuiltData : 1; // 0x361(0x01)
	char pad_361_3 : 5; // 0x361(0x01)
	char pad_362[0x2]; // 0x362(0x02)
	char bIsFirstPerson : 1; // 0x364(0x01)
	char bIgnoreFOVChanges : 1; // 0x364(0x01)
	char pad_364_2 : 6; // 0x364(0x01)
	char pad_365[0x3]; // 0x365(0x03)
	char bNeverDistanceCull : 1; // 0x368(0x01)
	char pad_368_1 : 7; // 0x368(0x01)
	char pad_369[0x17]; // 0x369(0x17)
	char pad_380_0 : 2; // 0x380(0x01)
	char bAlwaysCreatePhysicsState : 1; // 0x380(0x01)
	char bGenerateOverlapEvents : 1; // 0x380(0x01)
	char bMultiBodyOverlap : 1; // 0x380(0x01)
	char bTraceComplexOnMove : 1; // 0x380(0x01)
	char bReturnMaterialOnMove : 1; // 0x380(0x01)
	char bUseViewOwnerDepthPriorityGroup : 1; // 0x380(0x01)
	char bAllowCullDistanceVolume : 1; // 0x381(0x01)
	char bVisibleInReflectionCaptures : 1; // 0x381(0x01)
	char bVisibleInRealTimeSkyCaptures : 1; // 0x381(0x01)
	char bVisibleInRayTracing : 1; // 0x381(0x01)
	char bRenderInMainPass : 1; // 0x381(0x01)
	char bRenderInDepthPass : 1; // 0x381(0x01)
	char bIsClippingVolume : 1; // 0x381(0x01)
	char bReceivesDecals : 1; // 0x381(0x01)
	char bReceivesFloorOnlyDecals : 1; // 0x382(0x01)
	char bDisableRGBAWrite : 1; // 0x382(0x01)
	char bHoldout : 1; // 0x382(0x01)
	char bOwnerNoSee : 1; // 0x382(0x01)
	char bOnlyOwnerSee : 1; // 0x382(0x01)
	char bTreatAsBackgroundForOcclusion : 1; // 0x382(0x01)
	char bUseAsOccluder : 1; // 0x382(0x01)
	char bSelectable : 1; // 0x382(0x01)
	char bForceMipStreaming : 1; // 0x383(0x01)
	char bHasPerInstanceHitProxies : 1; // 0x383(0x01)
	char CastShadow : 1; // 0x383(0x01)
	char bEmissiveLightSource : 1; // 0x383(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x383(0x01)
	char bAffectIndirectLightingWhileHidden : 1; // 0x383(0x01)
	char bAffectDistanceFieldLighting : 1; // 0x383(0x01)
	char bCastDynamicShadow : 1; // 0x383(0x01)
	char bCastStaticShadow : 1; // 0x384(0x01)
	char pad_384_1 : 7; // 0x384(0x01)
	enum class EShadowCacheInvalidationBehavior ShadowCacheInvalidationBehavior; // 0x385(0x01)
	char bCastVolumetricTranslucentShadow : 1; // 0x386(0x01)
	char bCastContactShadow : 1; // 0x386(0x01)
	char bSelfShadowOnly : 1; // 0x386(0x01)
	char bCastFarShadow : 1; // 0x386(0x01)
	char bCastInsetShadow : 1; // 0x386(0x01)
	char bCastCinematicShadow : 1; // 0x386(0x01)
	char bCastHiddenShadow : 1; // 0x386(0x01)
	char bCastShadowAsTwoSided : 1; // 0x386(0x01)
	char bLightAsIfStatic : 1; // 0x387(0x01)
	char bLightAttachmentsAsGroup : 1; // 0x387(0x01)
	char bExcludeFromLightAttachmentGroup : 1; // 0x387(0x01)
	char bReceiveMobileCSMShadows : 1; // 0x387(0x01)
	char bSingleSampleShadowFromStationaryLights : 1; // 0x387(0x01)
	char bIgnoreRadialImpulse : 1; // 0x387(0x01)
	char bIgnoreRadialForce : 1; // 0x387(0x01)
	char bApplyImpulseOnDamage : 1; // 0x387(0x01)
	char bReplicatePhysicsToAutonomousProxy : 1; // 0x388(0x01)
	char bFillCollisionUnderneathForNavmesh : 1; // 0x388(0x01)
	char bFillCollisionInsideForNavmesh : 1; // 0x388(0x01)
	char bFillCollisionAboveForNavmesh : 1; // 0x388(0x01)
	char AlwaysLoadOnClient : 1; // 0x388(0x01)
	char AlwaysLoadOnServer : 1; // 0x388(0x01)
	char bUseEditorCompositing : 1; // 0x388(0x01)
	char bIsBeingMovedByEditor : 1; // 0x388(0x01)
	char bRenderCustomDepth : 1; // 0x389(0x01)
	char bVisibleInSceneCaptureOnly : 1; // 0x389(0x01)
	char bHiddenInSceneCapture : 1; // 0x389(0x01)
	char bRayTracingFarField : 1; // 0x389(0x01)
	char pad_389_4 : 4; // 0x389(0x01)
	char pad_38A[0x2]; // 0x38a(0x02)
	char bEarlyZPassAggregatedMesh : 1; // 0x38c(0x01)
	char bTranslucencyPreDecal : 1; // 0x38c(0x01)
	char bOverrideCubemapSource : 1; // 0x38c(0x01)
	char pad_38C_3 : 5; // 0x38c(0x01)
	char pad_38D[0x3]; // 0x38d(0x03)
	enum class EMaterialCubemapSource CubemapSourceOverride; // 0x390(0x01)
	char pad_391[0x4f]; // 0x391(0x4f)
	enum class ELHMMirroringIgnoreType MirroringIgnoreType; // 0x3e0(0x01)
	char pad_3E1_0 : 1; // 0x3e1(0x01)
	char bHasNoStreamableTextures : 1; // 0x3e1(0x01)
	char bStaticWhenNotMoveable : 1; // 0x3e1(0x01)
	char pad_3E1_3 : 5; // 0x3e1(0x01)
	char pad_3E2[0x1f]; // 0x3e2(0x1f)
	enum class EHasCustomNavigableGeometry bHasCustomNavigableGeometry; // 0x401(0x01)
	char pad_402[0x1]; // 0x402(0x01)
	enum class ECanBeCharacterBase CanCharacterStepUpOn; // 0x403(0x01)
	struct FLightingChannels LightingChannels; // 0x404(0x01)
	char pad_405[0x3]; // 0x405(0x03)
	int32_t RayTracingGroupId; // 0x408(0x04)
	int32_t CustomDepthStencilValue; // 0x40c(0x04)
	struct FCustomPrimitiveData CustomPrimitiveData; // 0x410(0x10)
	struct FCustomPrimitiveData CustomPrimitiveDataInternal; // 0x420(0x10)
	char pad_430[0x10]; // 0x430(0x10)
	int32_t TranslucencySortPriority; // 0x440(0x04)
	float TranslucencySortDistanceOffset; // 0x444(0x04)
	char pad_448[0x4]; // 0x448(0x04)
	int32_t VisibilityId; // 0x44c(0x04)
	char pad_450[0x8]; // 0x450(0x08)
	struct TArray<struct URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x458(0x10)
	int8_t VirtualTextureLodBias; // 0x468(0x01)
	int8_t VirtualTextureCullMips; // 0x469(0x01)
	int8_t VirtualTextureMinCoverage; // 0x46a(0x01)
	enum class ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x46b(0x01)
	char pad_46C[0x10]; // 0x46c(0x10)
	float BoundsScale; // 0x47c(0x04)
	char pad_480[0x10]; // 0x480(0x10)
	struct TArray<struct AActor*> MoveIgnoreActors; // 0x490(0x10)
	struct TArray<struct UPrimitiveComponent*> MoveIgnoreComponents; // 0x4a0(0x10)
	char pad_4B0[0x10]; // 0x4b0(0x10)
	struct FBodyInstance BodyInstance; // 0x4c0(0x190)
	struct FMulticastSparseDelegate OnComponentHit; // 0x650(0x01)
	struct FMulticastSparseDelegate OnComponentBeginOverlap; // 0x651(0x01)
	struct FMulticastSparseDelegate OnComponentEndOverlap; // 0x652(0x01)
	struct FMulticastSparseDelegate OnComponentWake; // 0x653(0x01)
	struct FMulticastSparseDelegate OnComponentSleep; // 0x654(0x01)
	char pad_655[0x1]; // 0x655(0x01)
	struct FMulticastSparseDelegate OnComponentPhysicsStateChanged; // 0x656(0x01)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x657(0x01)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0x658(0x01)
	struct FMulticastSparseDelegate OnClicked; // 0x659(0x01)
	struct FMulticastSparseDelegate OnReleased; // 0x65a(0x01)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x65b(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x65c(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0x65d(0x01)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x65e(0x01)
	enum class ERayTracingGroupCullingPriority RayTracingGroupCullingPriority; // 0x65f(0x01)
	enum class ERendererStencilMask CustomDepthStencilWriteMask; // 0x660(0x01)
	char pad_661[0x1f]; // 0x661(0x1f)
	char ExcludeFromHLODLevels; // 0x680(0x01)
	char pad_681[0x7]; // 0x681(0x07)
	struct UPrimitiveComponent* LODParentPrimitive; // 0x688(0x08)

	bool WasRecentlyRendered(float Tolerance); // Function Engine.PrimitiveComponent.WasRecentlyRendered // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d00af0
	void WakeRigidBody(struct FName BoneName); // Function Engine.PrimitiveComponent.WakeRigidBody // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf9560
	void WakeAllRigidBodies(); // Function Engine.PrimitiveComponent.WakeAllRigidBodies // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf48f0
	void SetWalkableSlopeOverride(struct FWalkableSlopeOverride& NewOverride); // Function Engine.PrimitiveComponent.SetWalkableSlopeOverride // (RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3cfd2d0
	void SetVisibleInSceneCaptureOnly(bool bValue); // Function Engine.PrimitiveComponent.SetVisibleInSceneCaptureOnly // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf5570
	void SetVisibleInRayTracing(bool bNewVisibleInRayTracing); // Function Engine.PrimitiveComponent.SetVisibleInRayTracing // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf8ff0
	void SetVectorParameterForDefaultCustomPrimitiveData(struct FName ParameterName, struct FVector4 Value); // Function Engine.PrimitiveComponent.SetVectorParameterForDefaultCustomPrimitiveData // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cff140
	void SetVectorParameterForCustomPrimitiveData(struct FName ParameterName, struct FVector4 Value); // Function Engine.PrimitiveComponent.SetVectorParameterForCustomPrimitiveData // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cffc60
	void SetUseCCD(bool InUseCCD, struct FName BoneName); // Function Engine.PrimitiveComponent.SetUseCCD // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf39a0
	void SetTranslucentSortPriority(int32_t NewTranslucentSortPriority); // Function Engine.PrimitiveComponent.SetTranslucentSortPriority // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf8600
	void SetTranslucencySortDistanceOffset(float NewTranslucencySortDistanceOffset); // Function Engine.PrimitiveComponent.SetTranslucencySortDistanceOffset // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf84e0
	void SetTranslucencyPreDecal(bool bNewTranslucencyPreDecal); // Function Engine.PrimitiveComponent.SetTranslucencyPreDecal // (Final|Native|Public|BlueprintCallable) // @ game+0x3cf83c0
	void SetStaticWhenNotMoveable(bool bInStaticWhenNotMoveable); // Function Engine.PrimitiveComponent.SetStaticWhenNotMoveable // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cfd0a0
	void SetSingleSampleShadowFromStationaryLights(bool bNewSingleSampleShadowFromStationaryLights); // Function Engine.PrimitiveComponent.SetSingleSampleShadowFromStationaryLights // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf8700
	void SetSimulatePhysics(bool bSimulate); // Function Engine.PrimitiveComponent.SetSimulatePhysics // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cfd1d0
	void SetScalarParameterForDefaultCustomPrimitiveData(struct FName ParameterName, float Value); // Function Engine.PrimitiveComponent.SetScalarParameterForDefaultCustomPrimitiveData // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cff320
	void SetScalarParameterForCustomPrimitiveData(struct FName ParameterName, float Value); // Function Engine.PrimitiveComponent.SetScalarParameterForCustomPrimitiveData // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cffe40
	void SetRenderInMainPass(bool bValue); // Function Engine.PrimitiveComponent.SetRenderInMainPass // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf57a0
	void SetRenderInDepthPass(bool bValue); // Function Engine.PrimitiveComponent.SetRenderInDepthPass // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf5680
	void SetRenderCustomDepth(bool bValue); // Function Engine.PrimitiveComponent.SetRenderCustomDepth // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf5c10
	void SetReceivesDecals(bool bNewReceivesDecals); // Function Engine.PrimitiveComponent.SetReceivesDecals // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf8190
	void SetPhysMaterialOverride(struct UPhysicalMaterial* NewPhysMaterial); // Function Engine.PrimitiveComponent.SetPhysMaterialOverride // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf34c0
	void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInRadians // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf9d40
	void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInDegrees // (Final|Native|Public|BlueprintCallable) // @ game+0x3cf9f90
	void SetPhysicsLinearVelocity(struct FVector NewVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfacd0
	void SetPhysicsAngularVelocityInRadians(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocityInRadians // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfa480
	void SetPhysicsAngularVelocityInDegrees(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocityInDegrees // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfa1f0
	void SetOwnerNoSee(bool bNewOwnerNoSee); // Function Engine.PrimitiveComponent.SetOwnerNoSee // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf9230
	void SetOnlyOwnerSee(bool bNewOnlyOwnerSee); // Function Engine.PrimitiveComponent.SetOnlyOwnerSee // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf9110
	void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision); // Function Engine.PrimitiveComponent.SetNotifyRigidBodyCollision // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf9350
	void SetMaterialByName(struct FName MaterialSlotName, struct UMaterialInterface* Material); // Function Engine.PrimitiveComponent.SetMaterialByName // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cfdb20
	void SetMaterial(int32_t ElementIndex, struct UMaterialInterface* Material); // Function Engine.PrimitiveComponent.SetMaterial // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cfdce0
	void SetMassScale(struct FName BoneName, float InMassScale); // Function Engine.PrimitiveComponent.SetMassScale // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf4370
	void SetMassOverrideInKg(struct FName BoneName, float MassInKg, bool bOverrideMass); // Function Engine.PrimitiveComponent.SetMassOverrideInKg // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf3ef0
	void SetLinearDamping(float InDamping); // Function Engine.PrimitiveComponent.SetLinearDamping // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf46b0
	void SetLightingChannels(bool bChannel0, bool bChannel1, bool bChannel2); // Function Engine.PrimitiveComponent.SetLightingChannels // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d010a0
	void SetLightAttachmentsAsGroup(bool bInLightAttachmentsAsGroup); // Function Engine.PrimitiveComponent.SetLightAttachmentsAsGroup // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf8940
	void SetIsFirstPerson(bool bValue); // Function Engine.PrimitiveComponent.SetIsFirstPerson // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d015d0
	void SetIgnoreFOVChanges(bool bValue); // Function Engine.PrimitiveComponent.SetIgnoreFOVChanges // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d01470
	void SetIgnoreBoundsForEditorFocus(bool bIgnore); // Function Engine.PrimitiveComponent.SetIgnoreBoundsForEditorFocus // (Final|Native|Public|BlueprintCallable) // @ game+0x3cfe0b0
	void SetHoldout(bool bNewHoldout); // Function Engine.PrimitiveComponent.SetHoldout // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf8070
	void SetHiddenInSceneCapture(bool bValue); // Function Engine.PrimitiveComponent.SetHiddenInSceneCapture // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf5450
	void SetGenerateOverlapEvents(bool bInGenerateOverlapEvents); // Function Engine.PrimitiveComponent.SetGenerateOverlapEvents // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d012e0
	void SetExcludeFromLightAttachmentGroup(bool bInExcludeFromLightAttachmentGroup); // Function Engine.PrimitiveComponent.SetExcludeFromLightAttachmentGroup // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf8820
	void SetExcludeForSpecificHLODLevels(struct TArray<int32_t>& InExcludeForSpecificHLODLevels); // Function Engine.PrimitiveComponent.SetExcludeForSpecificHLODLevels // (Final|RequiredAPI|Native|Private|HasOutParms|BlueprintCallable) // @ game+0x3d00c70
	void SetExcludedFromHLODLevel(enum class EHLODLevelExclusion HLODLevel, bool bExcluded); // Function Engine.PrimitiveComponent.SetExcludedFromHLODLevel // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d00db0
	void SetEnableGravity(bool bGravityEnabled); // Function Engine.PrimitiveComponent.SetEnableGravity // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf47f0
	void SetEnableAlphaWrite(bool bInEnableAlphaWrite); // Function Engine.PrimitiveComponent.SetEnableAlphaWrite // (Final|Native|Public|BlueprintCallable) // @ game+0x3516750
	void SetEmissiveLightSource(bool NewEmissiveLightSource); // Function Engine.PrimitiveComponent.SetEmissiveLightSource // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf8db0
	void SetDefaultCustomPrimitiveDataVector4(int32_t DataIndex, struct FVector4 Value); // Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataVector4 // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfe750
	void SetDefaultCustomPrimitiveDataVector3(int32_t DataIndex, struct FVector Value); // Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataVector3 // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfea50
	void SetDefaultCustomPrimitiveDataVector2(int32_t DataIndex, struct FVector2D Value); // Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataVector2 // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfed30
	void SetDefaultCustomPrimitiveDataFloat(int32_t DataIndex, float Value); // Function Engine.PrimitiveComponent.SetDefaultCustomPrimitiveDataFloat // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cfefb0
	void SetCustomPrimitiveDataVector4(int32_t DataIndex, struct FVector4 Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector4 // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cff5d0
	void SetCustomPrimitiveDataVector3(int32_t DataIndex, struct FVector Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector3 // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cff790
	void SetCustomPrimitiveDataVector2(int32_t DataIndex, struct FVector2D Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector2 // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cff940
	void SetCustomPrimitiveDataFloat(int32_t DataIndex, float Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataFloat // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cffad0
	void SetCustomDepthStencilWriteMask(enum class ERendererStencilMask WriteMaskBit); // Function Engine.PrimitiveComponent.SetCustomDepthStencilWriteMask // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf58e0
	void SetCustomDepthStencilValue(int32_t Value); // Function Engine.PrimitiveComponent.SetCustomDepthStencilValue // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf59e0
	void SetCullDistance(float NewCullDistance); // Function Engine.PrimitiveComponent.SetCullDistance // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf33d0
	void SetConstraintMode(enum class EDOFMode ConstraintMode); // Function Engine.PrimitiveComponent.SetConstraintMode // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cfcf70
	void SetCollisionResponseToChannel(enum class ECollisionChannel Channel, enum class ECollisionResponse NewResponse); // Function Engine.PrimitiveComponent.SetCollisionResponseToChannel // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf36c0
	void SetCollisionResponseToAllChannels(enum class ECollisionResponse NewResponse); // Function Engine.PrimitiveComponent.SetCollisionResponseToAllChannels // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf35c0
	void SetCollisionProfileName(struct FName InCollisionProfileName, bool bUpdateOverlaps); // Function Engine.PrimitiveComponent.SetCollisionProfileName // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf7b70
	void SetCollisionObjectType(enum class ECollisionChannel Channel); // Function Engine.PrimitiveComponent.SetCollisionObjectType // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf79e0
	void SetCollisionEnabled(enum class ECollisionEnabled NewType); // Function Engine.PrimitiveComponent.SetCollisionEnabled // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf7d30
	void SetCenterOfMass(struct FVector CenterOfMassOffset, struct FName BoneName); // Function Engine.PrimitiveComponent.SetCenterOfMass // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cf9670
	void SetCastShadow(bool NewCastShadow); // Function Engine.PrimitiveComponent.SetCastShadow // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf8ed0
	void SetCastInsetShadow(bool bInCastInsetShadow); // Function Engine.PrimitiveComponent.SetCastInsetShadow // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf8b70
	void SetCastHiddenShadow(bool NewCastHiddenShadow); // Function Engine.PrimitiveComponent.SetCastHiddenShadow // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf8c90
	void SetCastContactShadow(bool bInCastContactShadow); // Function Engine.PrimitiveComponent.SetCastContactShadow // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf8a60
	void SetBoundsScale(float NewBoundsScale); // Function Engine.PrimitiveComponent.SetBoundsScale // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cfdf90
	void SetAngularDamping(float InDamping); // Function Engine.PrimitiveComponent.SetAngularDamping // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf4570
	void SetAllUseCCD(bool InUseCCD); // Function Engine.PrimitiveComponent.SetAllUseCCD // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf38a0
	void SetAllPhysicsLinearVelocity(struct FVector NewVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfa700
	void SetAllPhysicsAngularVelocityInRadians(struct FVector& NewAngVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInRadians // (RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3cf4920
	void SetAllPhysicsAngularVelocityInDegrees(struct FVector& NewAngVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInDegrees // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3cf4ad0
	void SetAllMassScale(float InMassScale); // Function Engine.PrimitiveComponent.SetAllMassScale // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf4150
	void SetAffectIndirectLightingWhileHidden(bool bNewAffectIndirectLightingWhileHidden); // Function Engine.PrimitiveComponent.SetAffectIndirectLightingWhileHidden // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf7e30
	void SetAffectDynamicIndirectLighting(bool bNewAffectDynamicIndirectLighting); // Function Engine.PrimitiveComponent.SetAffectDynamicIndirectLighting // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf7f50
	void SetAffectDistanceFieldLighting(bool NewAffectDistanceFieldLighting); // Function Engine.PrimitiveComponent.SetAffectDistanceFieldLighting // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf82a0
	struct FVector ScaleByMomentOfInertia(struct FVector InputVector, struct FName BoneName); // Function Engine.PrimitiveComponent.ScaleByMomentOfInertia // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf3b70
	void PutRigidBodyToSleep(struct FName BoneName); // Function Engine.PrimitiveComponent.PutRigidBodyToSleep // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cf9450
	bool K2_SphereTraceComponent(struct FVector TraceStart, struct FVector TraceEnd, float SphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_SphereTraceComponent // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3cf6bb0
	bool K2_SphereOverlapComponent(struct FVector InSphereCentre, float InSphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_SphereOverlapComponent // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3cf5d20
	bool K2_LineTraceComponent(struct FVector TraceStart, struct FVector TraceEnd, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_LineTraceComponent // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3cf7390
	bool K2_IsQueryCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsQueryCollisionEnabled // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf4e30
	bool K2_IsPhysicsCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsPhysicsCollisionEnabled // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf4df0
	bool K2_IsCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsCollisionEnabled // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf4e80
	bool K2_BoxOverlapComponent(struct FVector InBoxCentre, struct FBox InBox, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_BoxOverlapComponent // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3cf6450
	bool IsOverlappingComponent(struct UPrimitiveComponent* OtherComp); // Function Engine.PrimitiveComponent.IsOverlappingComponent // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cfe650
	bool IsOverlappingActor(struct AActor* Other); // Function Engine.PrimitiveComponent.IsOverlappingActor // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cfe500
	bool IsGravityEnabled(); // Function Engine.PrimitiveComponent.IsGravityEnabled // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf47b0
	bool IsExcludedFromHLODLevel(enum class EHLODLevelExclusion HLODLevel); // Function Engine.PrimitiveComponent.IsExcludedFromHLODLevel // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d00f60
	bool IsAnyRigidBodyAwake(); // Function Engine.PrimitiveComponent.IsAnyRigidBodyAwake // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3cf3860
	void InvalidateLumenSurfaceCache(); // Function Engine.PrimitiveComponent.InvalidateLumenSurfaceCache // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d01060
	void IgnoreComponentWhenMoving(struct UPrimitiveComponent* Component, bool bShouldIgnore); // Function Engine.PrimitiveComponent.IgnoreComponentWhenMoving // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d003d0
	void IgnoreActorWhenMoving(struct AActor* Actor, bool bShouldIgnore); // Function Engine.PrimitiveComponent.IgnoreActorWhenMoving // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d00860
	struct FWalkableSlopeOverride GetWalkableSlopeOverride(); // Function Engine.PrimitiveComponent.GetWalkableSlopeOverride // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cfd3e0
	bool GetStaticWhenNotMoveable(); // Function Engine.PrimitiveComponent.GetStaticWhenNotMoveable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cfd070
	bool GetRenderInLevelGeometryOnlyViewMode(); // Function Engine.PrimitiveComponent.GetRenderInLevelGeometryOnlyViewMode // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d01430
	struct FVector GetPhysicsLinearVelocityAtPoint(struct FVector Point, struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocityAtPoint // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfa8c0
	struct FVector GetPhysicsLinearVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfab20
	struct FVector GetPhysicsAngularVelocityInRadians(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInRadians // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf99f0
	struct FVector GetPhysicsAngularVelocityInDegrees(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInDegrees // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf9b90
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*>& OutOverlappingComponents); // Function Engine.PrimitiveComponent.GetOverlappingComponents // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cfe1f0
	void GetOverlappingActors(struct TArray<struct AActor*>& OverlappingActors, struct AActor* ClassFilter); // Function Engine.PrimitiveComponent.GetOverlappingActors // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cfe320
	int32_t GetNumMaterials(); // Function Engine.PrimitiveComponent.GetNumMaterials // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf5410
	struct UMaterialInterface* GetMaterialFromCollisionFaceIndex(int32_t FaceIndex, int32_t& SectionIndex); // Function Engine.PrimitiveComponent.GetMaterialFromCollisionFaceIndex // (RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cfd460
	struct UMaterialInterface* GetMaterial(int32_t ElementIndex); // Function Engine.PrimitiveComponent.GetMaterial // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cfde80
	float GetMassScale(struct FName BoneName); // Function Engine.PrimitiveComponent.GetMassScale // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf4250
	float GetMass(); // Function Engine.PrimitiveComponent.GetMass // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf3eb0
	float GetLinearDamping(); // Function Engine.PrimitiveComponent.GetLinearDamping // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf4670
	bool GetIsFirstPerson(); // Function Engine.PrimitiveComponent.GetIsFirstPerson // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d015a0
	struct FVector GetInertiaTensor(struct FName BoneName); // Function Engine.PrimitiveComponent.GetInertiaTensor // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf3d70
	bool GetIgnoreFOVChanges(); // Function Engine.PrimitiveComponent.GetIgnoreFOVChanges // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d01570
	bool GetIgnoreBoundsForEditorFocus(); // Function Engine.PrimitiveComponent.GetIgnoreBoundsForEditorFocus // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cfe1b0
	bool GetGenerateOverlapEvents(); // Function Engine.PrimitiveComponent.GetGenerateOverlapEvents // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d01400
	struct TArray<int32_t> GetExcludeForSpecificHLODLevels(); // Function Engine.PrimitiveComponent.GetExcludeForSpecificHLODLevels // (Final|RequiredAPI|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d00bf0
	int32_t GetCustomPrimitiveDataIndexForVectorParameter(struct FName ParameterName); // Function Engine.PrimitiveComponent.GetCustomPrimitiveDataIndexForVectorParameter // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cffff0
	int32_t GetCustomPrimitiveDataIndexForScalarParameter(struct FName ParameterName); // Function Engine.PrimitiveComponent.GetCustomPrimitiveDataIndexForScalarParameter // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d00100
	enum class ECollisionResponse GetCollisionResponseToChannel(enum class ECollisionChannel Channel); // Function Engine.PrimitiveComponent.GetCollisionResponseToChannel // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf4ce0
	struct FName GetCollisionProfileName(); // Function Engine.PrimitiveComponent.GetCollisionProfileName // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf7ae0
	enum class ECollisionChannel GetCollisionObjectType(); // Function Engine.PrimitiveComponent.GetCollisionObjectType // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf4ca0
	enum class ECollisionEnabled GetCollisionEnabled(); // Function Engine.PrimitiveComponent.GetCollisionEnabled // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf4ec0
	float GetClosestPointOnCollision(struct FVector& Point, struct FVector& OutPointOnBody, struct FName BoneName); // Function Engine.PrimitiveComponent.GetClosestPointOnCollision // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf4f00
	struct FVector GetCenterOfMass(struct FName BoneName); // Function Engine.PrimitiveComponent.GetCenterOfMass // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf9890
	struct FBodyInstanceAsyncPhysicsTickHandle GetBodyInstanceAsyncPhysicsTickHandle(struct FName BoneName, bool bGetWelded, int32_t Index); // Function Engine.PrimitiveComponent.GetBodyInstanceAsyncPhysicsTickHandle // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf5170
	enum class EAresOutlineMode GetAresOutlineMode(); // Function Engine.PrimitiveComponent.GetAresOutlineMode // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf58c0
	float GetAngularDamping(); // Function Engine.PrimitiveComponent.GetAngularDamping // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf4530
	struct UMaterialInstanceDynamic* CreateDynamicMaterialInstance(int32_t ElementIndex, struct UMaterialInterface* SourceMaterial, struct FName OptionalName); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cfd600
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(int32_t ElementIndex, struct UMaterialInterface* Parent); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cfd870
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic(int32_t ElementIndex); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cfda10
	struct TArray<struct UPrimitiveComponent*> CopyArrayOfMoveIgnoreComponents(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreComponents // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d00240
	struct TArray<struct AActor*> CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d006d0
	void ClearMoveIgnoreComponents(); // Function Engine.PrimitiveComponent.ClearMoveIgnoreComponents // (Final|Native|Public|BlueprintCallable) // @ game+0x3d00210
	void ClearMoveIgnoreActors(); // Function Engine.PrimitiveComponent.ClearMoveIgnoreActors // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d006a0
	bool CanCharacterStepUp(struct APawn* Pawn); // Function Engine.PrimitiveComponent.CanCharacterStepUp // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cf32c0
	void AddVelocityChangeImpulseAtLocation(struct FVector Impulse, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddVelocityChangeImpulseAtLocation // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfc300
	void AddTorqueInRadians(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorqueInRadians // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfb1e0
	void AddTorqueInDegrees(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorqueInDegrees // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfaf50
	void AddRadialImpulse(struct FVector Origin, float Radius, float Strength, enum class ERadialImpulseFalloff Falloff, bool bVelChange); // Function Engine.PrimitiveComponent.AddRadialImpulse // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfbf60
	void AddRadialForce(struct FVector Origin, float Radius, float Strength, enum class ERadialImpulseFalloff Falloff, bool bAccelChange); // Function Engine.PrimitiveComponent.AddRadialForce // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfb460
	void AddImpulseAtLocation(struct FVector Impulse, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddImpulseAtLocation // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfc570
	void AddImpulse(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddImpulse // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfccf0
	void AddForceAtLocationLocal(struct FVector Force, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfb800
	void AddForceAtLocation(struct FVector Force, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocation // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfba70
	void AddForce(struct FVector Force, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddForce // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfbce0
	void AddAngularImpulseInRadians(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulseInRadians // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfca70
	void AddAngularImpulseInDegrees(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulseInDegrees // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3cfc7e0
};

// Class Engine.Info
// Size: 0x460 (Inherited: 0x460)
struct AInfo : AActor {
};

// Class Engine.MeshComponent
// Size: 0x6e0 (Inherited: 0x690)
struct UMeshComponent : UPrimitiveComponent {
	struct TArray<struct UMaterialInterface*> OverrideMaterials; // 0x690(0x10)
	struct UMaterialInterface* OverlayMaterial; // 0x6a0(0x08)
	float OverlayMaterialMaxDrawDistance; // 0x6a8(0x04)
	char bOverrideDisableOcclusionQuery : 1; // 0x6ac(0x01)
	char pad_6AC_1 : 7; // 0x6ac(0x01)
	char pad_6AD[0x3]; // 0x6ad(0x03)
	struct FLinearColor OverlayColor; // 0x6b0(0x10)
	char pad_6C0[0x10]; // 0x6c0(0x10)
	char bEnableMaterialParameterCaching : 1; // 0x6d0(0x01)
	char pad_6D0_1 : 7; // 0x6d0(0x01)
	char pad_6D1[0xf]; // 0x6d1(0x0f)

	void SetVectorParameterValueOnMaterials(struct FName ParameterName, struct FVector ParameterValue); // Function Engine.MeshComponent.SetVectorParameterValueOnMaterials // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x40541e0
	void SetScalarParameterValueOnMaterials(struct FName ParameterName, float ParameterValue); // Function Engine.MeshComponent.SetScalarParameterValueOnMaterials // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40543b0
	void SetOverlayMaterialMaxDrawDistance(float InMaxDrawDistance); // Function Engine.MeshComponent.SetOverlayMaterialMaxDrawDistance // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40547f0
	void SetOverlayMaterial(struct UMaterialInterface* NewOverlayMaterial); // Function Engine.MeshComponent.SetOverlayMaterial // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x4054950
	void PrestreamTextures(float Seconds, bool bPrioritizeCharacterTextures, int32_t CinematicTextureGroups); // Function Engine.MeshComponent.PrestreamTextures // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x4054560
	bool IsMaterialSlotNameValid(struct FName MaterialSlotName); // Function Engine.MeshComponent.IsMaterialSlotNameValid // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x4054ac0
	float GetOverlayMaterialMaxDrawDistance(); // Function Engine.MeshComponent.GetOverlayMaterialMaxDrawDistance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40548f0
	struct UMaterialInterface* GetOverlayMaterial(); // Function Engine.MeshComponent.GetOverlayMaterial // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x4054a70
	struct TArray<struct FName> GetMaterialSlotNames(); // Function Engine.MeshComponent.GetMaterialSlotNames // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x4054be0
	struct TArray<struct UMaterialInterface*> GetMaterials(); // Function Engine.MeshComponent.GetMaterials // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x4054db0
	int32_t GetMaterialIndex(struct FName MaterialSlotName); // Function Engine.MeshComponent.GetMaterialIndex // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x4054c90
	void EmptyOverrideMaterials(); // Function Engine.MeshComponent.EmptyOverrideMaterials // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x4054790
};

// Class Engine.StaticMeshComponent
// Size: 0x770 (Inherited: 0x6e0)
struct UStaticMeshComponent : UMeshComponent {
	int32_t ForcedLodModel; // 0x6d8(0x04)
	int32_t PreviousLODLevel; // 0x6dc(0x04)
	int32_t MinLOD; // 0x6e0(0x04)
	int32_t MaxLOD; // 0x6e4(0x04)
	int32_t SubDivisionStepSize; // 0x6e8(0x04)
	struct UStaticMesh* StaticMesh; // 0x6f0(0x08)
	struct FColor WireframeColorOverride; // 0x6f8(0x04)
	char bForceNaniteForMasked : 1; // 0x6fc(0x01)
	char bDisallowNanite : 1; // 0x6fc(0x01)
	char bForceDisableNanite : 1; // 0x6fc(0x01)
	char bEvaluateWorldPositionOffset : 1; // 0x6fc(0x01)
	char bWorldPositionOffsetWritesVelocity : 1; // 0x6fc(0x01)
	char bEvaluateWorldPositionOffsetInRayTracing : 1; // 0x6fc(0x01)
	int32_t WorldPositionOffsetDisableDistance; // 0x700(0x04)
	char bOverrideWireframeColor : 1; // 0x704(0x01)
	char bOverrideMinLOD : 1; // 0x704(0x01)
	char pad_705_0 : 3; // 0x705(0x01)
	char bOverrideMaxLOD : 1; // 0x704(0x01)
	char bOverrideNavigationExport : 1; // 0x704(0x01)
	char bForceNavigationObstacle : 1; // 0x704(0x01)
	char bDisallowMeshPaintPerInstance : 1; // 0x704(0x01)
	char bIgnoreInstanceForTextureStreaming : 1; // 0x704(0x01)
	char bOverrideLightMapRes : 1; // 0x705(0x01)
	char bCastDistanceFieldIndirectShadow : 1; // 0x705(0x01)
	char bOverrideDistanceFieldSelfShadowBias : 1; // 0x705(0x01)
	char bUseSubDivisions : 1; // 0x705(0x01)
	char bUseDefaultCollision : 1; // 0x705(0x01)
	char bSortTriangles : 1; // 0x705(0x01)
	char bReverseCulling : 1; // 0x705(0x01)
	char pad_706_7 : 1; // 0x706(0x01)
	char pad_707[0x1]; // 0x707(0x01)
	int32_t OverriddenLightMapRes; // 0x708(0x04)
	float DistanceFieldIndirectShadowMinVisibility; // 0x70c(0x04)
	float DistanceFieldSelfShadowBias; // 0x710(0x04)
	float StreamingDistanceMultiplier; // 0x714(0x04)
	struct TArray<struct FStaticMeshComponentLODInfo> LODData; // 0x718(0x10)
	struct TArray<struct FStreamingTextureBuildInfo> StreamingTextureData; // 0x728(0x10)
	struct FLightmassPrimitiveSettings LightmassSettings; // 0x738(0x1c)
	char pad_754[0x1c]; // 0x754(0x1c)

	void SetWorldPositionOffsetDisableDistance(int32_t NewValue); // Function Engine.StaticMeshComponent.SetWorldPositionOffsetDisableDistance // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x410bd10
	bool SetStaticMesh(struct UStaticMesh* NewMesh); // Function Engine.StaticMeshComponent.SetStaticMesh // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x410c600
	void SetReverseCulling(bool ReverseCulling); // Function Engine.StaticMeshComponent.SetReverseCulling // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x410ba10
	void SetForcedLodModel(int32_t NewForcedLodModel); // Function Engine.StaticMeshComponent.SetForcedLodModel // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x410c500
	void SetForceDisableNanite(bool bInForceDisableNanite); // Function Engine.StaticMeshComponent.SetForceDisableNanite // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x410b8e0
	void SetEvaluateWorldPositionOffsetInRayTracing(bool NewValue); // Function Engine.StaticMeshComponent.SetEvaluateWorldPositionOffsetInRayTracing // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x410c070
	void SetEvaluateWorldPositionOffset(bool NewValue); // Function Engine.StaticMeshComponent.SetEvaluateWorldPositionOffset // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x410be40
	void SetDistanceFieldSelfShadowBias(float NewValue); // Function Engine.StaticMeshComponent.SetDistanceFieldSelfShadowBias // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x410c2b0
	void OnRep_StaticMesh(struct UStaticMesh* OldStaticMesh); // Function Engine.StaticMeshComponent.OnRep_StaticMesh // (Final|RequiredAPI|Native|Public) // @ game+0x410c710
	void GetLocalBounds(struct FVector& Min, struct FVector& Max); // Function Engine.StaticMeshComponent.GetLocalBounds // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x410bb30
	bool GetInitialEvaluateWorldPositionOffset(); // Function Engine.StaticMeshComponent.GetInitialEvaluateWorldPositionOffset // (Final|Native|Public|BlueprintCallable) // @ game+0x410bce0
};

// Class Engine.InstancedStaticMeshComponent
// Size: 0x8b0 (Inherited: 0x770)
struct UInstancedStaticMeshComponent : UStaticMeshComponent {
	struct TArray<struct FInstancedStaticMeshInstanceData> PerInstanceSMData; // 0x770(0x10)
	struct TArray<struct FMatrix> PerInstancePrevTransform; // 0x780(0x10)
	int32_t NumCustomDataFloats; // 0x790(0x04)
	char pad_794[0x4]; // 0x794(0x04)
	struct TArray<float> PerInstanceSMCustomData; // 0x798(0x10)
	int32_t InstancingRandomSeed; // 0x7a8(0x04)
	char pad_7AC[0x4]; // 0x7ac(0x04)
	struct TArray<struct FInstancedStaticMeshRandomSeed> AdditionalRandomSeeds; // 0x7b0(0x10)
	int32_t InstanceStartCullDistance; // 0x7c0(0x04)
	int32_t InstanceEndCullDistance; // 0x7c4(0x04)
	struct TArray<int32_t> InstanceReorderTable; // 0x7c8(0x10)
	char pad_7D8[0xc4]; // 0x7d8(0xc4)
	int32_t NumPendingLightmaps; // 0x89c(0x04)
	struct TArray<struct FInstancedStaticMeshMappingInfo> CachedMappings; // 0x8a0(0x10)

	bool UpdateInstanceTransform(int32_t InstanceIndex, struct FTransform& NewInstanceTransform, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Function Engine.InstancedStaticMeshComponent.UpdateInstanceTransform // (RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3c8fa30
	void SetNumCustomDataFloats(int32_t InNumCustomDataFloats); // Function Engine.InstancedStaticMeshComponent.SetNumCustomDataFloats // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c900d0
	bool SetCustomDataValue(int32_t InstanceIndex, int32_t CustomDataIndex, float CustomDataValue, bool bMarkRenderStateDirty); // Function Engine.InstancedStaticMeshComponent.SetCustomDataValue // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c901d0
	void SetCullDistances(int32_t StartCullDistance, int32_t EndCullDistance); // Function Engine.InstancedStaticMeshComponent.SetCullDistances // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c8ec80
	bool RemoveInstances(struct TArray<int32_t>& InstancesToRemove); // Function Engine.InstancedStaticMeshComponent.RemoveInstances // (RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c8ef70
	bool RemoveInstance(int32_t InstanceIndex); // Function Engine.InstancedStaticMeshComponent.RemoveInstance // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c8f0a0
	bool IsValidInstance(int32_t InstanceIndex); // Function Engine.InstancedStaticMeshComponent.IsValidInstance // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c8ee20
	bool GetInstanceTransform(int32_t InstanceIndex, struct FTransform& OutInstanceTransform, bool bWorldSpace); // Function Engine.InstancedStaticMeshComponent.GetInstanceTransform // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c8fe20
	struct TArray<int32_t> GetInstancesOverlappingSphere(struct FVector& Center, float Radius, bool bSphereInWorldSpace); // Function Engine.InstancedStaticMeshComponent.GetInstancesOverlappingSphere // (RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c8e830
	struct TArray<int32_t> GetInstancesOverlappingBox(struct FBox& Box, bool bBoxInWorldSpace); // Function Engine.InstancedStaticMeshComponent.GetInstancesOverlappingBox // (RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c8e620
	int32_t GetInstanceCount(); // Function Engine.InstancedStaticMeshComponent.GetInstanceCount // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c8ef20
	void GetCullDistances(int32_t& OutStartCullDistance, int32_t& OutEndCullDistance); // Function Engine.InstancedStaticMeshComponent.GetCullDistances // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c8eae0
	void ClearInstances(); // Function Engine.InstancedStaticMeshComponent.ClearInstances // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c8ef40
	bool BatchUpdateInstancesTransforms(int32_t StartInstanceIndex, struct TArray<struct FTransform>& NewInstancesTransforms, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Function Engine.InstancedStaticMeshComponent.BatchUpdateInstancesTransforms // (RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c8f630
	bool BatchUpdateInstancesTransform(int32_t StartInstanceIndex, int32_t NumInstances, struct FTransform& NewInstancesTransform, bool bWorldSpace, bool bMarkRenderStateDirty, bool bTeleport); // Function Engine.InstancedStaticMeshComponent.BatchUpdateInstancesTransform // (RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3c8f1b0
	int32_t AddInstanceWorldSpace(struct FTransform& WorldTransform); // Function Engine.InstancedStaticMeshComponent.AddInstanceWorldSpace // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3c904b0
	struct TArray<int32_t> AddInstances(struct TArray<struct FTransform>& InstanceTransforms, bool bShouldReturnIndices, bool bWorldSpace); // Function Engine.InstancedStaticMeshComponent.AddInstances // (RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c90620
	int32_t AddInstance(struct FTransform& InstanceTransform, bool bWorldSpace); // Function Engine.InstancedStaticMeshComponent.AddInstance // (RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3c90930
};

// Class Engine.HierarchicalInstancedStaticMeshComponent
// Size: 0xa40 (Inherited: 0x8b0)
struct UHierarchicalInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	char pad_8B0[0x10]; // 0x8b0(0x10)
	char bUseTranslatedInstanceSpace : 1; // 0x8c0(0x01)
	char pad_8C0_1 : 7; // 0x8c0(0x01)
	char pad_8C1[0x7]; // 0x8c1(0x07)
	struct FVector TranslatedInstanceSpaceOrigin; // 0x8c8(0x18)
	struct TArray<int32_t> SortedInstances; // 0x8e0(0x10)
	int32_t NumBuiltInstances; // 0x8f0(0x04)
	char pad_8F4[0x4]; // 0x8f4(0x04)
	struct FBox BuiltInstanceBounds; // 0x8f8(0x38)
	struct FBox UnbuiltInstanceBounds; // 0x930(0x38)
	struct TArray<struct FBox> UnbuiltInstanceBoundsList; // 0x968(0x10)
	char bEnableDensityScaling : 1; // 0x978(0x01)
	char pad_978_1 : 7; // 0x978(0x01)
	char pad_979[0x7]; // 0x979(0x07)
	float InstanceLODDistanceScale; // 0x980(0x04)
	int32_t OcclusionLayerNumNodes; // 0x984(0x04)
	struct FBoxSphereBounds CacheMeshExtendedBounds; // 0x988(0x38)
	bool bDisableCollision; // 0x9c0(0x01)
	char pad_9C1[0x3]; // 0x9c1(0x03)
	int32_t InstanceCountToRender; // 0x9c4(0x04)
	char pad_9C8[0x78]; // 0x9c8(0x78)

	void SetLODDistanceScale(float InLODDistanceScale); // Function Engine.HierarchicalInstancedStaticMeshComponent.SetLODDistanceScale // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c83fc0
	float GetLODDistanceScale(); // Function Engine.HierarchicalInstancedStaticMeshComponent.GetLODDistanceScale // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c83fa0
};

// Class Engine.PartitionActor
// Size: 0x460 (Inherited: 0x460)
struct APartitionActor : AActor {
};

// Class Engine.ISMPartitionActor
// Size: 0x470 (Inherited: 0x460)
struct AISMPartitionActor : APartitionActor {
	char pad_460[0x10]; // 0x460(0x10)
};

// Class Engine.StaticMeshActor
// Size: 0x470 (Inherited: 0x460)
struct AStaticMeshActor : AActor {
	struct UStaticMeshComponent* StaticMeshComponent; // 0x460(0x08)
	bool bStaticMeshReplicateMovement; // 0x468(0x01)
	enum class EPhysicsReplicationMode StaticMeshPhysicsReplicationMode; // 0x469(0x01)
	enum class ENavDataGatheringMode NavigationGeometryGatheringMode; // 0x46a(0x01)
	char pad_46B[0x5]; // 0x46b(0x05)

	void SetMobility(enum class EComponentMobility InMobility); // Function Engine.StaticMeshActor.SetMobility // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x4a39ba0
};

// Class Engine.Brush
// Size: 0x498 (Inherited: 0x460)
struct ABrush : AActor {
	enum class EBrushType BrushType; // 0x460(0x01)
	char pad_461[0x3]; // 0x461(0x03)
	struct FColor BrushColor; // 0x464(0x04)
	int32_t PolyFlags; // 0x468(0x04)
	char bColored : 1; // 0x46c(0x01)
	char bSolidWhenSelected : 1; // 0x46c(0x01)
	char bSolidAlways : 1; // 0x46c(0x01)
	char bPlaceableFromClassBrowser : 1; // 0x46c(0x01)
	char bNotForClientOrServer : 1; // 0x46c(0x01)
	char pad_46C_5 : 3; // 0x46c(0x01)
	char pad_46D[0x3]; // 0x46d(0x03)
	struct UModel* Brush; // 0x470(0x08)
	struct UBrushComponent* BrushComponent; // 0x478(0x08)
	char bInManipulation : 1; // 0x480(0x01)
	char pad_480_1 : 7; // 0x480(0x01)
	char pad_481[0x7]; // 0x481(0x07)
	struct TArray<struct FGeomSelection> SavedSelections; // 0x488(0x10)
};

// Class Engine.Volume
// Size: 0x498 (Inherited: 0x498)
struct AVolume : ABrush {
};

// Class Engine.StreamableRenderAsset
// Size: 0xd0 (Inherited: 0x30)
struct UStreamableRenderAsset : UObject {
	char pad_30[0x18]; // 0x30(0x18)
	double ForceMipLevelsToBeResidentTimestamp; // 0x48(0x08)
	int32_t NumCinematicMipLevels; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	struct FPerQualityLevelInt NoRefStreamingLODBias; // 0x58(0x68)
	int32_t StreamingIndex; // 0xc0(0x04)
	char NeverStream : 1; // 0xc4(0x01)
	char bGlobalForceMipLevelsToBeResident : 1; // 0xc4(0x01)
	char bHasStreamingUpdatePending : 1; // 0xc4(0x01)
	char bForceMiplevelsToBeResident : 1; // 0xc4(0x01)
	char bIgnoreStreamingMipBias : 1; // 0xc4(0x01)
	char bUseCinematicMipLevels : 1; // 0xc4(0x01)
	char pad_C4_6 : 2; // 0xc4(0x01)
	char pad_C5[0xb]; // 0xc5(0x0b)

	void SetForceMipLevelsToBeResident(float Seconds, int32_t CinematicLODGroupMask); // Function Engine.StreamableRenderAsset.SetForceMipLevelsToBeResident // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x4a555b0
};

// Class Engine.MaterialInterface
// Size: 0xd0 (Inherited: 0x30)
struct UMaterialInterface : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct USubsurfaceProfile* SubsurfaceProfile; // 0x40(0x08)
	struct TArray<struct USpecularProfile*> SpecularProfiles; // 0x48(0x10)
	char bIncludedInBaseGame : 1; // 0x58(0x01)
	char pad_58_1 : 7; // 0x58(0x01)
	char pad_59[0x17]; // 0x59(0x17)
	struct FLightmassMaterialInterfaceSettings LightmassSettings; // 0x70(0x24)
	char pad_94[0x4]; // 0x94(0x04)
	struct TArray<struct FMaterialTextureInfo> TextureStreamingData; // 0x98(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0xa8(0x10)
	char pad_B8[0x18]; // 0xb8(0x18)

	void SetForceMipLevelsToBeResident(bool OverrideForceMiplevelsToBeResident, bool bForceMiplevelsToBeResidentValue, float ForceDuration, int32_t CinematicTextureGroups, bool bFastResponse); // Function Engine.MaterialInterface.SetForceMipLevelsToBeResident // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cc4530
	struct UPhysicalMaterialMask* GetPhysicalMaterialMask(); // Function Engine.MaterialInterface.GetPhysicalMaterialMask // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cc4cd0
	struct UPhysicalMaterial* GetPhysicalMaterialFromMap(int32_t Index); // Function Engine.MaterialInterface.GetPhysicalMaterialFromMap // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cc4bc0
	struct UPhysicalMaterial* GetPhysicalMaterial(); // Function Engine.MaterialInterface.GetPhysicalMaterial // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cc4d10
	struct FMaterialParameterInfo GetParameterInfo(enum class EMaterialParameterAssociation Association, struct FName ParameterName, struct UMaterialFunctionInterface* LayerFunction); // Function Engine.MaterialInterface.GetParameterInfo // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cc48f0
	struct UMaterialInterface* GetNaniteOverideMaterial(); // Function Engine.MaterialInterface.GetNaniteOverideMaterial // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cc4b70
	enum class EBlendMode GetBlendMode(); // Function Engine.MaterialInterface.GetBlendMode // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cc48b0
	struct UMaterial* GetBaseMaterial(); // Function Engine.MaterialInterface.GetBaseMaterial // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3cc4d50
};

// Class Engine.MaterialInstance
// Size: 0x2c0 (Inherited: 0xd0)
struct UMaterialInstance : UMaterialInterface {
	struct UPhysicalMaterial* PhysMaterial; // 0xd0(0x08)
	struct UPhysicalMaterial* PhysicalMaterialMap[0x8]; // 0xd8(0x40)
	struct UMaterialInterface* Parent; // 0x118(0x08)
	struct FMaterialOverrideNanite NaniteOverrideMaterial; // 0x120(0x40)
	char bHasStaticPermutationResource : 1; // 0x160(0x01)
	char bOverrideSubsurfaceProfile : 1; // 0x160(0x01)
	char pad_160_2 : 6; // 0x160(0x01)
	char pad_161[0x17]; // 0x161(0x17)
	struct TArray<struct FScalarParameterValue> ScalarParameterValues; // 0x178(0x10)
	struct TArray<struct FVectorParameterValue> VectorParameterValues; // 0x188(0x10)
	struct TArray<struct FDoubleVectorParameterValue> DoubleVectorParameterValues; // 0x198(0x10)
	struct TArray<struct FTextureParameterValue> TextureParameterValues; // 0x1a8(0x10)
	struct TArray<struct FRuntimeVirtualTextureParameterValue> RuntimeVirtualTextureParameterValues; // 0x1b8(0x10)
	struct TArray<struct FSparseVolumeTextureParameterValue> SparseVolumeTextureParameterValues; // 0x1c8(0x10)
	struct TArray<struct FFontParameterValue> FontParameterValues; // 0x1d8(0x10)
	struct FMaterialInstanceBasePropertyOverrides BasePropertyOverrides; // 0x1e8(0x48)
	char pad_230[0x28]; // 0x230(0x28)
	struct FStaticParameterSetRuntimeData StaticParametersRuntime; // 0x258(0x38)
	char pad_290[0x30]; // 0x290(0x30)
};

// Class Engine.MaterialInstanceConstant
// Size: 0x2c8 (Inherited: 0x2c0)
struct UMaterialInstanceConstant : UMaterialInstance {
	struct UPhysicalMaterialMask* PhysMaterialMask; // 0x2c0(0x08)

	struct FLinearColor K2_GetVectorParameterValue(struct FName ParameterName); // Function Engine.MaterialInstanceConstant.K2_GetVectorParameterValue // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x4575c70
	struct UTexture* K2_GetTextureParameterValue(struct FName ParameterName); // Function Engine.MaterialInstanceConstant.K2_GetTextureParameterValue // (Final|Native|Public|BlueprintCallable) // @ game+0x4575df0
	float K2_GetScalarParameterValue(struct FName ParameterName); // Function Engine.MaterialInstanceConstant.K2_GetScalarParameterValue // (Final|Native|Public|BlueprintCallable) // @ game+0x4575f70
};

// Class Engine.MaterialExpression
// Size: 0xb8 (Inherited: 0x30)
struct UMaterialExpression : UObject {
	int32_t MaterialExpressionEditorX; // 0x30(0x04)
	int32_t MaterialExpressionEditorY; // 0x34(0x04)
	struct UEdGraphNode* GraphNode; // 0x38(0x08)
	struct UMaterialExpression* SubgraphExpression; // 0x40(0x08)
	char pad_48[0x10]; // 0x48(0x10)
	struct FGuid MaterialExpressionGuid; // 0x58(0x10)
	struct UMaterial* Material; // 0x68(0x08)
	struct UMaterialFunction* Function; // 0x70(0x08)
	struct FString Desc; // 0x78(0x10)
	char pad_88[0x4]; // 0x88(0x04)
	char bRealtimePreview : 1; // 0x8c(0x01)
	char bNeedToUpdatePreview : 1; // 0x8c(0x01)
	char pad_8C_2 : 6; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
	char bIsParameterExpression : 1; // 0x90(0x01)
	char pad_90_1 : 7; // 0x90(0x01)
	char pad_91[0x3]; // 0x91(0x03)
	char bCommentBubbleVisible : 1; // 0x94(0x01)
	char bShowOutputNameOnPin : 1; // 0x94(0x01)
	char bShowMaskColorsOnPin : 1; // 0x94(0x01)
	char bHidePreviewWindow : 1; // 0x94(0x01)
	char bCollapsed : 1; // 0x94(0x01)
	char bShaderInputData : 1; // 0x94(0x01)
	char bShowInputs : 1; // 0x94(0x01)
	char bShowOutputs : 1; // 0x94(0x01)
	char pad_95[0x3]; // 0x95(0x03)
	struct TArray<struct FText> MenuCategories; // 0x98(0x10)
	struct TArray<struct FExpressionOutput> Outputs; // 0xa8(0x10)
};

// Class Engine.MaterialExpressionCustomOutput
// Size: 0xb8 (Inherited: 0xb8)
struct UMaterialExpressionCustomOutput : UMaterialExpression {
};

// Class Engine.HLODBuilder
// Size: 0x30 (Inherited: 0x30)
struct UHLODBuilder : UObject {
};

// Class Engine.Subsystem
// Size: 0x38 (Inherited: 0x30)
struct USubsystem : UObject {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Engine.WorldSubsystem
// Size: 0x38 (Inherited: 0x38)
struct UWorldSubsystem : USubsystem {
};

// Class Engine.TickableWorldSubsystem
// Size: 0x58 (Inherited: 0x38)
struct UTickableWorldSubsystem : UWorldSubsystem {
	char pad_38[0x20]; // 0x38(0x20)
};

// Class Engine.AssetUserData
// Size: 0x30 (Inherited: 0x30)
struct UAssetUserData : UObject {
};

// Class Engine.TextureMipDataProviderFactory
// Size: 0x30 (Inherited: 0x30)
struct UTextureMipDataProviderFactory : UAssetUserData {
};

// Class Engine.TextureAllMipDataProviderFactory
// Size: 0x30 (Inherited: 0x30)
struct UTextureAllMipDataProviderFactory : UTextureMipDataProviderFactory {
};

// Class Engine.EngineCustomTimeStep
// Size: 0x30 (Inherited: 0x30)
struct UEngineCustomTimeStep : UObject {
};

// Class Engine.TimecodeProvider
// Size: 0x38 (Inherited: 0x30)
struct UTimecodeProvider : UObject {
	float FrameDelay; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)

	struct FTimecode GetTimecode(); // Function Engine.TimecodeProvider.GetTimecode // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x4207f30
	enum class ETimecodeProviderSynchronizationState GetSynchronizationState(); // Function Engine.TimecodeProvider.GetSynchronizationState // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d25a20
	struct FQualifiedFrameTime GetQualifiedFrameTime(); // Function Engine.TimecodeProvider.GetQualifiedFrameTime // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x4207ff0
	struct FFrameRate GetFrameRate(); // Function Engine.TimecodeProvider.GetFrameRate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x4207e80
	struct FTimecode GetDelayedTimecode(); // Function Engine.TimecodeProvider.GetDelayedTimecode // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x4207ec0
	struct FQualifiedFrameTime GetDelayedQualifiedFrameTime(); // Function Engine.TimecodeProvider.GetDelayedQualifiedFrameTime // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x4207fb0
	bool FetchTimecode(struct FQualifiedFrameTime& OutFrameTime); // Function Engine.TimecodeProvider.FetchTimecode // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x4208030
	void FetchAndUpdate(); // Function Engine.TimecodeProvider.FetchAndUpdate // (Native|Public|BlueprintCallable) // @ game+0x3bf07f0
};

// Class Engine.EdGraphNode
// Size: 0xa0 (Inherited: 0x30)
struct UEdGraphNode : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> DeprecatedPins; // 0x40(0x10)
	int32_t NodePosX; // 0x50(0x04)
	int32_t NodePosY; // 0x54(0x04)
	int32_t NodeWidth; // 0x58(0x04)
	int32_t NodeHeight; // 0x5c(0x04)
	enum class ENodeAdvancedPins AdvancedPinDisplay; // 0x60(0x01)
	enum class ENodeEnabledState EnabledState; // 0x61(0x01)
	char pad_62[0x1]; // 0x62(0x01)
	char pad_63_0 : 1; // 0x63(0x01)
	char bDisplayAsDisabled : 1; // 0x63(0x01)
	char bUserSetEnabledState : 1; // 0x63(0x01)
	char bIsIntermediateNode : 1; // 0x63(0x01)
	char bHasCompilerMessage : 1; // 0x63(0x01)
	char pad_63_5 : 3; // 0x63(0x01)
	char pad_64[0x4]; // 0x64(0x04)
	struct FString NodeComment; // 0x68(0x10)
	int32_t ErrorType; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct FString ErrorMsg; // 0x80(0x10)
	struct FGuid NodeGuid; // 0x90(0x10)
};

// Class Engine.EdGraph
// Size: 0x68 (Inherited: 0x30)
struct UEdGraph : UObject {
	struct UEdGraphSchema* schema; // 0x30(0x08)
	struct TArray<struct UEdGraphNode*> Nodes; // 0x38(0x10)
	char bEditable : 1; // 0x48(0x01)
	char bAllowDeletion : 1; // 0x48(0x01)
	char bAllowRenaming : 1; // 0x48(0x01)
	char pad_48_3 : 5; // 0x48(0x01)
	char pad_49[0x1f]; // 0x49(0x1f)
};

// Class Engine.DebugDrawComponent
// Size: 0x6e0 (Inherited: 0x690)
struct UDebugDrawComponent : UPrimitiveComponent {
	char pad_690[0x50]; // 0x690(0x50)
};

// Class Engine.AnimNotify
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotify : UObject {
	char pad_30[0x10]; // 0x30(0x10)

	bool Received_Notify(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, struct FAnimNotifyEventReference& EventReference); // Function Engine.AnimNotify.Received_Notify // (RequiredAPI|Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x1b42740
	struct FString GetNotifyName(); // Function Engine.AnimNotify.GetNotifyName // (RequiredAPI|Native|Event|Public|BlueprintEvent|Const) // @ game+0x3e39820
	float GetDefaultTriggerWeightThreshold(); // Function Engine.AnimNotify.GetDefaultTriggerWeightThreshold // (RequiredAPI|Native|Event|Public|BlueprintEvent|Const) // @ game+0x3e397e0
};

// Class Engine.AnimNotifyState
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState : UObject {
	char pad_30[0x8]; // 0x30(0x08)

	bool Received_NotifyTick(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float FrameDeltaTime, struct FAnimNotifyEventReference& EventReference); // Function Engine.AnimNotifyState.Received_NotifyTick // (RequiredAPI|Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x1b42740
	bool Received_NotifyEnd(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, struct FAnimNotifyEventReference& EventReference); // Function Engine.AnimNotifyState.Received_NotifyEnd // (RequiredAPI|Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x1b42740
	bool Received_NotifyBegin(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float TotalDuration, struct FAnimNotifyEventReference& EventReference); // Function Engine.AnimNotifyState.Received_NotifyBegin // (RequiredAPI|Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x1b42740
	struct FString GetNotifyName(); // Function Engine.AnimNotifyState.GetNotifyName // (RequiredAPI|Native|Event|Public|BlueprintEvent|Const) // @ game+0x3e39820
	float GetDefaultTriggerWeightThreshold(); // Function Engine.AnimNotifyState.GetDefaultTriggerWeightThreshold // (RequiredAPI|Native|Event|Public|BlueprintEvent|Const) // @ game+0x3e397e0
};

// Class Engine.SkinnedMeshComponent
// Size: 0xa30 (Inherited: 0x6e0)
struct USkinnedMeshComponent : UMeshComponent {
	struct USkeletalMesh* SkeletalMesh; // 0x6e0(0x08)
	struct USkinnedAsset* SkinnedAsset; // 0x6e8(0x08)
	struct TWeakObjectPtr<struct USkinnedMeshComponent> LeaderPoseComponent; // 0x6f0(0x08)
	struct TArray<enum class ESkinCacheUsage> SkinCacheUsage; // 0x6f8(0x10)
	bool bSetMeshDeformer; // 0x708(0x01)
	char pad_709[0x7]; // 0x709(0x07)
	struct UMeshDeformer* MeshDeformer; // 0x710(0x08)
	struct UMeshDeformerInstanceSettings* MeshDeformerInstanceSettings; // 0x718(0x08)
	struct UMeshDeformerInstance* MeshDeformerInstance; // 0x720(0x08)
	char pad_728[0x178]; // 0x728(0x178)
	struct UPhysicsAsset* PhysicsAssetOverride; // 0x8a0(0x08)
	int32_t ForcedLodModel; // 0x8a8(0x04)
	int32_t MinLodModel; // 0x8ac(0x04)
	char pad_8B0[0x10]; // 0x8b0(0x10)
	float StreamingDistanceMultiplier; // 0x8c0(0x04)
	char pad_8C4[0xc]; // 0x8c4(0x0c)
	struct TArray<struct FSkelMeshComponentLODInfo> LODInfo; // 0x8d0(0x10)
	char pad_8E0[0x24]; // 0x8e0(0x24)
	enum class EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x904(0x01)
	char pad_905[0x1]; // 0x905(0x01)
	char pad_906_0 : 3; // 0x906(0x01)
	char bOverrideMinLOD : 1; // 0x906(0x01)
	char bUseBoundsFromLeaderPoseComponent : 1; // 0x906(0x01)
	char bForceWireframe : 1; // 0x906(0x01)
	char bDisableMorphTarget : 1; // 0x906(0x01)
	char bHideSkin : 1; // 0x906(0x01)
	char bPerBoneMotionBlur : 1; // 0x907(0x01)
	char bComponentUseFixedSkelBounds : 1; // 0x907(0x01)
	char bConsiderAllBodiesForBounds : 1; // 0x907(0x01)
	char bSyncAttachParentLOD : 1; // 0x907(0x01)
	char bCanHighlightSelectedSections : 1; // 0x907(0x01)
	char bRecentlyRendered : 1; // 0x907(0x01)
	char bForceReducedNonRenderedAnimUpdateRate : 1; // 0x907(0x01)
	char bForceAnimUpdateIfRendered : 1; // 0x907(0x01)
	char bCastCapsuleDirectShadow : 1; // 0x908(0x01)
	char bCastCapsuleIndirectShadow : 1; // 0x908(0x01)
	char bCPUSkinning : 1; // 0x908(0x01)
	char bEnableUpdateRateOptimizations : 1; // 0x908(0x01)
	char bDisplayDebugUpdateRateOptimizations : 1; // 0x908(0x01)
	char bRenderStatic : 1; // 0x908(0x01)
	char bIgnoreLeaderPoseComponentLOD : 1; // 0x908(0x01)
	char pad_908_7 : 1; // 0x908(0x01)
	char pad_909_0 : 1; // 0x909(0x01)
	char bCachedLocalBoundsUpToDate : 1; // 0x909(0x01)
	char bCachedWorldSpaceBoundsUpToDate : 1; // 0x909(0x01)
	char pad_909_3 : 1; // 0x909(0x01)
	char bForceMeshObjectUpdate : 1; // 0x909(0x01)
	char bForceUpdateDynamicDataImmediately : 1; // 0x909(0x01)
	char pad_909_6 : 2; // 0x909(0x01)
	char pad_90A_0 : 3; // 0x90a(0x01)
	char bFollowerShouldTickPose : 1; // 0x90a(0x01)
	char pad_90A_4 : 4; // 0x90a(0x01)
	char pad_90B[0x1]; // 0x90b(0x01)
	float CapsuleIndirectShadowMinVisibility; // 0x90c(0x04)
	char pad_910[0x40]; // 0x910(0x40)
	struct FBoxSphereBounds CachedWorldOrLocalSpaceBounds; // 0x950(0x38)
	char pad_988[0x8]; // 0x988(0x08)
	struct FMatrix CachedWorldToLocalTransform; // 0x990(0x80)
	enum class EDedicatedServerAnimationStatus DedicatedServerAnimationStatus; // 0xa10(0x01)
	char pad_A11[0x1f]; // 0xa11(0x1f)

	void UnsetMeshDeformer(); // Function Engine.SkinnedMeshComponent.UnsetMeshDeformer // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1c170
	void UnloadSkinWeightProfile(struct FName InProfileName); // Function Engine.SkinnedMeshComponent.UnloadSkinWeightProfile // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1b030
	void UnHideBoneByName(struct FName BoneName); // Function Engine.SkinnedMeshComponent.UnHideBoneByName // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d18e80
	void TransformToBoneSpace(struct FName BoneName, struct FVector InPosition, struct FRotator InRotation, struct FVector& OutPosition, struct FRotator& OutRotation); // Function Engine.SkinnedMeshComponent.TransformToBoneSpace // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d198d0
	void TransformFromBoneSpace(struct FName BoneName, struct FVector InPosition, struct FRotator InRotation, struct FVector& OutPosition, struct FRotator& OutRotation); // Function Engine.SkinnedMeshComponent.TransformFromBoneSpace // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d19520
	void ShowMaterialSection(int32_t MaterialID, int32_t SectionIndex, bool bShow, int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ShowMaterialSection // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d18a50
	void ShowAllMaterialSections(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ShowAllMaterialSections // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d18960
	void SetVertexOffsetUsage(int32_t LODIndex, int32_t Usage); // Function Engine.SkinnedMeshComponent.SetVertexOffsetUsage // (Final|Native|Public|BlueprintCallable) // @ game+0x3d1ad80
	void SetVertexColorOverride_LinearColor(int32_t LODIndex, struct TArray<struct FLinearColor>& VertexColors); // Function Engine.SkinnedMeshComponent.SetVertexColorOverride_LinearColor // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3d1b680
	bool SetSkinWeightProfile(struct FName InProfileName); // Function Engine.SkinnedMeshComponent.SetSkinWeightProfile // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1b160
	void SetSkinWeightOverride(int32_t LODIndex, struct TArray<struct FSkelMeshSkinWeightInfo>& SkinWeights); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3d1b390
	void SetSkinnedAssetAndUpdate(struct USkinnedAsset* NewMesh, bool bReinitPose); // Function Engine.SkinnedMeshComponent.SetSkinnedAssetAndUpdate // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1c330
	void SetRenderStatic(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetRenderStatic // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d18680
	void SetPreSkinningOffsets(int32_t LODIndex, struct TArray<struct FVector> Offsets); // Function Engine.SkinnedMeshComponent.SetPreSkinningOffsets // (Final|Native|Public|BlueprintCallable) // @ game+0x3d1ab50
	void SetPostSkinningOffsets(int32_t LODIndex, struct TArray<struct FVector> Offsets); // Function Engine.SkinnedMeshComponent.SetPostSkinningOffsets // (Final|Native|Public|BlueprintCallable) // @ game+0x3d1ab50
	void SetPhysicsAsset(struct UPhysicsAsset* NewPhysicsAsset, bool bForceReInit); // Function Engine.SkinnedMeshComponent.SetPhysicsAsset // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1d0d0
	void SetMinLOD(int32_t InNewMinLOD); // Function Engine.SkinnedMeshComponent.SetMinLOD // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1cdf0
	void SetMeshDeformer(struct UMeshDeformer* InMeshDeformer); // Function Engine.SkinnedMeshComponent.SetMeshDeformer // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1c190
	void SetLeaderPoseComponent(struct USkinnedMeshComponent* NewLeaderBoneComponent, bool bForceUpdate, bool bInFollowerShouldTickPose); // Function Engine.SkinnedMeshComponent.SetLeaderPoseComponent // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1a240
	void SetForcedLOD(int32_t InNewForcedLOD); // Function Engine.SkinnedMeshComponent.SetForcedLOD // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1cd00
	void SetEnableShadowPhysicsAsset(bool bInCastCapsuleDirectShadow, bool bInCastCapsuleIndirectShadow); // Function Engine.SkinnedMeshComponent.SetEnableShadowPhysicsAsset // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1cf00
	void SetCastCapsuleIndirectShadow(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetCastCapsuleIndirectShadow // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1cac0
	void SetCastCapsuleDirectShadow(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetCastCapsuleDirectShadow // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1cbd0
	void SetCapsuleIndirectShadowMinVisibility(float NewValue); // Function Engine.SkinnedMeshComponent.SetCapsuleIndirectShadowMinVisibility // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1c9c0
	void ServerOverrideServerReducedAnimUpdateRate(int32_t Value); // Function Engine.SkinnedMeshComponent.ServerOverrideServerReducedAnimUpdateRate // (RequiredAPI|Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x3d1a730
	void ServerOverrideServerAnimUpdateRate(int32_t Value); // Function Engine.SkinnedMeshComponent.ServerOverrideServerAnimUpdateRate // (RequiredAPI|Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x3d1a830
	void ServerOverrideServerAnimAlwaysUpdateHumanControlled(bool Value); // Function Engine.SkinnedMeshComponent.ServerOverrideServerAnimAlwaysUpdateHumanControlled // (RequiredAPI|Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x3d1a470
	void ServerOverrideNonRenderedAnimUpdateRate(int32_t Value); // Function Engine.SkinnedMeshComponent.ServerOverrideNonRenderedAnimUpdateRate // (RequiredAPI|Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x3d1aa30
	void OverrideServerReducedAnimUpdateRateFunc(struct TArray<struct FString>& Args, struct UWorld* World); // Function Engine.SkinnedMeshComponent.OverrideServerReducedAnimUpdateRateFunc // (Final|RequiredAPI|Native|Static|Protected|HasOutParms) // @ game+0x3d1a570
	void OverrideServerAnimUpdateRateFunc(struct TArray<struct FString>& Args, struct UWorld* World); // Function Engine.SkinnedMeshComponent.OverrideServerAnimUpdateRateFunc // (Final|RequiredAPI|Native|Static|Protected|HasOutParms) // @ game+0x3d1a570
	void OverrideServerAnimAlwaysUpdateHumanControlledFunc(struct TArray<struct FString>& Args, struct UWorld* World); // Function Engine.SkinnedMeshComponent.OverrideServerAnimAlwaysUpdateHumanControlledFunc // (Final|RequiredAPI|Native|Static|Protected|HasOutParms) // @ game+0x3d1a570
	void OverrideNonRenderedAnimUpdateRateFunc(struct TArray<struct FString>& Args, struct UWorld* World); // Function Engine.SkinnedMeshComponent.OverrideNonRenderedAnimUpdateRateFunc // (Final|RequiredAPI|Native|Static|Protected|HasOutParms) // @ game+0x3d1a570
	void MulticastOverrideNonRenderedAnimUpdateRate(int32_t Value); // Function Engine.SkinnedMeshComponent.MulticastOverrideNonRenderedAnimUpdateRate // (RequiredAPI|Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x3d1a930
	bool IsUsingSkinWeightProfile(); // Function Engine.SkinnedMeshComponent.IsUsingSkinWeightProfile // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1afd0
	bool IsMaterialSectionShown(int32_t MaterialID, int32_t LODIndex); // Function Engine.SkinnedMeshComponent.IsMaterialSectionShown // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d187a0
	bool IsBoneHiddenByName(struct FName BoneName); // Function Engine.SkinnedMeshComponent.IsBoneHiddenByName // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d18d20
	void HideBoneByName(struct FName BoneName, enum class EPhysBodyOp PhysBodyOption); // Function Engine.SkinnedMeshComponent.HideBoneByName // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d18fe0
	int32_t GetVertexOffsetUsage(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.GetVertexOffsetUsage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1aef0
	bool GetTwistAndSwingAngleOfDeltaRotationFromRefPose(struct FName BoneName, float& OutTwistAngle, float& OutSwingAngle); // Function Engine.SkinnedMeshComponent.GetTwistAndSwingAngleOfDeltaRotationFromRefPose // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1bbc0
	struct FName GetSocketBoneName(struct FName InSocketName); // Function Engine.SkinnedMeshComponent.GetSocketBoneName // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1c550
	struct USkinnedAsset* GetSkinnedAsset(); // Function Engine.SkinnedMeshComponent.GetSkinnedAsset // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1c300
	struct USkeletalMesh* GetSkeletalMesh_DEPRECATED(); // Function Engine.SkinnedMeshComponent.GetSkeletalMesh_DEPRECATED // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1c4d0
	struct FTransform GetRefPoseTransform(int32_t BoneIndex); // Function Engine.SkinnedMeshComponent.GetRefPoseTransform // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d19c80
	struct FVector GetRefPosePosition(int32_t BoneIndex); // Function Engine.SkinnedMeshComponent.GetRefPosePosition // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d19e30
	int32_t GetPredictedLODLevel(); // Function Engine.SkinnedMeshComponent.GetPredictedLODLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1ab30
	struct FName GetParentBone(struct FName BoneName); // Function Engine.SkinnedMeshComponent.GetParentBone // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1c050
	int32_t GetNumLODs(); // Function Engine.SkinnedMeshComponent.GetNumLODs // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1d0a0
	int32_t GetNumBones(); // Function Engine.SkinnedMeshComponent.GetNumBones // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1c950
	struct UMeshDeformerInstance* GetMeshDeformerInstance(); // Function Engine.SkinnedMeshComponent.GetMeshDeformerInstance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1d270
	int32_t GetForcedLOD(); // Function Engine.SkinnedMeshComponent.GetForcedLOD // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1cce0
	struct FTransform GetDeltaTransformFromRefPose(struct FName BoneName, struct FName BaseName); // Function Engine.SkinnedMeshComponent.GetDeltaTransformFromRefPose // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1be30
	struct FName GetCurrentSkinWeightProfileName(); // Function Engine.SkinnedMeshComponent.GetCurrentSkinWeightProfileName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1b000
	struct FTransform GetBoneTransform(struct FName InBoneName, enum class ERelativeTransformSpace TransformSpace); // Function Engine.SkinnedMeshComponent.GetBoneTransform // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1b990
	struct FName GetBoneName(int32_t BoneIndex); // Function Engine.SkinnedMeshComponent.GetBoneName // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1c670
	int32_t GetBoneIndex(struct FName BoneName); // Function Engine.SkinnedMeshComponent.GetBoneIndex // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1c7f0
	struct FName FindClosestBone_K2(struct FVector TestLocation, struct FVector& BoneLocation, float IgnoreScale, bool bRequirePhysicsAsset); // Function Engine.SkinnedMeshComponent.FindClosestBone_K2 // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d191e0
	void ClearVertexColorOverride(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ClearVertexColorOverride // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1b560
	void ClearSkinWeightProfile(); // Function Engine.SkinnedMeshComponent.ClearSkinWeightProfile // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1b140
	void ClearSkinWeightOverride(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ClearSkinWeightOverride // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d1b270
	bool BoneIsChildOf(struct FName BoneName, struct FName ParentBoneName); // Function Engine.SkinnedMeshComponent.BoneIsChildOf // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d19fb0
};

// Class Engine.SkeletalMeshComponent
// Size: 0x1100 (Inherited: 0xa30)
struct USkeletalMeshComponent : USkinnedMeshComponent {
	char pad_A30[0x8]; // 0xa30(0x08)
	struct USkeletalMesh* SkeletalMeshAsset; // 0xa38(0x08)
	ClassPtrProperty AnimBlueprintGeneratedClass; // 0xa40(0x08)
	struct UAnimInstance* AnimClass; // 0xa48(0x08)
	struct UAnimInstance* AnimScriptInstance; // 0xa50(0x08)
	struct UAnimInstance* PostProcessAnimInstance; // 0xa58(0x08)
	struct FSingleAnimationPlayData AnimationData; // 0xa60(0x18)
	char pad_A78[0x10]; // 0xa78(0x10)
	struct FVector RootBoneTranslation; // 0xa88(0x18)
	struct FVector LineCheckBoundsScale; // 0xaa0(0x18)
	char pad_AB8[0x20]; // 0xab8(0x20)
	struct TArray<struct UAnimInstance*> LinkedInstances; // 0xad8(0x10)
	char pad_AE8[0x10]; // 0xae8(0x10)
	struct TArray<struct FTransform> CachedBoneSpaceTransforms; // 0xaf8(0x10)
	struct TArray<struct FTransform> CachedComponentSpaceTransforms; // 0xb08(0x10)
	char pad_B18[0xa0]; // 0xb18(0xa0)
	float GlobalAnimRateScale; // 0xbb8(0x04)
	enum class EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0xbbc(0x01)
	enum class EPhysicsTransformUpdateMode PhysicsTransformUpdateMode; // 0xbbd(0x01)
	char pad_BBE[0x1]; // 0xbbe(0x01)
	enum class EAnimationMode AnimationMode; // 0xbbf(0x01)
	char pad_BC0[0x1]; // 0xbc0(0x01)
	char bDisablePostProcessBlueprint : 1; // 0xbc1(0x01)
	char bOmitFromParticleModuleLocationSkelVertSurface : 1; // 0xbc1(0x01)
	char pad_BC1_2 : 1; // 0xbc1(0x01)
	char bUpdateOverlapsOnAnimationFinalize : 1; // 0xbc1(0x01)
	char pad_BC1_4 : 1; // 0xbc1(0x01)
	char bHasValidBodies : 1; // 0xbc1(0x01)
	char bBlendPhysics : 1; // 0xbc1(0x01)
	char bEnablePhysicsOnDedicatedServer : 1; // 0xbc1(0x01)
	char bUpdateMeshWhenKinematic : 1; // 0xbc2(0x01)
	char bUpdateJointsFromAnimation : 1; // 0xbc2(0x01)
	char bAllowClothActors : 1; // 0xbc2(0x01)
	char bDisableClothSimulation : 1; // 0xbc2(0x01)
	char pad_BC2_4 : 4; // 0xbc2(0x01)
	char pad_BC3[0x5]; // 0xbc3(0x05)
	char bDisableRigidBodyAnimNode : 1; // 0xbc8(0x01)
	char bAllowAnimCurveEvaluation : 1; // 0xbc8(0x01)
	char pad_BC8_2 : 3; // 0xbc8(0x01)
	char bCollideWithEnvironment : 1; // 0xbc8(0x01)
	char bCollideWithAttachedChildren : 1; // 0xbc8(0x01)
	char bForceCollisionUpdate : 1; // 0xbc8(0x01)
	char bLocalSpaceSimulation : 1; // 0xbc9(0x01)
	char bResetAfterTeleport : 1; // 0xbc9(0x01)
	char pad_BC9_2 : 1; // 0xbc9(0x01)
	char bDeferKinematicBoneUpdate : 1; // 0xbc9(0x01)
	char bNoSkeletonUpdate : 1; // 0xbc9(0x01)
	char bPauseAnims : 1; // 0xbc9(0x01)
	char bUseRefPoseOnInitAnim : 1; // 0xbc9(0x01)
	char bEnablePerPolyCollision : 1; // 0xbc9(0x01)
	char bForceRefpose : 1; // 0xbca(0x01)
	char bOnlyAllowAutonomousTickPose : 1; // 0xbca(0x01)
	char bIsAutonomousTickPose : 1; // 0xbca(0x01)
	char bOldForceRefPose : 1; // 0xbca(0x01)
	char bShowPrePhysBones : 1; // 0xbca(0x01)
	char bRequiredBonesUpToDate : 1; // 0xbca(0x01)
	char bAnimTreeInitialised : 1; // 0xbca(0x01)
	char bIncludeComponentLocationIntoBounds : 1; // 0xbca(0x01)
	char bEnableLineCheckWithBounds : 1; // 0xbcb(0x01)
	char bPropagateCurvesToFollowers : 1; // 0xbcb(0x01)
	char bSkipKinematicUpdateWhenInterpolating : 1; // 0xbcb(0x01)
	char bSkipBoundsUpdateWhenInterpolating : 1; // 0xbcb(0x01)
	char bForceEvaluateAnimation : 1; // 0xbcb(0x01)
	char bForceUpdateAnimation : 1; // 0xbcb(0x01)
	char pad_BCB_6 : 1; // 0xbcb(0x01)
	char bReplicated : 1; // 0xbcb(0x01)
	char pad_BCC_0 : 2; // 0xbcc(0x01)
	char bNeedsQueuedAnimEventsDispatched : 1; // 0xbcc(0x01)
	char pad_BCC_3 : 5; // 0xbcc(0x01)
	char pad_BCD[0x1]; // 0xbcd(0x01)
	uint16_t CachedAnimCurveUidVersion; // 0xbce(0x02)
	float ClothBlendWeight; // 0xbd0(0x04)
	bool bWaitForParallelClothTask; // 0xbd4(0x01)
	bool bFilteredAnimCurvesIsAllowList; // 0xbd5(0x01)
	uint16_t CachedMeshCurveMetaDataVersion; // 0xbd6(0x02)
	struct TArray<struct FName> FilteredAnimCurves; // 0xbd8(0x10)
	struct UBodySetup* BodySetup; // 0xbe8(0x08)
	char pad_BF0[0x4]; // 0xbf0(0x04)
	float ClothMaxDistanceScale; // 0xbf4(0x04)
	struct FMulticastInlineDelegate OnConstraintBroken; // 0xbf8(0x10)
	struct FMulticastInlineDelegate OnPlasticDeformation; // 0xc08(0x10)
	struct UClothingSimulationFactory* ClothingSimulationFactory; // 0xc18(0x08)
	char pad_C20[0xf8]; // 0xc20(0xf8)
	float TeleportDistanceThreshold; // 0xd18(0x04)
	float TeleportRotationThreshold; // 0xd1c(0x04)
	char pad_D20[0x8]; // 0xd20(0x08)
	uint32_t LastPoseTickFrame; // 0xd28(0x04)
	char pad_D2C[0x94]; // 0xd2c(0x94)
	struct UClothingSimulationInteractor* ClothingInteractor; // 0xdc0(0x08)
	char pad_DC8[0xd8]; // 0xdc8(0xd8)
	struct FMulticastInlineDelegate OnAnimInitialized; // 0xea0(0x10)
	char pad_EB0[0x250]; // 0xeb0(0x250)

	void UnlinkAnimClassLayers(struct UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.UnlinkAnimClassLayers // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40ab660
	void UnbindClothFromLeaderPoseComponent(bool bRestoreSimulationSpace); // Function Engine.SkeletalMeshComponent.UnbindClothFromLeaderPoseComponent // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a9a40
	void ToggleDisablePostProcessBlueprint(); // Function Engine.SkeletalMeshComponent.ToggleDisablePostProcessBlueprint // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40ade50
	void TermBodiesBelow(struct FName ParentBoneName); // Function Engine.SkeletalMeshComponent.TermBodiesBelow // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a7490
	void SuspendClothingSimulation(); // Function Engine.SkeletalMeshComponent.SuspendClothingSimulation // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a9c90
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40aad80
	void SnapshotPose(struct FPoseSnapshot& Snapshot); // Function Engine.SkeletalMeshComponent.SnapshotPose // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40a9f30
	void SetUpdateClothInEditor(bool NewUpdateState); // Function Engine.SkeletalMeshComponent.SetUpdateClothInEditor // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3516750
	void SetUpdateAnimationInEditor(bool NewUpdateState); // Function Engine.SkeletalMeshComponent.SetUpdateAnimationInEditor // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3516750
	void SetTeleportRotationThreshold(float Threshold); // Function Engine.SkeletalMeshComponent.SetTeleportRotationThreshold // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a8fd0
	void SetTeleportDistanceThreshold(float Threshold); // Function Engine.SkeletalMeshComponent.SetTeleportDistanceThreshold // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a8eb0
	void SetSkeletalMeshAsset(struct USkeletalMesh* NewMesh); // Function Engine.SkeletalMeshComponent.SetSkeletalMeshAsset // (Final|Native|Public|BlueprintCallable) // @ game+0x40adec0
	void SetPosition(float InPos, bool bFireNotifies); // Function Engine.SkeletalMeshComponent.SetPosition // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40aab40
	void SetPlayRate(float Rate); // Function Engine.SkeletalMeshComponent.SetPlayRate // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40aa920
	void SetPhysicsBlendWeight(float PhysicsBlendWeight); // Function Engine.SkeletalMeshComponent.SetPhysicsBlendWeight // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a7110
	void SetNotifyRigidBodyCollisionBelow(bool bNewNotifyRigidBodyCollision, struct FName BoneName, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetNotifyRigidBodyCollisionBelow // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a8a50
	void SetMorphTarget(struct FName MorphTargetName, float Value, bool bRemoveZeroWeight); // Function Engine.SkeletalMeshComponent.SetMorphTarget // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40aa250
	void SetEnablePhysicsBlending(bool bNewBlendPhysics); // Function Engine.SkeletalMeshComponent.SetEnablePhysicsBlending // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a7010
	void SetEnableGravityOnAllBodiesBelow(bool bEnableGravity, struct FName BoneName, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetEnableGravityOnAllBodiesBelow // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a84c0
	void SetEnableBodyGravity(bool bEnableGravity, struct FName BoneName); // Function Engine.SkeletalMeshComponent.SetEnableBodyGravity // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a8860
	void SetDisablePostProcessBlueprint(bool bInDisablePostProcess); // Function Engine.SkeletalMeshComponent.SetDisablePostProcessBlueprint // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40adcf0
	void SetDisableAnimCurves(bool bInDisableAnimCurves); // Function Engine.SkeletalMeshComponent.SetDisableAnimCurves // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a9710
	void SetConstraintProfileForAll(struct FName ProfileName, bool bDefaultIfNotFound); // Function Engine.SkeletalMeshComponent.SetConstraintProfileForAll // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a4f80
	void SetConstraintProfile(struct FName JointName, struct FName ProfileName, bool bDefaultIfNotFound); // Function Engine.SkeletalMeshComponent.SetConstraintProfile // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a51e0
	void SetClothMaxDistanceScale(float Scale); // Function Engine.SkeletalMeshComponent.SetClothMaxDistanceScale // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a9cf0
	void SetBodyNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision, struct FName BoneName); // Function Engine.SkeletalMeshComponent.SetBodyNotifyRigidBodyCollision // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a8cc0
	void SetAnimClass(struct UObject* NewClass); // Function Engine.SkeletalMeshComponent.SetAnimClass // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40abe50
	void SetAnimationMode(enum class EAnimationMode InAnimationMode, bool bForceInitAnimScriptInstance); // Function Engine.SkeletalMeshComponent.SetAnimationMode // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40ab160
	void SetAnimation(struct UAnimationAsset* NewAnimToPlay); // Function Engine.SkeletalMeshComponent.SetAnimation // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40aaea0
	void SetAngularLimits(struct FName InBoneName, float Swing1LimitAngle, float TwistLimitAngle, float Swing2LimitAngle); // Function Engine.SkeletalMeshComponent.SetAngularLimits // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a3e30
	void SetAllowRigidBodyAnimNode(bool bInAllow, bool bReinitAnim); // Function Engine.SkeletalMeshComponent.SetAllowRigidBodyAnimNode // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a9850
	void SetAllowedAnimCurvesEvaluation(struct TArray<struct FName>& List, bool bAllow); // Function Engine.SkeletalMeshComponent.SetAllowedAnimCurvesEvaluation // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40a9100
	void SetAllowClothActors(bool bInAllow); // Function Engine.SkeletalMeshComponent.SetAllowClothActors // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a9e30
	void SetAllowAnimCurveEvaluation(bool bInAllow); // Function Engine.SkeletalMeshComponent.SetAllowAnimCurveEvaluation // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a95d0
	void SetAllMotorsAngularVelocityDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularVelocityDrive // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a5910
	void SetAllMotorsAngularPositionDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularPositionDrive // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a5b50
	void SetAllMotorsAngularDriveParams(float InSpring, float InDamping, float InForceLimit, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularDriveParams // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a54c0
	void SetAllBodiesSimulatePhysics(bool bNewSimulate); // Function Engine.SkeletalMeshComponent.SetAllBodiesSimulatePhysics // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a72f0
	void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllBodiesPhysicsBlendWeight // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a63b0
	void SetAllBodiesBelowSimulatePhysics(struct FName& InBoneName, bool bNewSimulate, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowSimulatePhysics // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40a6610
	void SetAllBodiesBelowPhysicsDisabled(struct FName& InBoneName, bool bDisabled, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowPhysicsDisabled // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40a6d90
	void SetAllBodiesBelowPhysicsBlendWeight(struct FName& InBoneName, float PhysicsBlendWeight, bool bSkipCustomPhysicsType, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowPhysicsBlendWeight // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40a6060
	void SetAllBodiesBelowLinearVelocity(struct FName& InBoneName, struct FVector& LinearVelocity, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowLinearVelocity // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x40a6ad0
	void ResumeClothingSimulation(); // Function Engine.SkeletalMeshComponent.ResumeClothingSimulation // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a9c60
	void ResetClothTeleportMode(); // Function Engine.SkeletalMeshComponent.ResetClothTeleportMode // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a9c10
	void ResetAnimInstanceDynamics(enum class ETeleportType InTeleportType); // Function Engine.SkeletalMeshComponent.ResetAnimInstanceDynamics // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40ab2f0
	void ResetAllowedAnimCurveEvaluation(); // Function Engine.SkeletalMeshComponent.ResetAllowedAnimCurveEvaluation // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a9350
	void ResetAllBodiesSimulatePhysics(); // Function Engine.SkeletalMeshComponent.ResetAllBodiesSimulatePhysics // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a6540
	void PlayAnimation(struct UAnimationAsset* NewAnimToPlay, bool bLooping); // Function Engine.SkeletalMeshComponent.PlayAnimation // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40aaf90
	void Play(bool bLooping); // Function Engine.SkeletalMeshComponent.Play // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40aada0
	void OverrideAnimationData(struct UAnimationAsset* InAnimToPlay, bool bIsLooping, bool bIsPlaying, float Position, float PlayRate); // Function Engine.SkeletalMeshComponent.OverrideAnimationData // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40aa4a0
	void LinkAnimGraphByTag(struct FName InTag, struct UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.LinkAnimGraphByTag // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40ab880
	void LinkAnimClassLayers(struct UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.LinkAnimClassLayers // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40ab770
	bool K2_GetClosestPointOnPhysicsAsset(struct FVector& WorldPosition, struct FVector& ClosestWorldPosition, struct FVector& Normal, struct FName& BoneName, float& Distance); // Function Engine.SkeletalMeshComponent.K2_GetClosestPointOnPhysicsAsset // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x40a8060
	bool IsPlaying(); // Function Engine.SkeletalMeshComponent.IsPlaying // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40aacd0
	bool IsClothingSimulationSuspended(); // Function Engine.SkeletalMeshComponent.IsClothingSimulationSuspended // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40a9c30
	bool IsBodyGravityEnabled(struct FName BoneName); // Function Engine.SkeletalMeshComponent.IsBodyGravityEnabled // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a8720
	bool HasValidAnimationInstance(); // Function Engine.SkeletalMeshComponent.HasValidAnimationInstance // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40ab3e0
	bool GetTransformAttribute_Ref(struct FName& BoneName, struct FName& AttributeName, struct FTransform& OutValue, enum class ECustomBoneAttributeLookup LookupType); // Function Engine.SkeletalMeshComponent.GetTransformAttribute_Ref // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x40ad540
	bool GetTransformAttribute(struct FName& BoneName, struct FName& AttributeName, struct FTransform DefaultValue, struct FTransform& OutValue, enum class ECustomBoneAttributeLookup LookupType); // Function Engine.SkeletalMeshComponent.GetTransformAttribute // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x40ac710
	float GetTeleportRotationThreshold(); // Function Engine.SkeletalMeshComponent.GetTeleportRotationThreshold // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40a90e0
	float GetTeleportDistanceThreshold(); // Function Engine.SkeletalMeshComponent.GetTeleportDistanceThreshold // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40a8fb0
	bool GetStringAttribute_Ref(struct FName& BoneName, struct FName& AttributeName, struct FString& OutValue, enum class ECustomBoneAttributeLookup LookupType); // Function Engine.SkeletalMeshComponent.GetStringAttribute_Ref // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40acee0
	bool GetStringAttribute(struct FName& BoneName, struct FName& AttributeName, struct FString DefaultValue, struct FString& OutValue, enum class ECustomBoneAttributeLookup LookupType); // Function Engine.SkeletalMeshComponent.GetStringAttribute // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40abf50
	struct USkeletalMesh* GetSkeletalMeshAsset(); // Function Engine.SkeletalMeshComponent.GetSkeletalMeshAsset // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d1c4d0
	struct FVector GetSkeletalCenterOfMass(); // Function Engine.SkeletalMeshComponent.GetSkeletalCenterOfMass // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x40a7ba0
	struct UAnimInstance* GetPostProcessInstance(); // Function Engine.SkeletalMeshComponent.GetPostProcessInstance // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40abd90
	float GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40aaa80
	float GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40aa860
	float GetMorphTarget(struct FName MorphTargetName); // Function Engine.SkeletalMeshComponent.GetMorphTarget // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40aa0a0
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroup(struct FName InGroup); // Function Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByGroup // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40ab540
	struct UAnimInstance* GetLinkedAnimLayerInstanceByClass(struct UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByClass // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40ab420
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<struct UAnimInstance*>& OutLinkedInstances); // Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstancesByTag // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x40aba40
	struct UAnimInstance* GetLinkedAnimGraphInstanceByTag(struct FName InTag); // Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstanceByTag // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40abc70
	bool GetIntegerAttribute_Ref(struct FName& BoneName, struct FName& AttributeName, int32_t& OutValue, enum class ECustomBoneAttributeLookup LookupType); // Function Engine.SkeletalMeshComponent.GetIntegerAttribute_Ref // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40ad220
	bool GetIntegerAttribute(struct FName& BoneName, struct FName& AttributeName, int32_t DefaultValue, int32_t& OutValue, enum class ECustomBoneAttributeLookup LookupType); // Function Engine.SkeletalMeshComponent.GetIntegerAttribute // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40ac3c0
	bool GetFloatAttribute_Ref(struct FName& BoneName, struct FName& AttributeName, float& OutValue, enum class ECustomBoneAttributeLookup LookupType); // Function Engine.SkeletalMeshComponent.GetFloatAttribute_Ref // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40ad8e0
	bool GetFloatAttribute(struct FName& BoneName, struct FName& AttributeName, float DefaultValue, float& OutValue, enum class ECustomBoneAttributeLookup LookupType); // Function Engine.SkeletalMeshComponent.GetFloatAttribute // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40acb90
	bool GetDisablePostProcessBlueprint(); // Function Engine.SkeletalMeshComponent.GetDisablePostProcessBlueprint // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40ade20
	bool GetDisableAnimCurves(); // Function Engine.SkeletalMeshComponent.GetDisableAnimCurves // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40a96e0
	void GetCurrentJointAngles(struct FName InBoneName, float& Swing1Angle, float& TwistAngle, float& Swing2Angle); // Function Engine.SkeletalMeshComponent.GetCurrentJointAngles // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40a3a90
	void GetConstraintsFromBody(struct FName BodyName, bool bParentConstraints, bool bChildConstraints, bool bIncludesTerminated, struct TArray<struct FConstraintInstanceAccessor>& OutConstraints); // Function Engine.SkeletalMeshComponent.GetConstraintsFromBody // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40a4130
	void GetConstraints(bool bIncludesTerminated, struct TArray<struct FConstraintInstanceAccessor>& OutConstraints); // Function Engine.SkeletalMeshComponent.GetConstraints // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40a44f0
	struct FConstraintInstanceAccessor GetConstraintByName(struct FName ConstraintName, bool bIncludesTerminated); // Function Engine.SkeletalMeshComponent.GetConstraintByName // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a47d0
	float GetClothMaxDistanceScale(); // Function Engine.SkeletalMeshComponent.GetClothMaxDistanceScale // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40a9de0
	struct UClothingSimulationInteractor* GetClothingSimulationInteractor(); // Function Engine.SkeletalMeshComponent.GetClothingSimulationInteractor // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40a8e90
	float GetBoneMass(struct FName BoneName, bool bScaleMass); // Function Engine.SkeletalMeshComponent.GetBoneMass // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40a7e00
	struct FVector GetBoneLinearVelocity(struct FName& InBoneName); // Function Engine.SkeletalMeshComponent.GetBoneLinearVelocity // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x40a6900
	struct UAnimInstance* GetAnimInstance(); // Function Engine.SkeletalMeshComponent.GetAnimInstance // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40abdb0
	struct UObject* GetAnimClass(); // Function Engine.SkeletalMeshComponent.GetAnimClass // (Final|RequiredAPI|Native|Public) // @ game+0x40abdd0
	enum class EAnimationMode GetAnimationMode(); // Function Engine.SkeletalMeshComponent.GetAnimationMode // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40ab140
	bool GetAllowRigidBodyAnimNode(); // Function Engine.SkeletalMeshComponent.GetAllowRigidBodyAnimNode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40a9820
	bool GetAllowedAnimCurveEvaluate(); // Function Engine.SkeletalMeshComponent.GetAllowedAnimCurveEvaluate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40a95a0
	bool GetAllowClothActors(); // Function Engine.SkeletalMeshComponent.GetAllowClothActors // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x40a9e00
	void ForceClothNextUpdateTeleportAndReset(); // Function Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleportAndReset // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a9cb0
	void ForceClothNextUpdateTeleport(); // Function Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleport // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a9cd0
	struct FName FindConstraintBoneName(int32_t ConstraintIndex); // Function Engine.SkeletalMeshComponent.FindConstraintBoneName // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a4e40
	void ClearMorphTargets(); // Function Engine.SkeletalMeshComponent.ClearMorphTargets // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40aa230
	struct FBoxSphereBounds CalcRefPoseTightBounds(struct FRotator& AxisRotation); // Function Engine.SkeletalMeshComponent.CalcRefPoseTightBounds // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x40adc00
	void BreakConstraint(struct FVector Impulse, struct FVector HitLocation, struct FName InBoneName); // Function Engine.SkeletalMeshComponent.BreakConstraint // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x40a4a50
	void BindClothToLeaderPoseComponent(); // Function Engine.SkeletalMeshComponent.BindClothToLeaderPoseComponent // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a9b70
	void AllowAnimCurveEvaluation(struct FName NameOfCurve, bool bAllow); // Function Engine.SkeletalMeshComponent.AllowAnimCurveEvaluation // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x40a93a0
	void AddImpulseToAllBodiesBelow(struct FVector Impulse, struct FName BoneName, bool bVelChange, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.AddImpulseToAllBodiesBelow // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x40a75a0
	void AddForceToAllBodiesBelow(struct FVector Force, struct FName BoneName, bool bAccelChange, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.AddForceToAllBodiesBelow // (RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x40a78a0
	void AccumulateAllBodiesBelowPhysicsBlendWeight(struct FName& InBoneName, float AddPhysicsBlendWeight, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.AccumulateAllBodiesBelowPhysicsBlendWeight // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x40a5d90
};

// Class Engine.AnimInstance
// Size: 0x390 (Inherited: 0x30)
struct UAnimInstance : UObject {
	struct USkeleton* CurrentSkeleton; // 0x30(0x08)
	enum class ERootMotionMode RootMotionMode; // 0x38(0x01)
	char bUseMultiThreadedAnimationUpdate : 1; // 0x39(0x01)
	char bUsingCopyPoseFromMesh : 1; // 0x39(0x01)
	char pad_39_2 : 2; // 0x39(0x01)
	char bReceiveNotifiesFromLinkedInstances : 1; // 0x39(0x01)
	char bPropagateNotifiesToLinkedInstances : 1; // 0x39(0x01)
	char bUseMainInstanceMontageEvaluationData : 1; // 0x39(0x01)
	char bQueueMontageEvents : 1; // 0x39(0x01)
	char pad_3A[0x6]; // 0x3a(0x06)
	struct FMulticastInlineDelegate OnMontageBlendingOut; // 0x40(0x10)
	struct FMulticastInlineDelegate OnMontageStarted; // 0x50(0x10)
	struct FMulticastInlineDelegate OnMontageEnded; // 0x60(0x10)
	struct FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x70(0x10)
	char pad_80[0xd8]; // 0x80(0xd8)
	struct FAnimNotifyQueue NotifyQueue; // 0x158(0x80)
	struct TArray<struct FAnimNotifyEvent> ActiveAnimNotifyState; // 0x1d8(0x10)
	struct TArray<struct FAnimNotifyEventReference> ActiveAnimNotifyEventReference; // 0x1e8(0x10)
	char pad_1F8[0xb0]; // 0x1f8(0xb0)
	bool bAccumulateRootMotion; // 0x2a8(0x01)
	char pad_2A9[0x9f]; // 0x2a9(0x9f)
	struct UAnimInstanceReplicationComponent* AnimInstanceReplicationComponent; // 0x348(0x08)
	char pad_350[0x40]; // 0x350(0x40)

	bool WasAnimNotifyTriggeredInStateMachine(int32_t MachineIndex, struct UAnimNotify* AnimNotifyType); // Function Engine.AnimInstance.WasAnimNotifyTriggeredInStateMachine // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd4370
	bool WasAnimNotifyTriggeredInSourceState(int32_t MachineIndex, int32_t StateIndex, struct UAnimNotify* AnimNotifyType); // Function Engine.AnimInstance.WasAnimNotifyTriggeredInSourceState // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd47c0
	bool WasAnimNotifyTriggeredInAnyState(struct UAnimNotify* AnimNotifyType); // Function Engine.AnimInstance.WasAnimNotifyTriggeredInAnyState // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd4060
	bool WasAnimNotifyStateActiveInStateMachine(int32_t MachineIndex, struct UAnimNotifyState* AnimNotifyStateType); // Function Engine.AnimInstance.WasAnimNotifyStateActiveInStateMachine // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd4c60
	bool WasAnimNotifyStateActiveInSourceState(int32_t MachineIndex, int32_t StateIndex, struct UAnimNotifyState* AnimNotifyStateType); // Function Engine.AnimInstance.WasAnimNotifyStateActiveInSourceState // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd4a10
	bool WasAnimNotifyStateActiveInAnyState(struct UAnimNotifyState* AnimNotifyStateType); // Function Engine.AnimInstance.WasAnimNotifyStateActiveInAnyState // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd4e50
	bool WasAnimNotifyNameTriggeredInStateMachine(int32_t MachineIndex, struct FName NotifyName); // Function Engine.AnimInstance.WasAnimNotifyNameTriggeredInStateMachine // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd4180
	bool WasAnimNotifyNameTriggeredInSourceState(int32_t MachineIndex, int32_t StateIndex, struct FName NotifyName); // Function Engine.AnimInstance.WasAnimNotifyNameTriggeredInSourceState // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd4560
	bool WasAnimNotifyNameTriggeredInAnyState(struct FName NotifyName); // Function Engine.AnimInstance.WasAnimNotifyNameTriggeredInAnyState // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd3f30
	void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic); // Function Engine.AnimInstance.UnlockAIResources // (Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3dd2f70
	void UnlinkAnimClassLayers(struct UAnimInstance* InClass); // Function Engine.AnimInstance.UnlinkAnimClassLayers // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd7d50
	struct APawn* TryGetPawnOwner(); // Function Engine.AnimInstance.TryGetPawnOwner // (RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ddec90
	void StopSlotAnimation(float InBlendOutTime, struct FName SlotNodeName); // Function Engine.AnimInstance.StopSlotAnimation // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3ddcf70
	void SnapshotPose(struct FPoseSnapshot& Snapshot); // Function Engine.AnimInstance.SnapshotPose // (RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3dde840
	void SetUseMainInstanceMontageEvaluationData(bool bSet); // Function Engine.AnimInstance.SetUseMainInstanceMontageEvaluationData // (Final|Native|Public|BlueprintCallable) // @ game+0x3dde4b0
	void SetRootMotionMode(enum class ERootMotionMode Value); // Function Engine.AnimInstance.SetRootMotionMode // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d5d450
	void SetReceiveNotifiesFromLinkedInstances(bool bSet); // Function Engine.AnimInstance.SetReceiveNotifiesFromLinkedInstances // (Final|Native|Public|BlueprintCallable) // @ game+0x3dde710
	void SetPropagateNotifiesToLinkedInstances(bool bSet); // Function Engine.AnimInstance.SetPropagateNotifiesToLinkedInstances // (Final|Native|Public|BlueprintCallable) // @ game+0x3dde5e0
	void SetMorphTarget(struct FName MorphTargetName, float Value); // Function Engine.AnimInstance.SetMorphTarget // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd3550
	void SetInstanceTransitionCrossfadeDurationOverride(int32_t MachineIndex, float OverrideCrossFadeDuration); // Function Engine.AnimInstance.SetInstanceTransitionCrossfadeDurationOverride // (Final|Native|Public|BlueprintCallable) // @ game+0x3dd5f90
	void SavePoseSnapshot(struct FName SnapshotName); // Function Engine.AnimInstance.SavePoseSnapshot // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3ddeb80
	void ResetDynamics(enum class ETeleportType InTeleportType); // Function Engine.AnimInstance.ResetDynamics // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd1790
	void ResetAnimGraph(); // Function Engine.AnimInstance.ResetAnimGraph // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd1770
	bool RequestTransitionEvent(struct FName EventName, double RequestTimeout, enum class ETransitionRequestQueueMode QueueMode, enum class ETransitionRequestOverwriteMode OverwriteMode); // Function Engine.AnimInstance.RequestTransitionEvent // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd2250
	void RequestSlotGroupInertialization(struct FName InSlotGroupName, float Duration, struct UBlendProfile* BlendProfile); // Function Engine.AnimInstance.RequestSlotGroupInertialization // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd7540
	void RemovePoseSnapshot(struct FName SnapshotName); // Function Engine.AnimInstance.RemovePoseSnapshot // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dde9c0
	bool QueryTransitionEvent(int32_t MachineIndex, int32_t TransitionIndex, struct FName EventName); // Function Engine.AnimInstance.QueryTransitionEvent // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd1bc0
	bool QueryAndMarkTransitionEvent(int32_t MachineIndex, int32_t TransitionIndex, struct FName EventName); // Function Engine.AnimInstance.QueryAndMarkTransitionEvent // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd1890
	struct UAnimMontage* PlaySlotAnimationAsDynamicMontage_WithBlendSettings(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, struct FMontageBlendSettings& BlendInSettings, struct FMontageBlendSettings& BlendOutSettings, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage_WithBlendSettings // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3ddd290
	struct UAnimMontage* PlaySlotAnimationAsDynamicMontage_WithBlendArgs(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, struct FAlphaBlendArgs& BlendIn, struct FAlphaBlendArgs& BlendOut, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage_WithBlendArgs // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3ddd870
	struct UAnimMontage* PlaySlotAnimationAsDynamicMontage(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3ddde90
	void MontageSync_StopFollowing(struct UAnimMontage* MontageFollower); // Function Engine.AnimInstance.MontageSync_StopFollowing // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd83d0
	void MontageSync_Follow(struct UAnimMontage* MontageFollower, struct UAnimInstance* OtherAnimInstance, struct UAnimMontage* MontageLeader); // Function Engine.AnimInstance.MontageSync_Follow // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd84d0
	void Montage_StopWithBlendSettings(struct FMontageBlendSettings& BlendOutSettings, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_StopWithBlendSettings // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3dda7b0
	void Montage_StopWithBlendOut(struct FAlphaBlendArgs& BlendOut, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_StopWithBlendOut // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3dda9a0
	void Montage_StopGroupByName(float InBlendOutTime, struct FName GroupName); // Function Engine.AnimInstance.Montage_StopGroupByName // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dda480
	void Montage_Stop(float InBlendOutTime, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Stop // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3ddab70
	void Montage_SetPosition(struct UAnimMontage* Montage, float NewPosition); // Function Engine.AnimInstance.Montage_SetPosition // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd8ce0
	void Montage_SetPlayRate(struct UAnimMontage* Montage, float NewPlayRate); // Function Engine.AnimInstance.Montage_SetPlayRate // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd94b0
	void Montage_SetNextSection(struct FName SectionNameToChange, struct FName NextSection, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_SetNextSection // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd96b0
	void Montage_Resume(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Resume // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd9ee0
	float Montage_PlayWithBlendSettings(struct UAnimMontage* MontageToPlay, struct FMontageBlendSettings& BlendInSettings, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Function Engine.AnimInstance.Montage_PlayWithBlendSettings // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3ddad00
	float Montage_PlayWithBlendIn(struct UAnimMontage* MontageToPlay, struct FAlphaBlendArgs& BlendIn, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Function Engine.AnimInstance.Montage_PlayWithBlendIn // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3ddb680
	float Montage_Play(struct UAnimMontage* MontageToPlay, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Function Engine.AnimInstance.Montage_Play // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3ddc030
	void Montage_Pause(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Pause // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dda050
	void Montage_JumpToSectionsEnd(struct FName SectionName, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_JumpToSectionsEnd // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd9a80
	void Montage_JumpToSection(struct FName SectionName, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_JumpToSection // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd9cb0
	bool Montage_IsPlaying(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_IsPlaying // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd9200
	bool Montage_IsActive(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_IsActive // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd9360
	void Montage_GroupStop(float InBlendOutTime, struct FName GroupName); // Function Engine.AnimInstance.Montage_GroupStop // (Final|Native|Public|BlueprintCallable) // @ game+0x3dda1b0
	float Montage_GetPosition(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetPosition // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd8f00
	float Montage_GetPlayRate(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetPlayRate // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd8930
	bool Montage_GetIsStopped(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetIsStopped // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd8bd0
	float Montage_GetEffectivePlayRate(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetEffectivePlayRate // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd87c0
	struct FName Montage_GetCurrentSection(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetCurrentSection // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd9050
	float Montage_GetBlendTime(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetBlendTime // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd8a80
	void LockAIResources(bool bLockMovement, bool LockAILogic); // Function Engine.AnimInstance.LockAIResources // (Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3dd3170
	void LinkAnimGraphByTag(struct FName InTag, struct UAnimInstance* InClass); // Function Engine.AnimInstance.LinkAnimGraphByTag // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd7e50
	void LinkAnimClassLayers(struct UAnimInstance* InClass); // Function Engine.AnimInstance.LinkAnimClassLayers // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3bf06b0
	bool IsUsingMainInstanceMontageEvaluationData(); // Function Engine.AnimInstance.IsUsingMainInstanceMontageEvaluationData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dde5b0
	bool IsSyncGroupBetweenMarkers(struct FName InSyncGroupName, struct FName PreviousMarker, struct FName NextMarker, bool bRespectMarkerOrder); // Function Engine.AnimInstance.IsSyncGroupBetweenMarkers // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd2730
	bool IsSlotActive(struct FName SlotNodeName); // Function Engine.AnimInstance.IsSlotActive // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ddcaf0
	bool IsPlayingSlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName); // Function Engine.AnimInstance.IsPlayingSlotAnimation // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ddcd30
	bool IsAnyMontagePlaying(); // Function Engine.AnimInstance.IsAnyMontagePlaying // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd83a0
	bool HasMarkerBeenHitThisFrame(struct FName SyncGroup, struct FName MarkerName); // Function Engine.AnimInstance.HasMarkerBeenHitThisFrame // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd2b40
	bool GetTimeToClosestMarker(struct FName SyncGroup, struct FName MarkerName, float& OutMarkerTime); // Function Engine.AnimInstance.GetTimeToClosestMarker // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd2d10
	float GetTimeSpentOutsideState(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetTimeSpentOutsideState // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd6530
	float GetTimeSinceLeavingState(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetTimeSinceLeavingState // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd6910
	float GetTimeSinceEnteringState(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetTimeSinceEnteringState // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd6710
	struct FMarkerSyncAnimPosition GetSyncGroupPosition(struct FName InSyncGroupName); // Function Engine.AnimInstance.GetSyncGroupPosition // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd2560
	float GetRelevantAnimTimeRemainingFraction(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeRemainingFraction // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd5690
	float GetRelevantAnimTimeRemaining(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeRemaining // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd5820
	float GetRelevantAnimTimeFraction(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTimeFraction // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd4f70
	float GetRelevantAnimTime(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimTime // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd5250
	float GetRelevantAnimLength(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetRelevantAnimLength // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd53e0
	bool GetReceiveNotifiesFromLinkedInstances(); // Function Engine.AnimInstance.GetReceiveNotifiesFromLinkedInstances // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dde810
	bool GetPropagateNotifiesToLinkedInstances(); // Function Engine.AnimInstance.GetPropagateNotifiesToLinkedInstances // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dde6e0
	struct USkeletalMeshComponent* GetOwningComponent(); // Function Engine.AnimInstance.GetOwningComponent // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dde460
	struct AActor* GetOwningActor(); // Function Engine.AnimInstance.GetOwningActor // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dde480
	void GetLinkedAnimLayerInstancesByGroup(struct FName InGroup, struct TArray<struct UAnimInstance*>& OutLinkedInstances); // Function Engine.AnimInstance.GetLinkedAnimLayerInstancesByGroup // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd7a40
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroupAndClass(struct FName InGroup, struct UAnimInstance* InClass); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByGroupAndClass // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd7880
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroup(struct FName InGroup); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByGroup // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd7c40
	struct UAnimInstance* GetLinkedAnimLayerInstanceByClass(struct UAnimInstance* InClass); // Function Engine.AnimInstance.GetLinkedAnimLayerInstanceByClass // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd7780
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<struct UAnimInstance*>& OutLinkedInstances); // Function Engine.AnimInstance.GetLinkedAnimGraphInstancesByTag // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd8000
	struct UAnimInstance* GetLinkedAnimGraphInstanceByTag(struct FName InTag); // Function Engine.AnimInstance.GetLinkedAnimGraphInstanceByTag // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd8220
	float GetInstanceTransitionTimeElapsedFraction(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionTimeElapsedFraction // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd59b0
	float GetInstanceTransitionTimeElapsed(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionTimeElapsed // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd5ca0
	float GetInstanceTransitionCrossfadeDuration(int32_t MachineIndex, int32_t TransitionIndex); // Function Engine.AnimInstance.GetInstanceTransitionCrossfadeDuration // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd61e0
	float GetInstanceStateWeight(int32_t MachineIndex, int32_t StateIndex); // Function Engine.AnimInstance.GetInstanceStateWeight // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd6b10
	float GetInstanceMachineWeight(int32_t MachineIndex); // Function Engine.AnimInstance.GetInstanceMachineWeight // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd6ca0
	float GetInstanceCurrentStateElapsedTime(int32_t MachineIndex); // Function Engine.AnimInstance.GetInstanceCurrentStateElapsedTime // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd6370
	float GetInstanceAssetPlayerTimeFromEndFraction(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEndFraction // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd6da0
	float GetInstanceAssetPlayerTimeFromEnd(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFromEnd // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd6fa0
	float GetInstanceAssetPlayerTimeFraction(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTimeFraction // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd7190
	float GetInstanceAssetPlayerTime(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerTime // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd7290
	float GetInstanceAssetPlayerLength(int32_t AssetPlayerIndex); // Function Engine.AnimInstance.GetInstanceAssetPlayerLength // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd7390
	float GetDeltaSeconds(); // Function Engine.AnimInstance.GetDeltaSeconds // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd1690
	bool GetCurveValueWithDefault(struct FName CurveName, float DefaultValue, float& OutValue); // Function Engine.AnimInstance.GetCurveValueWithDefault // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x3dd3ba0
	float GetCurveValue(struct FName CurveName); // Function Engine.AnimInstance.GetCurveValue // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd3e00
	struct FName GetCurrentStateName(int32_t MachineIndex); // Function Engine.AnimInstance.GetCurrentStateName // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3dd3710
	struct UAnimMontage* GetCurrentActiveMontage(); // Function Engine.AnimInstance.GetCurrentActiveMontage // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd8330
	void GetAllCurveNames(struct TArray<struct FName>& OutNames); // Function Engine.AnimInstance.GetAllCurveNames // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd3890
	void GetActiveCurveNames(enum class EAnimCurveType CurveType, struct TArray<struct FName>& OutNames); // Function Engine.AnimInstance.GetActiveCurveNames // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd39c0
	void ClearTransitionEvents(struct FName EventName); // Function Engine.AnimInstance.ClearTransitionEvents // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd2090
	void ClearMorphTargets(); // Function Engine.AnimInstance.ClearMorphTargets // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd3520
	void ClearAllTransitionEvents(); // Function Engine.AnimInstance.ClearAllTransitionEvents // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3dd1fb0
	float CalculateDirection(struct FVector& Velocity, struct FRotator& BaseRotation); // Function Engine.AnimInstance.CalculateDirection // (Final|RequiredAPI|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3dd3370
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function Engine.AnimInstance.BlueprintUpdateAnimation // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime); // Function Engine.AnimInstance.BlueprintThreadSafeUpdateAnimation // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void BlueprintPostEvaluateAnimation(); // Function Engine.AnimInstance.BlueprintPostEvaluateAnimation // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void BlueprintLinkedAnimationLayersInitialized(); // Function Engine.AnimInstance.BlueprintLinkedAnimationLayersInitialized // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void BlueprintInitializeAnimation(); // Function Engine.AnimInstance.BlueprintInitializeAnimation // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void BlueprintBeginPlay(); // Function Engine.AnimInstance.BlueprintBeginPlay // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	float Blueprint_GetSlotMontageLocalWeight(struct FName SlotNodeName); // Function Engine.AnimInstance.Blueprint_GetSlotMontageLocalWeight // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ddc950
};

// Class Engine.BlueprintAsyncActionBase
// Size: 0x38 (Inherited: 0x30)
struct UBlueprintAsyncActionBase : UObject {
	char pad_30[0x8]; // 0x30(0x08)

	void Activate(); // Function Engine.BlueprintAsyncActionBase.Activate // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3bf0820
};

// Class Engine.BlueprintCore
// Size: 0x58 (Inherited: 0x30)
struct UBlueprintCore : UObject {
	struct UObject* SkeletonGeneratedClass; // 0x30(0x08)
	struct UObject* GeneratedClass; // 0x38(0x08)
	bool bLegacyNeedToPurgeSkelRefs; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	struct FGuid BlueprintGuid; // 0x44(0x10)
	char pad_54[0x4]; // 0x54(0x04)
};

// Class Engine.Blueprint
// Size: 0xb0 (Inherited: 0x58)
struct UBlueprint : UBlueprintCore {
	char pad_58[0x8]; // 0x58(0x08)
	struct UObject* ParentClass; // 0x60(0x08)
	enum class EBlueprintType BlueprintType; // 0x68(0x01)
	char bRecompileOnLoad : 1; // 0x69(0x01)
	char bHasBeenRegenerated : 1; // 0x69(0x01)
	char bIsRegeneratingOnLoad : 1; // 0x69(0x01)
	char pad_69_3 : 5; // 0x69(0x01)
	char pad_6A[0x2]; // 0x6a(0x02)
	int32_t BlueprintSystemVersion; // 0x6c(0x04)
	struct USimpleConstructionScript* SimpleConstructionScript; // 0x70(0x08)
	struct TArray<struct UActorComponent*> ComponentTemplates; // 0x78(0x10)
	struct TArray<struct UTimelineTemplate*> Timelines; // 0x88(0x10)
	struct TArray<struct FBPComponentClassOverride> ComponentClassOverrides; // 0x98(0x10)
	struct UInheritableComponentHandler* InheritableComponentHandler; // 0xa8(0x08)
};

// Class Engine.DynamicBlueprintBinding
// Size: 0x30 (Inherited: 0x30)
struct UDynamicBlueprintBinding : UObject {
};

// Class Engine.DynamicSubsystem
// Size: 0x38 (Inherited: 0x38)
struct UDynamicSubsystem : USubsystem {
};

// Class Engine.EngineSubsystem
// Size: 0x38 (Inherited: 0x38)
struct UEngineSubsystem : UDynamicSubsystem {
};

// Class Engine.BlueprintGeneratedClass
// Size: 0x378 (Inherited: 0x210)
struct UBlueprintGeneratedClass : UClass {
	char pad_210[0x8]; // 0x210(0x08)
	int32_t NumReplicatedProperties; // 0x218(0x04)
	char bHasNativizedParent : 1; // 0x21c(0x01)
	char bHasCookedComponentInstancingData : 1; // 0x21c(0x01)
	char pad_21C_2 : 6; // 0x21c(0x01)
	char pad_21D[0x3]; // 0x21d(0x03)
	struct TArray<struct UDynamicBlueprintBinding*> DynamicBindingObjects; // 0x220(0x10)
	struct TArray<struct UActorComponent*> ComponentTemplates; // 0x230(0x10)
	struct TArray<struct UTimelineTemplate*> Timelines; // 0x240(0x10)
	struct TArray<struct FBPComponentClassOverride> ComponentClassOverrides; // 0x250(0x10)
	struct TArray<struct FFieldNotificationId> FieldNotifies; // 0x260(0x10)
	char pad_270[0x8]; // 0x270(0x08)
	struct USimpleConstructionScript* SimpleConstructionScript; // 0x278(0x08)
	struct UInheritableComponentHandler* InheritableComponentHandler; // 0x280(0x08)
	struct UStructProperty* UberGraphFramePointerProperty; // 0x288(0x08)
	char pad_290[0x8]; // 0x290(0x08)
	struct UFunction* UberGraphFunction; // 0x298(0x08)
	struct TMap<struct FName, struct FGuid> CookedPropertyGuids; // 0x2a0(0x50)
	struct TMap<struct FName, struct FBlueprintCookedComponentInstancingData> CookedComponentInstancingData; // 0x2f0(0x50)
	char pad_340[0x38]; // 0x340(0x38)
};

// Class Engine.CameraActor
// Size: 0xc90 (Inherited: 0x460)
struct ACameraActor : AActor {
	enum class EAutoReceiveInput AutoActivateForPlayer; // 0x460(0x01)
	char pad_461[0x7]; // 0x461(0x07)
	struct UCameraComponent* CameraComponent; // 0x468(0x08)
	struct USceneComponent* SceneComponent; // 0x470(0x08)
	char bConstrainAspectRatio : 1; // 0x478(0x01)
	char pad_478_1 : 7; // 0x478(0x01)
	char pad_479[0x3]; // 0x479(0x03)
	float AspectRatio; // 0x47c(0x04)
	float FOVAngle; // 0x480(0x04)
	float PostProcessBlendWeight; // 0x484(0x04)
	char pad_488[0x8]; // 0x488(0x08)
	struct FPostProcessSettings PostProcessSettings; // 0x490(0x800)

	int32_t GetAutoActivatePlayerIndex(); // Function Engine.CameraActor.GetAutoActivatePlayerIndex // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3f480d0
};

// Class Engine.CameraComponent
// Size: 0xbe0 (Inherited: 0x330)
struct UCameraComponent : USceneComponent {
	bool bOverrideFov; // 0x330(0x01)
	bool bOverrideCameraRenderSettings; // 0x331(0x01)
	char pad_332[0x2]; // 0x332(0x02)
	float fieldOfView; // 0x334(0x04)
	float OrthoWidth; // 0x338(0x04)
	float OrthoNearClipPlane; // 0x33c(0x04)
	float OrthoFarClipPlane; // 0x340(0x04)
	float AspectRatio; // 0x344(0x04)
	enum class EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x348(0x01)
	char bConstrainAspectRatio : 1; // 0x349(0x01)
	char bOverrideAspectRatioAxisConstraint : 1; // 0x349(0x01)
	char bUseFieldOfViewForLOD : 1; // 0x349(0x01)
	char bLockToHmd : 1; // 0x349(0x01)
	char bUsePawnControlRotation : 1; // 0x349(0x01)
	char pad_349_5 : 3; // 0x349(0x01)
	enum class ECameraProjectionMode ProjectionMode; // 0x34a(0x01)
	char pad_34B[0x65]; // 0x34b(0x65)
	float PostProcessBlendWeight; // 0x3b0(0x04)
	char pad_3B4[0x2c]; // 0x3b4(0x2c)
	struct FPostProcessSettings PostProcessSettings; // 0x3e0(0x800)

	void SetUseFieldOfViewForLOD(bool bInUseFieldOfViewForLOD); // Function Engine.CameraComponent.SetUseFieldOfViewForLOD // (Final|Native|Public|BlueprintCallable) // @ game+0x3f49170
	void SetProjectionMode(enum class ECameraProjectionMode InProjectionMode); // Function Engine.CameraComponent.SetProjectionMode // (Final|Native|Public|BlueprintCallable) // @ game+0x3f49080
	void SetPostProcessBlendWeight(float InPostProcessBlendWeight); // Function Engine.CameraComponent.SetPostProcessBlendWeight // (Final|Native|Public|BlueprintCallable) // @ game+0x3f48f90
	void SetOrthoWidth(float InOrthoWidth); // Function Engine.CameraComponent.SetOrthoWidth // (Final|Native|Public|BlueprintCallable) // @ game+0x3f49630
	void SetOrthoNearClipPlane(float InOrthoNearClipPlane); // Function Engine.CameraComponent.SetOrthoNearClipPlane // (Final|Native|Public|BlueprintCallable) // @ game+0x3f49540
	void SetOrthoFarClipPlane(float InOrthoFarClipPlane); // Function Engine.CameraComponent.SetOrthoFarClipPlane // (Final|Native|Public|BlueprintCallable) // @ game+0x3f49450
	void SetFieldOfView(float InFieldOfView); // Function Engine.CameraComponent.SetFieldOfView // (Native|Public|BlueprintCallable) // @ game+0x3b3ab70
	void SetAspectRatioAxisConstraint(enum class EAspectRatioAxisConstraint InAspectRatioAxisConstraint); // Function Engine.CameraComponent.SetAspectRatioAxisConstraint // (Final|Native|Public|BlueprintCallable) // @ game+0x3f49270
	void SetAspectRatio(float InAspectRatio); // Function Engine.CameraComponent.SetAspectRatio // (Final|Native|Public|BlueprintCallable) // @ game+0x3f49360
	void RemoveBlendable(struct TScriptInterface<IBlendableInterface> InBlendableObject); // Function Engine.CameraComponent.RemoveBlendable // (Final|Native|Public|BlueprintCallable) // @ game+0x3f48ac0
	void OnCameraMeshHiddenChanged(); // Function Engine.CameraComponent.OnCameraMeshHiddenChanged // (Final|RequiredAPI|Native|Protected|BlueprintCallable) // @ game+0x39f7660
	void GetCameraView(float DeltaTime, struct FMinimalViewInfo& DesiredView); // Function Engine.CameraComponent.GetCameraView // (RequiredAPI|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3f48d70
	void AddOrUpdateBlendable(struct TScriptInterface<IBlendableInterface> InBlendableObject, float InWeight); // Function Engine.CameraComponent.AddOrUpdateBlendable // (Final|Native|Public|BlueprintCallable) // @ game+0x3f48bc0
};

// Class Engine.AudioEngineSubsystem
// Size: 0x38 (Inherited: 0x38)
struct UAudioEngineSubsystem : UDynamicSubsystem {
};

// Class Engine.SoundBase
// Size: 0x170 (Inherited: 0x30)
struct USoundBase : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct USoundClass* SoundClassObject; // 0x38(0x08)
	char bDebug : 1; // 0x40(0x01)
	char bOverrideConcurrency : 1; // 0x40(0x01)
	char bEnableBusSends : 1; // 0x40(0x01)
	char bEnableBaseSubmix : 1; // 0x40(0x01)
	char bEnableSubmixSends : 1; // 0x40(0x01)
	char bHasDelayNode : 1; // 0x40(0x01)
	char bHasConcatenatorNode : 1; // 0x40(0x01)
	char bBypassVolumeScaleForPriority : 1; // 0x40(0x01)
	enum class EVirtualizationMode VirtualizationMode; // 0x41(0x01)
	char pad_42[0x56]; // 0x42(0x56)
	struct TSet<struct USoundConcurrency*> ConcurrencySet; // 0x98(0x50)
	struct FSoundConcurrencySettings ConcurrencyOverrides; // 0xe8(0x20)
	float Duration; // 0x108(0x04)
	float MaxDistance; // 0x10c(0x04)
	float TotalSamples; // 0x110(0x04)
	float Priority; // 0x114(0x04)
	struct USoundAttenuation* AttenuationSettings; // 0x118(0x08)
	struct USoundSubmixBase* SoundSubmixObject; // 0x120(0x08)
	struct TArray<struct FSoundSubmixSendInfo> SoundSubmixSends; // 0x128(0x10)
	struct USoundEffectSourcePresetChain* SourceEffectChain; // 0x138(0x08)
	struct TArray<struct FSoundSourceBusSendInfo> BusSends; // 0x140(0x10)
	struct TArray<struct FSoundSourceBusSendInfo> PreEffectBusSends; // 0x150(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x160(0x10)

	bool IsAttenuationSettingsEditable(); // Function Engine.SoundBase.IsAttenuationSettingsEditable // (Native|Public|Const) // @ game+0x49c9200
};

// Class Engine.SoundWave
// Size: 0x440 (Inherited: 0x170)
struct USoundWave : USoundBase {
	char pad_170[0x10]; // 0x170(0x10)
	int32_t CompressionQuality; // 0x180(0x04)
	int32_t StreamingPriority; // 0x184(0x04)
	enum class ESoundwaveSampleRateSettings SampleRateQuality; // 0x188(0x01)
	char pad_189[0x1]; // 0x189(0x01)
	enum class ESoundGroup SoundGroup; // 0x18a(0x01)
	char bLooping : 1; // 0x18b(0x01)
	char bStreaming : 1; // 0x18b(0x01)
	char pad_18B_2 : 6; // 0x18b(0x01)
	enum class ESoundAssetCompressionType SoundAssetCompressionType; // 0x18c(0x01)
	char bSeekableStreaming : 1; // 0x18d(0x01)
	char bUseBinkAudio : 1; // 0x18d(0x01)
	char pad_18D_2 : 6; // 0x18d(0x01)
	char pad_18E[0x1a]; // 0x18e(0x1a)
	struct FSoundModulationDefaultRoutingSettings ModulationSettings; // 0x1a8(0x168)
	struct TArray<float> FrequenciesToAnalyze; // 0x310(0x10)
	struct TArray<struct FSoundWaveSpectralTimeData> CookedSpectralTimeData; // 0x320(0x10)
	struct TArray<struct FSoundWaveEnvelopeTimeData> CookedEnvelopeTimeData; // 0x330(0x10)
	int32_t InitialChunkSize; // 0x340(0x04)
	char pad_344[0x40]; // 0x344(0x40)
	char pad_384_0 : 5; // 0x384(0x01)
	char bMature : 1; // 0x384(0x01)
	char bManualWordWrap : 1; // 0x384(0x01)
	char bSingleLine : 1; // 0x384(0x01)
	char bIsAmbisonics : 1; // 0x385(0x01)
	char pad_385_1 : 7; // 0x385(0x01)
	enum class ESoundWaveLoadingBehavior LoadingBehavior; // 0x386(0x01)
	char pad_387[0x1]; // 0x387(0x01)
	struct FString SpokenText; // 0x388(0x10)
	float SubtitlePriority; // 0x398(0x04)
	float Volume; // 0x39c(0x04)
	float Pitch; // 0x3a0(0x04)
	int32_t NumChannels; // 0x3a4(0x04)
	struct TArray<struct FSoundWaveCuePoint> CuePoints; // 0x3a8(0x10)
	int32_t SampleRate; // 0x3b8(0x04)
	char pad_3BC[0xc]; // 0x3bc(0x0c)
	struct TArray<struct FSubtitleCue> Subtitles; // 0x3c8(0x10)
	struct UCurveTable* Curves; // 0x3d8(0x08)
	struct UCurveTable* InternalCurves; // 0x3e0(0x08)
	char pad_3E8[0x58]; // 0x3e8(0x58)

	void SetSoundAssetCompressionType(enum class ESoundAssetCompressionType InSoundAssetCompressionType, bool bMarkDirty); // Function Engine.SoundWave.SetSoundAssetCompressionType // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3d24ac0
	enum class ESoundAssetCompressionType GetSoundAssetCompressionType(); // Function Engine.SoundWave.GetSoundAssetCompressionType // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d24c30
	struct TArray<struct FSoundWaveCuePoint> GetLoopRegions(); // Function Engine.SoundWave.GetLoopRegions // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d24a20
	struct TArray<struct FSoundWaveCuePoint> GetCuePoints(); // Function Engine.SoundWave.GetCuePoints // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d24a70
};

// Class Engine.SoundWaveProcedural
// Size: 0x490 (Inherited: 0x440)
struct USoundWaveProcedural : USoundWave {
	char pad_440[0x50]; // 0x440(0x50)
};

// Class Engine.SoundEffectPreset
// Size: 0x70 (Inherited: 0x30)
struct USoundEffectPreset : UObject {
	char pad_30[0x40]; // 0x30(0x40)
};

// Class Engine.SoundEffectSubmixPreset
// Size: 0x70 (Inherited: 0x70)
struct USoundEffectSubmixPreset : USoundEffectPreset {
};

// Class Engine.Texture
// Size: 0x1e0 (Inherited: 0xd0)
struct UTexture : UStreamableRenderAsset {
	char pad_D0[0x10]; // 0xd0(0x10)
	struct FGuid LightingGuid; // 0xe0(0x10)
	int32_t LevelIndex; // 0xf0(0x04)
	int32_t LODBias; // 0xf4(0x04)
	enum class ETextureStreamingImportance StreamingImportance; // 0xf8(0x01)
	enum class TextureCompressionSettings CompressionSettings; // 0xf9(0x01)
	enum class TextureFilter Filter; // 0xfa(0x01)
	enum class ETextureMipLoadOptions MipLoadOptions; // 0xfb(0x01)
	enum class TextureCookPlatformTilingSettings CookPlatformTilingSettings; // 0xfc(0x01)
	enum class TextureGroup LODGroup; // 0xfd(0x01)
	char pad_FE[0x2]; // 0xfe(0x02)
	struct FPerPlatformFloat Downscale; // 0x100(0x04)
	enum class ETextureDownscaleOptions DownscaleOptions; // 0x104(0x01)
	char SRGB : 1; // 0x105(0x01)
	char bNoTiling : 1; // 0x105(0x01)
	char VirtualTextureStreaming : 1; // 0x105(0x01)
	char CompressionYCoCg : 1; // 0x105(0x01)
	char bNotOfflineProcessed : 1; // 0x105(0x01)
	char pad_105_5 : 3; // 0x105(0x01)
	char pad_106[0x2]; // 0x106(0x02)
	int32_t ForcedStreamingRefCount; // 0x108(0x04)
	char bAsyncResourceReleaseHasBeenStarted : 1; // 0x10c(0x01)
	char pad_10C_1 : 7; // 0x10c(0x01)
	char pad_10D[0x3]; // 0x10d(0x03)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x110(0x10)
	char pad_120[0xc0]; // 0x120(0xc0)

	bool ComputeTextureSourceChannelMinMax(struct FLinearColor& OutColorMin, struct FLinearColor& OutColorMax); // Function Engine.Texture.ComputeTextureSourceChannelMinMax // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|Const) // @ game+0x4a965f0
	void Blueprint_GetTextureSourceDiskAndMemorySize(int64_t& OutDiskSize, int64_t& OutMemorySize); // Function Engine.Texture.Blueprint_GetTextureSourceDiskAndMemorySize // (Final|Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x4a96840
	int64_t Blueprint_GetMemorySize(); // Function Engine.Texture.Blueprint_GetMemorySize // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x4a96a70
};

// Class Engine.ActiveSoundUpdateInterface
// Size: 0x30 (Inherited: 0x30)
struct UActiveSoundUpdateInterface : UInterface {
};

// Class Engine.Channel
// Size: 0x78 (Inherited: 0x30)
struct UChannel : UObject {
	struct UNetConnection* Connection; // 0x30(0x08)
	char pad_38[0x40]; // 0x38(0x40)
};

// Class Engine.ActorChannel
// Size: 0x2b0 (Inherited: 0x78)
struct UActorChannel : UChannel {
	struct AActor* Actor; // 0x78(0x08)
	char pad_80[0xf0]; // 0x80(0xf0)
	struct TArray<struct UObject*> CreateSubObjects; // 0x170(0x10)
	char pad_180[0x130]; // 0x180(0x130)
};

// Class Engine.AnimationAssetExtensions
// Size: 0x30 (Inherited: 0x30)
struct UAnimationAssetExtensions : UBlueprintFunctionLibrary {
};

// Class Engine.AnimBlueprintClassSubsystem_PropertyAccess
// Size: 0x30 (Inherited: 0x30)
struct UAnimBlueprintClassSubsystem_PropertyAccess : UObject {
};

// Class Engine.Interface_AnimCurveMetaData
// Size: 0x30 (Inherited: 0x30)
struct UInterface_AnimCurveMetaData : UInterface {
};

// Class Engine.AnimCurveMetaData
// Size: 0xa8 (Inherited: 0x30)
struct UAnimCurveMetaData : UAssetUserData {
	char pad_30[0x8]; // 0x30(0x08)
	struct TMap<struct FName, struct FCurveMetaData> CurveMetaData; // 0x38(0x50)
	char pad_88[0x20]; // 0x88(0x20)
};

// Class Engine.AnimationDataModelNotifiesExtensions
// Size: 0x30 (Inherited: 0x30)
struct UAnimationDataModelNotifiesExtensions : UBlueprintFunctionLibrary {
};

// Class Engine.AnimInstanceReplicationComponent
// Size: 0x158 (Inherited: 0xd8)
struct UAnimInstanceReplicationComponent : UActorComponent {
	struct TArray<struct FAnimInstanceStateMachines> AnimInstancesStateMachines; // 0xd8(0x10)
	struct TMap<int32_t, struct FAnimInstanceBlendSpaces> AnimInstancesBlendSpaces; // 0xe8(0x50)
	char pad_138[0x20]; // 0x138(0x20)
};

// Class Engine.AnimLayerInterface
// Size: 0x30 (Inherited: 0x30)
struct UAnimLayerInterface : UInterface {
};

// Class Engine.AnimationAsset
// Size: 0x90 (Inherited: 0x30)
struct UAnimationAsset : UObject {
	char pad_30[0x10]; // 0x30(0x10)
	struct USkeleton* Skeleton; // 0x40(0x08)
	char pad_48[0x20]; // 0x48(0x20)
	struct TArray<struct UAnimMetaData*> MetaData; // 0x68(0x10)
	char pad_78[0x4]; // 0x78(0x04)
	uint32_t SkeletonHash; // 0x7c(0x04)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x80(0x10)

	float GetPlayLength(); // Function Engine.AnimationAsset.GetPlayLength // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3da1540
};

// Class Engine.AnimSequenceBase
// Size: 0xc0 (Inherited: 0x90)
struct UAnimSequenceBase : UAnimationAsset {
	struct TArray<struct FAnimNotifyEvent> Notifies; // 0x90(0x10)
	float SequenceLength; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct FRawCurveTracks RawCurveData; // 0xa8(0x10)
	float RateScale; // 0xb8(0x04)
	bool bLoop; // 0xbc(0x01)
	char pad_BD[0x3]; // 0xbd(0x03)

	struct TArray<struct UAnimNotifyState*> GetStateNotifiesByType(struct TSoftClassPtr<UObject> NotifyClass, struct TArray<float>& StartTimes, struct TArray<float>& Durations); // Function Engine.AnimSequenceBase.GetStateNotifiesByType // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c4e3a0
	struct UAnimNotifyState* GetNotifyStateByType(struct TSoftClassPtr<UObject> NotifyClass, float& StartTime, float& Duration); // Function Engine.AnimSequenceBase.GetNotifyStateByType // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c4ea80
	struct UAnimNotify* GetNotifyByType(struct TSoftClassPtr<UObject> NotifyClass, float& StartTime); // Function Engine.AnimSequenceBase.GetNotifyByType // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c4eda0
	struct TArray<struct UAnimNotify*> GetNotifiesByType(struct TSoftClassPtr<UObject> NotifyClass, struct TArray<float>& StartTimes); // Function Engine.AnimSequenceBase.GetNotifiesByType // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c4e780
};

// Class Engine.RawAnimSequenceTrackExtensions
// Size: 0x30 (Inherited: 0x30)
struct URawAnimSequenceTrackExtensions : UBlueprintFunctionLibrary {

	struct TArray<struct FVector> GetScaleKeys(struct FRawAnimSequenceTrack& Track); // Function Engine.RawAnimSequenceTrackExtensions.GetScaleKeys // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x3c512b0
	struct TArray<struct FQuat> GetRotationalKeys(struct FRawAnimSequenceTrack& Track); // Function Engine.RawAnimSequenceTrackExtensions.GetRotationalKeys // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x3c51590
	struct TArray<struct FVector> GetPositionalKeys(struct FRawAnimSequenceTrack& Track); // Function Engine.RawAnimSequenceTrackExtensions.GetPositionalKeys // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x3c518a0
};

// Class Engine.AresProceduralTexture
// Size: 0x30 (Inherited: 0x30)
struct UAresProceduralTexture : UObject {
};

// Class Engine.AssetExportTask
// Size: 0x80 (Inherited: 0x30)
struct UAssetExportTask : UObject {
	struct UObject* Object; // 0x30(0x08)
	struct UExporter* Exporter; // 0x38(0x08)
	struct FString Filename; // 0x40(0x10)
	bool bSelected; // 0x50(0x01)
	bool bReplaceIdentical; // 0x51(0x01)
	bool bPrompt; // 0x52(0x01)
	bool bAutomated; // 0x53(0x01)
	bool bUseFileArchive; // 0x54(0x01)
	bool bWriteEmptyFiles; // 0x55(0x01)
	char pad_56[0x2]; // 0x56(0x02)
	struct TArray<struct UObject*> IgnoreObjectList; // 0x58(0x10)
	struct UObject* OPTIONS; // 0x68(0x08)
	struct TArray<struct FString> Errors; // 0x70(0x10)
};

// Class Engine.AssetManagerSettings
// Size: 0x110 (Inherited: 0x48)
struct UAssetManagerSettings : UDeveloperSettings {
	struct TArray<struct FPrimaryAssetTypeInfo> PrimaryAssetTypesToScan; // 0x48(0x10)
	struct TArray<struct FDirectoryPath> DirectoriesToExclude; // 0x58(0x10)
	struct TArray<struct FPrimaryAssetRulesOverride> PrimaryAssetRules; // 0x68(0x10)
	struct TArray<struct FPrimaryAssetRulesCustomOverride> CustomPrimaryAssetRules; // 0x78(0x10)
	bool bOnlyCookProductionAssets; // 0x88(0x01)
	bool bShouldManagerDetermineTypeAndName; // 0x89(0x01)
	bool bShouldGuessTypeAndNameInEditor; // 0x8a(0x01)
	bool bShouldAcquireMissingChunksOnLoad; // 0x8b(0x01)
	bool bShouldWarnAboutInvalidAssets; // 0x8c(0x01)
	char pad_8D[0x3]; // 0x8d(0x03)
	struct TArray<struct FAssetManagerRedirect> PrimaryAssetIdRedirects; // 0x90(0x10)
	struct TArray<struct FAssetManagerRedirect> PrimaryAssetTypeRedirects; // 0xa0(0x10)
	struct TArray<struct FAssetManagerRedirect> AssetPathRedirects; // 0xb0(0x10)
	struct TSet<struct FName> MetaDataTagsForAssetRegistry; // 0xc0(0x50)
};

// Class Engine.AsyncPhysicsData
// Size: 0x38 (Inherited: 0x30)
struct UAsyncPhysicsData : UObject {
	int32_t ServerFrame; // 0x30(0x04)
	int32_t ReplicationRedundancy; // 0x34(0x04)
};

// Class Engine.AudioPanelWidgetInterface
// Size: 0x30 (Inherited: 0x30)
struct UAudioPanelWidgetInterface : UInterface {

	struct FName GetIconBrushName(); // Function Engine.AudioPanelWidgetInterface.GetIconBrushName // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
	struct FText GetEditorName(); // Function Engine.AudioPanelWidgetInterface.GetEditorName // (RequiredAPI|Event|Public|BlueprintEvent) // @ game+0x1b42740
};

// Class Engine.BlendableInterface
// Size: 0x30 (Inherited: 0x30)
struct UBlendableInterface : UInterface {
};

// Class Engine.AnalysisProperties
// Size: 0x40 (Inherited: 0x30)
struct UAnalysisProperties : UObject {
	struct FString Function; // 0x30(0x10)
};

// Class Engine.BlendSpace
// Size: 0x1d0 (Inherited: 0x90)
struct UBlendSpace : UAnimationAsset {
	char pad_90[0x8]; // 0x90(0x08)
	bool bContainsRotationOffsetMeshSpaceSamples; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	struct FInterpolationParameter InterpolationParam[0x3]; // 0x9c(0x30)
	float TargetWeightInterpolationSpeedPerSec; // 0xcc(0x04)
	bool bTargetWeightInterpolationEaseInOut; // 0xd0(0x01)
	bool bAllowMeshSpaceBlending; // 0xd1(0x01)
	bool bLoop; // 0xd2(0x01)
	char pad_D3[0x1]; // 0xd3(0x01)
	float AnimLength; // 0xd4(0x04)
	enum class ENotifyTriggerMode NotifyTriggerMode; // 0xd8(0x01)
	bool bInterpolateUsingGrid; // 0xd9(0x01)
	enum class EPreferredTriangulationDirection PreferredTriangulationDirection; // 0xda(0x01)
	enum class EBlendSpacePerBoneBlendMode PerBoneBlendMode; // 0xdb(0x01)
	char pad_DC[0x4]; // 0xdc(0x04)
	struct TArray<struct FPerBoneInterpolation> ManualPerBoneOverrides; // 0xe0(0x10)
	struct FBlendSpaceBlendProfile PerBoneBlendProfile; // 0xf0(0x10)
	char pad_100[0x10]; // 0x100(0x10)
	int32_t SampleIndexWithMarkers; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)
	struct TArray<struct FBlendSample> SampleData; // 0x118(0x10)
	struct TArray<struct FEditorElement> GridSamples; // 0x128(0x10)
	struct FBlendSpaceData BlendSpaceData; // 0x138(0x20)
	struct FBlendParameter BlendParameters[0x3]; // 0x158(0x60)
	enum class EBlendSpaceAxis AxisToScaleAnimation; // 0x1b8(0x01)
	char pad_1B9[0x7]; // 0x1b9(0x07)
	struct TArray<int32_t> DimensionIndices; // 0x1c0(0x10)
};

// Class Engine.Breakpoint
// Size: 0x30 (Inherited: 0x30)
struct UBreakpoint : UObject {
};

// Class Engine.BlueprintExtension
// Size: 0x30 (Inherited: 0x30)
struct UBlueprintExtension : UObject {
};

// Class Engine.BookmarkBase
// Size: 0x30 (Inherited: 0x30)
struct UBookmarkBase : UObject {
};

// Class Engine.BookMark2D
// Size: 0x40 (Inherited: 0x30)
struct UBookMark2D : UBookmarkBase {
	float Zoom2D; // 0x30(0x04)
	struct FIntPoint Location; // 0x34(0x08)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class Engine.ReflectionCapture
// Size: 0x468 (Inherited: 0x460)
struct AReflectionCapture : AActor {
	struct UReflectionCaptureComponent* CaptureComponent; // 0x460(0x08)
};

// Class Engine.BoxReflectionCapture
// Size: 0x468 (Inherited: 0x468)
struct ABoxReflectionCapture : AReflectionCapture {
};

// Class Engine.ReflectionCaptureComponent
// Size: 0x3c0 (Inherited: 0x330)
struct UReflectionCaptureComponent : USceneComponent {
	struct UBillboardComponent* CaptureOffsetComponent; // 0x330(0x08)
	enum class EReflectionSourceType ReflectionSourceType; // 0x338(0x01)
	char pad_339[0x7]; // 0x339(0x07)
	struct UTextureCube* Cubemap; // 0x340(0x08)
	float SourceCubemapAngle; // 0x348(0x04)
	float Brightness; // 0x34c(0x04)
	struct FVector CaptureOffset; // 0x350(0x18)
	struct FGuid MapBuildDataId; // 0x368(0x10)
	char pad_378[0x48]; // 0x378(0x48)
};

// Class Engine.BoxReflectionCaptureComponent
// Size: 0x3d0 (Inherited: 0x3c0)
struct UBoxReflectionCaptureComponent : UReflectionCaptureComponent {
	float BoxTransitionDistance; // 0x3b8(0x04)
	struct UBoxComponent* PreviewInfluenceBox; // 0x3c0(0x08)
	struct UBoxComponent* PreviewCaptureBox; // 0x3c8(0x08)
};

// Class Engine.BuiltInAttributesExtensions
// Size: 0x30 (Inherited: 0x30)
struct UBuiltInAttributesExtensions : UBlueprintFunctionLibrary {
};

// Class Engine.ChaosBlueprintLibrary
// Size: 0x30 (Inherited: 0x30)
struct UChaosBlueprintLibrary : UBlueprintFunctionLibrary {

	struct UChaosEventRelay* GetEventRelayFromContext(struct UObject* ContextObject); // Function Engine.ChaosBlueprintLibrary.GetEventRelayFromContext // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3c5def0
};

// Class Engine.ChaosEventRelay
// Size: 0x70 (Inherited: 0x30)
struct UChaosEventRelay : UObject {
	struct FMulticastInlineDelegate OnCollisionEvent; // 0x30(0x10)
	struct FMulticastInlineDelegate OnBreakEvent; // 0x40(0x10)
	struct FMulticastInlineDelegate OnRemovalEvent; // 0x50(0x10)
	struct FMulticastInlineDelegate OnCrumblingEvent; // 0x60(0x10)
};

// Class Engine.ShapeComponent
// Size: 0x6b0 (Inherited: 0x690)
struct UShapeComponent : UPrimitiveComponent {
	struct UBodySetup* ShapeBodySetup; // 0x690(0x08)
	struct FColor ShapeColor; // 0x698(0x04)
	char bDrawOnlyIfSelected : 1; // 0x69c(0x01)
	char bShouldCollideWhenPlacing : 1; // 0x69c(0x01)
	char bDynamicObstacle : 1; // 0x69c(0x01)
	char pad_69C_3 : 5; // 0x69c(0x01)
	bool bAimingShape; // 0x69d(0x01)
	bool bAddToVisibleBounds; // 0x69e(0x01)
	char pad_69F[0x1]; // 0x69f(0x01)
	struct UNavAreaBase* AreaClassOverride; // 0x6a0(0x08)
	char bUseSystemDefaultObstacleAreaClass : 1; // 0x6a8(0x01)
	char pad_6A8_1 : 7; // 0x6a8(0x01)
	char pad_6A9[0x7]; // 0x6a9(0x07)
};

// Class Engine.CapsuleComponent
// Size: 0x6c0 (Inherited: 0x6b0)
struct UCapsuleComponent : UShapeComponent {
	float CapsuleHalfHeight; // 0x6b0(0x04)
	float CapsuleRadius; // 0x6b4(0x04)
	char pad_6B8[0x8]; // 0x6b8(0x08)

	void SetCapsuleSize(float InRadius, float InHalfHeight, bool bUpdateOverlaps); // Function Engine.CapsuleComponent.SetCapsuleSize // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3ff9f80
	void SetCapsuleRadius(float Radius, bool bUpdateOverlaps); // Function Engine.CapsuleComponent.SetCapsuleRadius // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3ff9de0
	void SetCapsuleHalfHeight(float HalfHeight, bool bUpdateOverlaps); // Function Engine.CapsuleComponent.SetCapsuleHalfHeight // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3ff9c40
	void GetUnscaledCapsuleSize_WithoutHemisphere(float& OutRadius, float& OutHalfHeightWithoutHemisphere); // Function Engine.CapsuleComponent.GetUnscaledCapsuleSize_WithoutHemisphere // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ff93b0
	void GetUnscaledCapsuleSize(float& OutRadius, float& OutHalfHeight); // Function Engine.CapsuleComponent.GetUnscaledCapsuleSize // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ff9560
	float GetUnscaledCapsuleRadius(); // Function Engine.CapsuleComponent.GetUnscaledCapsuleRadius // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ff9750
	float GetUnscaledCapsuleHalfHeight_WithoutHemisphere(); // Function Engine.CapsuleComponent.GetUnscaledCapsuleHalfHeight_WithoutHemisphere // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ff9700
	float GetUnscaledCapsuleHalfHeight(); // Function Engine.CapsuleComponent.GetUnscaledCapsuleHalfHeight // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ff9730
	float GetShapeScale(); // Function Engine.CapsuleComponent.GetShapeScale // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ff9330
	void GetScaledCapsuleSize_WithoutHemisphere(float& OutRadius, float& OutHalfHeightWithoutHemisphere); // Function Engine.CapsuleComponent.GetScaledCapsuleSize_WithoutHemisphere // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ff9770
	void GetScaledCapsuleSize(float& OutRadius, float& OutHalfHeight); // Function Engine.CapsuleComponent.GetScaledCapsuleSize // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ff9970
	float GetScaledCapsuleRadius(); // Function Engine.CapsuleComponent.GetScaledCapsuleRadius // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ff9bf0
	float GetScaledCapsuleHalfHeight_WithoutHemisphere(); // Function Engine.CapsuleComponent.GetScaledCapsuleHalfHeight_WithoutHemisphere // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ff9b50
	float GetScaledCapsuleHalfHeight(); // Function Engine.CapsuleComponent.GetScaledCapsuleHalfHeight // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ff9bb0
};

// Class Engine.CharacterCapsuleComponent
// Size: 0x6c0 (Inherited: 0x6c0)
struct UCharacterCapsuleComponent : UCapsuleComponent {
};

// Class Engine.Player
// Size: 0x50 (Inherited: 0x30)
struct UPlayer : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct APlayerController* PlayerController; // 0x38(0x08)
	int32_t CurrentNetSpeed; // 0x40(0x04)
	int32_t ConfiguredInternetSpeed; // 0x44(0x04)
	int32_t ConfiguredLanSpeed; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Engine.NetConnection
// Size: 0x1e60 (Inherited: 0x50)
struct UNetConnection : UPlayer {
	struct TArray<struct UChildConnection*> Children; // 0x50(0x10)
	struct UNetDriver* Driver; // 0x60(0x08)
	struct UPackageMap* PackageMapClass; // 0x68(0x08)
	struct UPackageMap* PackageMap; // 0x70(0x08)
	struct TArray<struct UChannel*> OpenChannels; // 0x78(0x10)
	struct TArray<struct AActor*> SentTemporaries; // 0x88(0x10)
	struct AActor* ViewTarget; // 0x98(0x08)
	struct AActor* OwningActor; // 0xa0(0x08)
	int32_t MaxPacket; // 0xa8(0x04)
	char InternalAck : 1; // 0xac(0x01)
	char pad_AC_1 : 7; // 0xac(0x01)
	char pad_AD[0xbb]; // 0xad(0xbb)
	struct FUniqueNetIdRepl PlayerID; // 0x168(0x30)
	char pad_198[0x48]; // 0x198(0x48)
	double LastReceiveTime; // 0x1e0(0x08)
	char pad_1E8[0x1204]; // 0x1e8(0x1204)
	int32_t DefaultMaxChannelSize; // 0x13ec(0x04)
	char pad_13F0[0x348]; // 0x13f0(0x348)
	struct TArray<struct UChannel*> ChannelsToTick; // 0x1738(0x10)
	char pad_1748[0x718]; // 0x1748(0x718)
};

// Class Engine.ChildConnection
// Size: 0x1e68 (Inherited: 0x1e60)
struct UChildConnection : UNetConnection {
	struct UNetConnection* Parent; // 0x1e60(0x08)
};

// Class Engine.PlatformInterfaceBase
// Size: 0x40 (Inherited: 0x30)
struct UPlatformInterfaceBase : UObject {
	struct TArray<struct FDelegateArray> AllDelegates; // 0x30(0x10)
};

// Class Engine.CloudStorageBase
// Size: 0x58 (Inherited: 0x40)
struct UCloudStorageBase : UPlatformInterfaceBase {
	struct TArray<struct FString> LocalCloudFiles; // 0x40(0x10)
	char bSuppressDelegateCalls : 1; // 0x50(0x01)
	char pad_50_1 : 7; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// Class Engine.ContentBundleTypeFactory
// Size: 0x30 (Inherited: 0x30)
struct UContentBundleTypeFactory : UObject {
};

// Class Engine.ControlChannel
// Size: 0x90 (Inherited: 0x78)
struct UControlChannel : UChannel {
	char pad_78[0x18]; // 0x78(0x18)
};

// Class Engine.WorldPartition
// Size: 0x100 (Inherited: 0x30)
struct UWorldPartition : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct UActorDescContainer* ActorDescContainer; // 0x38(0x08)
	struct UWorldPartitionRuntimeHash* RuntimeHash; // 0x40(0x08)
	bool bEnableStreaming; // 0x48(0x01)
	enum class EWorldPartitionServerStreamingMode ServerStreamingMode; // 0x49(0x01)
	enum class EWorldPartitionServerStreamingOutMode ServerStreamingOutMode; // 0x4a(0x01)
	char pad_4B[0x95]; // 0x4b(0x95)
	struct UDataLayerManager* DataLayerManager; // 0xe0(0x08)
	struct UWorldPartitionStreamingPolicy* StreamingPolicy; // 0xe8(0x08)
	char pad_F0[0x10]; // 0xf0(0x10)
};

// Class Engine.DataLayerManager
// Size: 0xe0 (Inherited: 0x30)
struct UDataLayerManager : UObject {
	struct FMulticastInlineDelegate OnDataLayerInstanceRuntimeStateChanged; // 0x30(0x10)
	struct TSet<struct UObject*> ReferencedObjects; // 0x40(0x50)
	char pad_90[0x50]; // 0x90(0x50)

	bool SetDataLayerRuntimeState(struct UDataLayerAsset* InDataLayerAsset, enum class EDataLayerRuntimeState InState, bool bInIsRecursive); // Function Engine.DataLayerManager.SetDataLayerRuntimeState // (Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3c61260
	bool SetDataLayerInstanceRuntimeState(struct UDataLayerInstance* InDataLayerInstance, enum class EDataLayerRuntimeState InState, bool bInIsRecursive); // Function Engine.DataLayerManager.SetDataLayerInstanceRuntimeState // (Final|RequiredAPI|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3c61970
	enum class EDataLayerRuntimeState GetDataLayerInstanceRuntimeState(struct UDataLayerInstance* InDataLayerInstance); // Function Engine.DataLayerManager.GetDataLayerInstanceRuntimeState // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c61140
	struct UDataLayerInstance* GetDataLayerInstanceFromName(struct FName& InDataLayerInstanceName); // Function Engine.DataLayerManager.GetDataLayerInstanceFromName // (Final|RequiredAPI|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c61f90
	struct UDataLayerInstance* GetDataLayerInstanceFromAsset(struct UDataLayerAsset* InDataLayerAsset); // Function Engine.DataLayerManager.GetDataLayerInstanceFromAsset // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c620c0
	enum class EDataLayerRuntimeState GetDataLayerInstanceEffectiveRuntimeState(struct UDataLayerInstance* InDataLayerInstance); // Function Engine.DataLayerManager.GetDataLayerInstanceEffectiveRuntimeState // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c60fe0
};

// Class Engine.DebugGarbageCollectionGraph
// Size: 0x50 (Inherited: 0x30)
struct UDebugGarbageCollectionGraph : UObject {
	char pad_30[0x20]; // 0x30(0x20)
};

// Class Engine.DemoNetConnection
// Size: 0x1eb0 (Inherited: 0x1e60)
struct UDemoNetConnection : UNetConnection {
	char pad_1E60[0x50]; // 0x1e60(0x50)
};

// Class Engine.PendingNetGame
// Size: 0xc8 (Inherited: 0x30)
struct UPendingNetGame : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct UNetDriver* NetDriver; // 0x38(0x08)
	struct UDemoNetDriver* DemoNetDriver; // 0x40(0x08)
	char pad_48[0x80]; // 0x48(0x80)
};

// Class Engine.DemoPendingNetGame
// Size: 0xc8 (Inherited: 0xc8)
struct UDemoPendingNetGame : UPendingNetGame {
};

// Class Engine.DeviceProfileFragment
// Size: 0x40 (Inherited: 0x30)
struct UDeviceProfileFragment : UObject {
	struct TArray<struct FString> CVars; // 0x30(0x10)
};

// Class Engine.DialogueSoundWaveProxy
// Size: 0x188 (Inherited: 0x170)
struct UDialogueSoundWaveProxy : USoundBase {
	char pad_170[0x18]; // 0x170(0x18)
};

// Class Engine.Light
// Size: 0x470 (Inherited: 0x460)
struct ALight : AActor {
	struct ULightComponent* LightComponent; // 0x460(0x08)
	char bEnabled : 1; // 0x468(0x01)
	char pad_468_1 : 7; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)

	void ToggleEnabled(); // Function Engine.Light.ToggleEnabled // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x44ff610
	void SetLightFunctionScale(struct FVector NewLightFunctionScale); // Function Engine.Light.SetLightFunctionScale // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x44ff060
	void SetLightFunctionMaterial(struct UMaterialInterface* NewLightFunctionMaterial); // Function Engine.Light.SetLightFunctionMaterial // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x44ff1c0
	void SetLightFunctionFadeDistance(float NewLightFunctionFadeDistance); // Function Engine.Light.SetLightFunctionFadeDistance // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x44fef30
	void SetLightColor(struct FLinearColor NewLightColor); // Function Engine.Light.SetLightColor // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x44ff3a0
	void SetEnabled(bool bSetEnabled); // Function Engine.Light.SetEnabled // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x44ff690
	void SetCastShadows(bool bNewValue); // Function Engine.Light.SetCastShadows // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x44fede0
	void SetBrightness(float NewBrightness); // Function Engine.Light.SetBrightness // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x44ff4e0
	void SetAffectTranslucentLighting(bool bNewValue); // Function Engine.Light.SetAffectTranslucentLighting // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x44fec90
	void OnRep_bEnabled(); // Function Engine.Light.OnRep_bEnabled // (RequiredAPI|Native|Public) // @ game+0x3c7de60
	bool IsEnabled(); // Function Engine.Light.IsEnabled // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x44ff650
	struct FLinearColor GetLightColor(); // Function Engine.Light.GetLightColor // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x44ff2f0
	float GetBrightness(); // Function Engine.Light.GetBrightness // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x44ff4a0
};

// Class Engine.DirectionalLight
// Size: 0x470 (Inherited: 0x470)
struct ADirectionalLight : ALight {
};

// Class Engine.Distribution
// Size: 0x38 (Inherited: 0x30)
struct UDistribution : UObject {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Engine.DistributionFloat
// Size: 0x40 (Inherited: 0x38)
struct UDistributionFloat : UDistribution {
	char bCanBeBaked : 1; // 0x38(0x01)
	char pad_38_1 : 1; // 0x38(0x01)
	char bBakedDataSuccesfully : 1; // 0x38(0x01)
	char pad_38_3 : 5; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Engine.DistributionFloatConstant
// Size: 0x48 (Inherited: 0x40)
struct UDistributionFloatConstant : UDistributionFloat {
	float Constant; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.DistributionFloatConstantCurve
// Size: 0x58 (Inherited: 0x40)
struct UDistributionFloatConstantCurve : UDistributionFloat {
	struct FInterpCurveFloat ConstantCurve; // 0x40(0x18)
};

// Class Engine.DistributionFloatParameterBase
// Size: 0x68 (Inherited: 0x48)
struct UDistributionFloatParameterBase : UDistributionFloatConstant {
	struct FName ParameterName; // 0x48(0x0c)
	float MinInput; // 0x54(0x04)
	float MaxInput; // 0x58(0x04)
	float MinOutput; // 0x5c(0x04)
	float MaxOutput; // 0x60(0x04)
	enum class DistributionParamMode ParamMode; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
};

// Class Engine.DistributionFloatParticleParameter
// Size: 0x68 (Inherited: 0x68)
struct UDistributionFloatParticleParameter : UDistributionFloatParameterBase {
};

// Class Engine.DistributionFloatUniform
// Size: 0x48 (Inherited: 0x40)
struct UDistributionFloatUniform : UDistributionFloat {
	float Min; // 0x40(0x04)
	float Max; // 0x44(0x04)
};

// Class Engine.DistributionFloatUniformCurve
// Size: 0x58 (Inherited: 0x40)
struct UDistributionFloatUniformCurve : UDistributionFloat {
	struct FInterpCurveVector2D ConstantCurve; // 0x40(0x18)
};

// Class Engine.DistributionVector
// Size: 0x40 (Inherited: 0x38)
struct UDistributionVector : UDistribution {
	char bCanBeBaked : 1; // 0x38(0x01)
	char bIsDirty : 1; // 0x38(0x01)
	char bBakedDataSuccesfully : 1; // 0x38(0x01)
	char pad_38_3 : 5; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Engine.DistributionVectorConstant
// Size: 0x60 (Inherited: 0x40)
struct UDistributionVectorConstant : UDistributionVector {
	struct FVector Constant; // 0x40(0x18)
	char bLockAxes : 1; // 0x58(0x01)
	char pad_58_1 : 7; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	enum class EDistributionVectorLockFlags LockedAxes; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
};

// Class Engine.DistributionVectorConstantCurve
// Size: 0x60 (Inherited: 0x40)
struct UDistributionVectorConstantCurve : UDistributionVector {
	struct FInterpCurveVector ConstantCurve; // 0x40(0x18)
	char bLockAxes : 1; // 0x58(0x01)
	char pad_58_1 : 7; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	enum class EDistributionVectorLockFlags LockedAxes; // 0x5c(0x01)
	char pad_5D[0x3]; // 0x5d(0x03)
};

// Class Engine.DistributionVectorParameterBase
// Size: 0xd8 (Inherited: 0x60)
struct UDistributionVectorParameterBase : UDistributionVectorConstant {
	struct FName ParameterName; // 0x60(0x0c)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct FVector MinInput; // 0x70(0x18)
	struct FVector MaxInput; // 0x88(0x18)
	struct FVector MinOutput; // 0xa0(0x18)
	struct FVector MaxOutput; // 0xb8(0x18)
	enum class DistributionParamMode ParamModes[0x3]; // 0xd0(0x03)
	char pad_D3[0x5]; // 0xd3(0x05)
};

// Class Engine.DistributionVectorParticleParameter
// Size: 0xd8 (Inherited: 0xd8)
struct UDistributionVectorParticleParameter : UDistributionVectorParameterBase {
};

// Class Engine.DistributionVectorUniform
// Size: 0x80 (Inherited: 0x40)
struct UDistributionVectorUniform : UDistributionVector {
	struct FVector Max; // 0x40(0x18)
	struct FVector Min; // 0x58(0x18)
	char bLockAxes : 1; // 0x70(0x01)
	char pad_70_1 : 7; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	enum class EDistributionVectorLockFlags LockedAxes; // 0x74(0x01)
	enum class EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x75(0x03)
	char bUseExtremes : 1; // 0x78(0x01)
	char pad_78_1 : 7; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class Engine.DistributionVectorUniformCurve
// Size: 0x68 (Inherited: 0x40)
struct UDistributionVectorUniformCurve : UDistributionVector {
	struct FInterpCurveTwoVectors ConstantCurve; // 0x40(0x18)
	char bLockAxes1 : 1; // 0x58(0x01)
	char bLockAxes2 : 1; // 0x58(0x01)
	char pad_58_2 : 6; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	enum class EDistributionVectorLockFlags LockedAxes[0x2]; // 0x5c(0x02)
	enum class EDistributionVectorMirrorFlags MirrorFlags[0x3]; // 0x5e(0x03)
	char pad_61[0x3]; // 0x61(0x03)
	char bUseExtremes : 1; // 0x64(0x01)
	char pad_64_1 : 7; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
};

// Class Engine.DynamicBlockingComponent
// Size: 0xe8 (Inherited: 0xd8)
struct UDynamicBlockingComponent : UActorComponent {
	struct TArray<struct TWeakObjectPtr<struct AActor>> ActiveDynamicBlockers; // 0xd8(0x10)

	struct TArray<struct AActor*> GetActiveDynamicBlockers(); // Function Engine.DynamicBlockingComponent.GetActiveDynamicBlockers // (Final|Native|Public|BlueprintCallable) // @ game+0x3c68d50
	void AuthRemoveDynamicBlocker(struct AActor* Blocker); // Function Engine.DynamicBlockingComponent.AuthRemoveDynamicBlocker // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x35441f0
	void AuthAddDynamicBlocker(struct AActor* Blocker, bool bCrushIfCurrentlyBlocking); // Function Engine.DynamicBlockingComponent.AuthAddDynamicBlocker // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3c68df0
};

// Class Engine.GraphNodeContextMenuContext
// Size: 0x58 (Inherited: 0x30)
struct UGraphNodeContextMenuContext : UObject {
	struct UBlueprint* Blueprint; // 0x30(0x08)
	struct UEdGraph* Graph; // 0x38(0x08)
	struct UEdGraphNode* Node; // 0x40(0x08)
	char pad_48[0x8]; // 0x48(0x08)
	bool bIsDebugging; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// Class Engine.EdGraphPin_Deprecated
// Size: 0x138 (Inherited: 0x30)
struct UEdGraphPin_Deprecated : UObject {
	struct FString PinName; // 0x30(0x10)
	struct FString PinToolTip; // 0x40(0x10)
	enum class EEdGraphPinDirection Direction; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct FEdGraphPinType PinType; // 0x58(0x70)
	struct FString DefaultValue; // 0xc8(0x10)
	struct FString AutogeneratedDefaultValue; // 0xd8(0x10)
	struct UObject* DefaultObject; // 0xe8(0x08)
	struct FText DefaultTextValue; // 0xf0(0x18)
	struct TArray<struct UEdGraphPin_Deprecated*> LinkedTo; // 0x108(0x10)
	struct TArray<struct UEdGraphPin_Deprecated*> SubPins; // 0x118(0x10)
	struct UEdGraphPin_Deprecated* ParentPin; // 0x128(0x08)
	struct UEdGraphPin_Deprecated* ReferencePassThroughConnection; // 0x130(0x08)
};

// Class Engine.EdGraphSchema
// Size: 0x30 (Inherited: 0x30)
struct UEdGraphSchema : UObject {
};

// Class Engine.Emitter
// Size: 0x4b0 (Inherited: 0x460)
struct AEmitter : AActor {
	struct UParticleSystemComponent* ParticleSystemComponent; // 0x460(0x08)
	char bDestroyOnSystemFinish : 1; // 0x468(0x01)
	char bPostUpdateTickGroup : 1; // 0x468(0x01)
	char bCurrentlyActive : 1; // 0x468(0x01)
	char pad_468_3 : 5; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)
	struct FMulticastInlineDelegate OnParticleSpawn; // 0x470(0x10)
	struct FMulticastInlineDelegate OnParticleBurst; // 0x480(0x10)
	struct FMulticastInlineDelegate OnParticleDeath; // 0x490(0x10)
	struct FMulticastInlineDelegate OnParticleCollide; // 0x4a0(0x10)

	void ToggleActive(); // Function Engine.Emitter.ToggleActive // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x463c630
	void SetVectorParameter(struct FName ParameterName, struct FVector Param); // Function Engine.Emitter.SetVectorParameter // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x463c120
	void SetTemplate(struct UParticleSystem* NewTemplate); // Function Engine.Emitter.SetTemplate // (RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x463c4f0
	void SetMaterialParameter(struct FName ParameterName, struct UMaterialInterface* Param); // Function Engine.Emitter.SetMaterialParameter // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x463bbb0
	void SetFloatParameter(struct FName ParameterName, float Param); // Function Engine.Emitter.SetFloatParameter // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x463c320
	void SetColorParameter(struct FName ParameterName, struct FLinearColor Param); // Function Engine.Emitter.SetColorParameter // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x463bf40
	void SetActorParameter(struct FName ParameterName, struct AActor* Param); // Function Engine.Emitter.SetActorParameter // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x463bd70
	void OnRep_bCurrentlyActive(); // Function Engine.Emitter.OnRep_bCurrentlyActive // (RequiredAPI|Native|Public) // @ game+0x3ceed10
	void OnParticleSystemFinished(struct UParticleSystemComponent* FinishedComponent); // Function Engine.Emitter.OnParticleSystemFinished // (RequiredAPI|Native|Public) // @ game+0x3d39f90
	bool IsActive(); // Function Engine.Emitter.IsActive // (Final|RequiredAPI|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x463c5f0
	void Deactivate(); // Function Engine.Emitter.Deactivate // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x463c6a0
	void Activate(); // Function Engine.Emitter.Activate // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x463c6e0
};

// Class Engine.EmitterCameraLensEffectBase
// Size: 0x550 (Inherited: 0x4b0)
struct AEmitterCameraLensEffectBase : AEmitter {
	char pad_4B0[0x8]; // 0x4b0(0x08)
	struct UParticleSystem* PS_CameraEffect; // 0x4b8(0x08)
	struct APlayerCameraManager* BaseCamera; // 0x4c0(0x08)
	char pad_4C8[0x8]; // 0x4c8(0x08)
	struct FTransform RelativeTransform; // 0x4d0(0x60)
	float BaseFOV; // 0x530(0x04)
	char bAllowMultipleInstances : 1; // 0x534(0x01)
	char bResetWhenRetriggered : 1; // 0x534(0x01)
	char pad_534_2 : 6; // 0x534(0x01)
	char pad_535[0x3]; // 0x535(0x03)
	struct TArray<struct AActor*> EmittersToTreatAsSame; // 0x538(0x10)
	float DistFromCamera; // 0x548(0x04)
	char pad_54C[0x4]; // 0x54c(0x04)
};

// Class Engine.Engine
// Size: 0x1260 (Inherited: 0x30)
struct UEngine : UObject {
	char pad_30[0x8]; // 0x30(0x08)
	struct UFont* TinyFont; // 0x38(0x08)
	struct FSoftObjectPath TinyFontName; // 0x40(0x28)
	struct UFont* SmallFont; // 0x68(0x08)
	struct FSoftObjectPath SmallFontName; // 0x70(0x28)
	struct UFont* MediumFont; // 0x98(0x08)
	struct FSoftObjectPath MediumFontName; // 0xa0(0x28)
	struct UFont* LargeFont; // 0xc8(0x08)
	struct FSoftObjectPath LargeFontName; // 0xd0(0x28)
	struct UFont* SubtitleFont; // 0xf8(0x08)
	struct FSoftObjectPath SubtitleFontName; // 0x100(0x28)
	struct TArray<struct UFont*> AdditionalFonts; // 0x128(0x10)
	struct TArray<struct FString> AdditionalFontNames; // 0x138(0x10)
	struct UConsole* ConsoleClass; // 0x148(0x08)
	struct FSoftClassPath ConsoleClassName; // 0x150(0x28)
	struct UGameViewportClient* GameViewportClientClass; // 0x178(0x08)
	struct FSoftClassPath GameViewportClientClassName; // 0x180(0x28)
	struct ULocalPlayer* LocalPlayerClass; // 0x1a8(0x08)
	struct FSoftClassPath LocalPlayerClassName; // 0x1b0(0x28)
	struct AWorldSettings* WorldSettingsClass; // 0x1d8(0x08)
	struct FSoftClassPath WorldSettingsClassName; // 0x1e0(0x28)
	struct FSoftClassPath NavigationSystemClassName; // 0x208(0x28)
	struct UNavigationSystemBase* NavigationSystemClass; // 0x230(0x08)
	struct FSoftClassPath NavigationSystemConfigClassName; // 0x238(0x28)
	struct UNavigationSystemConfig* NavigationSystemConfigClass; // 0x260(0x08)
	struct FSoftClassPath AvoidanceManagerClassName; // 0x268(0x28)
	struct UAvoidanceManager* AvoidanceManagerClass; // 0x290(0x08)
	struct FSoftClassPath AIControllerClassName; // 0x298(0x28)
	struct UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x2c0(0x08)
	struct FSoftClassPath PhysicsCollisionHandlerClassName; // 0x2c8(0x28)
	struct FSoftClassPath GameUserSettingsClassName; // 0x2f0(0x28)
	struct UGameUserSettings* GameUserSettingsClass; // 0x318(0x08)
	struct UGameUserSettings* GameUserSettings; // 0x320(0x08)
	struct ALevelScriptActor* LevelScriptActorClass; // 0x328(0x08)
	struct FSoftClassPath LevelScriptActorClassName; // 0x330(0x28)
	struct FSoftClassPath DefaultBlueprintBaseClassName; // 0x358(0x28)
	struct FSoftClassPath GameSingletonClassName; // 0x380(0x28)
	struct UObject* GameSingleton; // 0x3a8(0x08)
	struct FSoftClassPath AssetManagerClassName; // 0x3b0(0x28)
	struct UAssetManager* AssetManager; // 0x3d8(0x08)
	struct UTexture2D* DefaultTexture; // 0x3e0(0x08)
	struct FSoftObjectPath DefaultTextureName; // 0x3e8(0x28)
	struct UTexture* DefaultDiffuseTexture; // 0x410(0x08)
	struct FSoftObjectPath DefaultDiffuseTextureName; // 0x418(0x28)
	struct UTexture2D* DefaultBSPVertexTexture; // 0x440(0x08)
	struct FSoftObjectPath DefaultBSPVertexTextureName; // 0x448(0x28)
	struct UTexture2D* HighFrequencyNoiseTexture; // 0x470(0x08)
	struct FSoftObjectPath HighFrequencyNoiseTextureName; // 0x478(0x28)
	struct UTexture2D* DefaultBokehTexture; // 0x4a0(0x08)
	struct FSoftObjectPath DefaultBokehTextureName; // 0x4a8(0x28)
	struct UTexture2D* DefaultBloomKernelTexture; // 0x4d0(0x08)
	struct FSoftObjectPath DefaultBloomKernelTextureName; // 0x4d8(0x28)
	struct UTexture2D* DefaultFilmGrainTexture; // 0x500(0x08)
	struct FSoftObjectPath DefaultFilmGrainTextureName; // 0x508(0x28)
	struct UMaterial* WireframeMaterial; // 0x530(0x08)
	struct FString WireframeMaterialName; // 0x538(0x10)
	struct UMaterial* DebugMeshMaterial; // 0x548(0x08)
	struct FSoftObjectPath DebugMeshMaterialName; // 0x550(0x28)
	struct UMaterial* NaniteHiddenSectionMaterial; // 0x578(0x08)
	struct FString NaniteHiddenSectionMaterialName; // 0x580(0x10)
	struct UMaterial* EmissiveMeshMaterial; // 0x590(0x08)
	struct FSoftObjectPath EmissiveMeshMaterialName; // 0x598(0x28)
	struct UMaterial* LevelColorationLitMaterial; // 0x5c0(0x08)
	struct FString LevelColorationLitMaterialName; // 0x5c8(0x10)
	struct UMaterial* LevelColorationUnlitMaterial; // 0x5d8(0x08)
	struct FString LevelColorationUnlitMaterialName; // 0x5e0(0x10)
	struct UMaterial* LightingTexelDensityMaterial; // 0x5f0(0x08)
	struct FString LightingTexelDensityName; // 0x5f8(0x10)
	struct UMaterial* ShadedLevelColorationLitMaterial; // 0x608(0x08)
	struct FString ShadedLevelColorationLitMaterialName; // 0x610(0x10)
	struct UMaterial* ShadedLevelColorationUnlitMaterial; // 0x620(0x08)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x628(0x10)
	struct UMaterial* RemoveSurfaceMaterial; // 0x638(0x08)
	struct FSoftObjectPath RemoveSurfaceMaterialName; // 0x640(0x28)
	struct UMaterial* VertexColorMaterial; // 0x668(0x08)
	struct FString VertexColorMaterialName; // 0x670(0x10)
	struct UMaterial* VertexColorViewModeMaterial_ColorOnly; // 0x680(0x08)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0x688(0x10)
	struct UMaterial* VertexColorViewModeMaterial_AlphaAsColor; // 0x698(0x08)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x6a0(0x10)
	struct UMaterial* VertexColorViewModeMaterial_RedOnly; // 0x6b0(0x08)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0x6b8(0x10)
	struct UMaterial* VertexColorViewModeMaterial_GreenOnly; // 0x6c8(0x08)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0x6d0(0x10)
	struct UMaterial* VertexColorViewModeMaterial_BlueOnly; // 0x6e0(0x08)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0x6e8(0x10)
	struct FSoftObjectPath DebugEditorMaterialName; // 0x6f8(0x28)
	struct UMaterial* ConstraintLimitMaterial; // 0x720(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x728(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis; // 0x730(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x738(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis; // 0x740(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x748(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis; // 0x750(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic; // 0x758(0x08)
	struct UMaterial* InvalidLightmapSettingsMaterial; // 0x760(0x08)
	struct FSoftObjectPath InvalidLightmapSettingsMaterialName; // 0x768(0x28)
	struct UMaterial* PreviewShadowsIndicatorMaterial; // 0x790(0x08)
	struct FSoftObjectPath PreviewShadowsIndicatorMaterialName; // 0x798(0x28)
	struct UMaterial* ArrowMaterial; // 0x7c0(0x08)
	struct UMaterialInstanceDynamic* ArrowMaterialYellow; // 0x7c8(0x08)
	struct FSoftObjectPath ArrowMaterialName; // 0x7d0(0x28)
	struct FLinearColor LightingOnlyBrightness; // 0x7f8(0x10)
	struct TArray<struct FLinearColor> ShaderComplexityColors; // 0x808(0x10)
	struct TArray<struct FLinearColor> QuadComplexityColors; // 0x818(0x10)
	struct TArray<struct FLinearColor> LightComplexityColors; // 0x828(0x10)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors; // 0x838(0x10)
	struct TArray<struct FLinearColor> LODColorationColors; // 0x848(0x10)
	struct TArray<struct FLinearColor> HLODColorationColors; // 0x858(0x10)
	struct TArray<struct FLinearColor> StreamingAccuracyColors; // 0x868(0x10)
	struct FLinearColor GPUSkinCacheVisualizationExcludedColor; // 0x878(0x10)
	struct FLinearColor GPUSkinCacheVisualizationIncludedColor; // 0x888(0x10)
	struct FLinearColor GPUSkinCacheVisualizationRecomputeTangentsColor; // 0x898(0x10)
	float GPUSkinCacheVisualizationLowMemoryThresholdInMB; // 0x8a8(0x04)
	float GPUSkinCacheVisualizationHighMemoryThresholdInMB; // 0x8ac(0x04)
	struct FLinearColor GPUSkinCacheVisualizationLowMemoryColor; // 0x8b0(0x10)
	struct FLinearColor GPUSkinCacheVisualizationMidMemoryColor; // 0x8c0(0x10)
	struct FLinearColor GPUSkinCacheVisualizationHighMemoryColor; // 0x8d0(0x10)
	struct TArray<struct FLinearColor> GPUSkinCacheVisualizationRayTracingLODOffsetColors; // 0x8e0(0x10)
	float MaxPixelShaderAdditiveComplexityCount; // 0x8f0(0x04)
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x8f4(0x04)
	int32_t MaxDrawCallComplexityCount; // 0x8f8(0x04)
	float DebugViewModeSpecularScale; // 0x8fc(0x04)
	float MinLightMapDensity; // 0x900(0x04)
	float IdealLightMapDensity; // 0x904(0x04)
	float MaxLightMapDensity; // 0x908(0x04)
	char bRenderLightMapDensityGrayscale : 1; // 0x90c(0x01)
	char pad_90C_1 : 7; // 0x90c(0x01)
	char pad_90D[0x3]; // 0x90d(0x03)
	float RenderLightMapDensityGrayscaleScale; // 0x910(0x04)
	float RenderLightMapDensityColorScale; // 0x914(0x04)
	struct FLinearColor LightMapDensityVertexMappedColor; // 0x918(0x10)
	struct FLinearColor LightMapDensitySelectedColor; // 0x928(0x10)
	struct TArray<struct FStatColorMapping> StatColorMappings; // 0x938(0x10)
	struct UPhysicalMaterial* DefaultPhysMaterial; // 0x948(0x08)
	struct FSoftObjectPath DefaultPhysMaterialName; // 0x950(0x28)
	struct UPhysicalMaterial* DefaultDestructiblePhysMaterial; // 0x978(0x08)
	struct FSoftObjectPath DefaultDestructiblePhysMaterialName; // 0x980(0x28)
	struct TArray<struct FGameNameRedirect> ActiveGameNameRedirects; // 0x9a8(0x10)
	struct TArray<struct FClassRedirect> ActiveClassRedirects; // 0x9b8(0x10)
	struct TArray<struct FPluginRedirect> ActivePluginRedirects; // 0x9c8(0x10)
	struct TArray<struct FStructRedirect> ActiveStructRedirects; // 0x9d8(0x10)
	struct UTexture2D* PreIntegratedSkinBRDFTexture; // 0x9e8(0x08)
	struct FSoftObjectPath PreIntegratedSkinBRDFTextureName; // 0x9f0(0x28)
	struct UTexture2D* BlueNoiseScalarTexture; // 0xa18(0x08)
	struct UTexture2D* BlueNoiseVec2Texture; // 0xa20(0x08)
	struct FSoftObjectPath BlueNoiseScalarTextureName; // 0xa28(0x28)
	struct FSoftObjectPath BlueNoiseVec2TextureName; // 0xa50(0x28)
	struct UTexture2DArray* GlintTexture; // 0xa78(0x08)
	struct UTexture2DArray* GlintTexture2; // 0xa80(0x08)
	struct FSoftObjectPath GlintTextureName; // 0xa88(0x28)
	struct FSoftObjectPath GlintTexture2Name; // 0xab0(0x28)
	struct UVolumeTexture* SimpleVolumeTexture; // 0xad8(0x08)
	struct FSoftObjectPath SimpleVolumeTextureName; // 0xae0(0x28)
	struct UVolumeTexture* SimpleVolumeEnvTexture; // 0xb08(0x08)
	struct FSoftObjectPath SimpleVolumeEnvTextureName; // 0xb10(0x28)
	struct UTexture2D* MiniFontTexture; // 0xb38(0x08)
	struct FSoftObjectPath MiniFontTextureName; // 0xb40(0x28)
	struct UTexture* WeightMapPlaceholderTexture; // 0xb68(0x08)
	struct FSoftObjectPath WeightMapPlaceholderTextureName; // 0xb70(0x28)
	struct UTexture2D* LightMapDensityTexture; // 0xb98(0x08)
	struct FSoftObjectPath LightMapDensityTextureName; // 0xba0(0x28)
	char pad_BC8[0x8]; // 0xbc8(0x08)
	struct UGameViewportClient* GameViewport; // 0xbd0(0x08)
	struct TArray<struct FString> DeferredCommands; // 0xbd8(0x10)
	float NearClipPlane; // 0xbe8(0x04)
	char bSubtitlesEnabled : 1; // 0xbec(0x01)
	char bSubtitlesForcedOff : 1; // 0xbec(0x01)
	char pad_BEC_2 : 6; // 0xbec(0x01)
	char pad_BED[0x3]; // 0xbed(0x03)
	int32_t MaximumLoopIterationCount; // 0xbf0(0x04)
	char bCanBlueprintsTickByDefault : 1; // 0xbf4(0x01)
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0xbf4(0x01)
	char bAllowMultiThreadedAnimationUpdate : 1; // 0xbf4(0x01)
	char bEnableEditorPSysRealtimeLOD : 1; // 0xbf4(0x01)
	char pad_BF4_4 : 1; // 0xbf4(0x01)
	char bSmoothFrameRate : 1; // 0xbf4(0x01)
	char bUseFixedFrameRate : 1; // 0xbf4(0x01)
	char pad_BF4_7 : 1; // 0xbf4(0x01)
	char pad_BF5[0x3]; // 0xbf5(0x03)
	float FixedFrameRate; // 0xbf8(0x04)
	struct FFloatRange SmoothedFrameRateRange; // 0xbfc(0x10)
	char pad_C0C[0x4]; // 0xc0c(0x04)
	struct UEngineCustomTimeStep* CustomTimeStep; // 0xc10(0x08)
	char pad_C18[0x20]; // 0xc18(0x20)
	struct FSoftClassPath CustomTimeStepClassName; // 0xc38(0x28)
	struct UTimecodeProvider* TimecodeProvider; // 0xc60(0x08)
	char pad_C68[0x20]; // 0xc68(0x20)
	struct FSoftClassPath TimecodeProviderClassName; // 0xc88(0x28)
	bool bGenerateDefaultTimecode; // 0xcb0(0x01)
	char pad_CB1[0x3]; // 0xcb1(0x03)
	struct FFrameRate GenerateDefaultTimecodeFrameRate; // 0xcb4(0x08)
	float GenerateDefaultTimecodeFrameDelay; // 0xcbc(0x04)
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0xcc0(0x01)
	char pad_CC0_1 : 7; // 0xcc0(0x01)
	char pad_CC1[0x3]; // 0xcc1(0x03)
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0xcc4(0x04)
	char bShouldGenerateLowQualityLightmaps : 1; // 0xcc8(0x01)
	char pad_CC8_1 : 7; // 0xcc8(0x01)
	char pad_CC9[0x3]; // 0xcc9(0x03)
	struct FColor C_WorldBox; // 0xccc(0x04)
	struct FColor C_BrushWire; // 0xcd0(0x04)
	struct FColor C_AddWire; // 0xcd4(0x04)
	struct FColor C_SubtractWire; // 0xcd8(0x04)
	struct FColor C_SemiSolidWire; // 0xcdc(0x04)
	struct FColor C_NonSolidWire; // 0xce0(0x04)
	struct FColor C_WireBackground; // 0xce4(0x04)
	struct FColor C_ScaleBoxHi; // 0xce8(0x04)
	struct FColor C_VolumeCollision; // 0xcec(0x04)
	struct FColor C_BSPCollision; // 0xcf0(0x04)
	struct FColor C_OrthoBackground; // 0xcf4(0x04)
	struct FColor C_Volume; // 0xcf8(0x04)
	struct FColor C_BrushShape; // 0xcfc(0x04)
	char pad_D00[0x8]; // 0xd00(0x08)
	struct FDirectoryPath GameScreenshotSaveDirectory; // 0xd08(0x10)
	bool UseStaticMeshMinLODPerQualityLevels; // 0xd18(0x01)
	bool UseSkeletalMeshMinLODPerQualityLevels; // 0xd19(0x01)
	bool UseGrassVarityPerQualityLevels; // 0xd1a(0x01)
	enum class ETransitionType TransitionType; // 0xd1b(0x01)
	char pad_D1C[0x4]; // 0xd1c(0x04)
	struct FString TransitionDescription; // 0xd20(0x10)
	struct FString TransitionGameMode; // 0xd30(0x10)
	char bAllowMatureLanguage : 1; // 0xd40(0x01)
	char pad_D40_1 : 7; // 0xd40(0x01)
	char pad_D41[0x3]; // 0xd41(0x03)
	float CameraRotationThreshold; // 0xd44(0x04)
	float CameraTranslationThreshold; // 0xd48(0x04)
	float PrimitiveProbablyVisibleTime; // 0xd4c(0x04)
	float MaxOcclusionPixelsFraction; // 0xd50(0x04)
	char bPauseOnLossOfFocus : 1; // 0xd54(0x01)
	char pad_D54_1 : 7; // 0xd54(0x01)
	char pad_D55[0x3]; // 0xd55(0x03)
	int32_t MaxParticleResize; // 0xd58(0x04)
	int32_t MaxParticleResizeWarn; // 0xd5c(0x04)
	struct TArray<struct FDropNoteInfo> PendingDroppedNotes; // 0xd60(0x10)
	float NetClientTicksPerSecond; // 0xd70(0x04)
	float DisplayGamma; // 0xd74(0x04)
	float MinDesiredFrameRate; // 0xd78(0x04)
	struct FLinearColor DefaultSelectedMaterialColor; // 0xd7c(0x10)
	struct FLinearColor SelectedMaterialColor; // 0xd8c(0x10)
	struct FLinearColor SelectionOutlineColor; // 0xd9c(0x10)
	struct FLinearColor SubduedSelectionOutlineColor; // 0xdac(0x10)
	struct FLinearColor SelectedMaterialColorOverride; // 0xdbc(0x10)
	bool bIsOverridingSelectedColor; // 0xdcc(0x01)
	char pad_DCD[0x3]; // 0xdcd(0x03)
	char bEnableOnScreenDebugMessages : 1; // 0xdd0(0x01)
	char bEnableOnScreenDebugMessagesDisplay : 1; // 0xdd0(0x01)
	char bSuppressMapWarnings : 1; // 0xdd0(0x01)
	char bDisableAILogging : 1; // 0xdd0(0x01)
	char pad_DD0_4 : 4; // 0xdd0(0x01)
	char pad_DD1[0x3]; // 0xdd1(0x03)
	uint32_t bEnableVisualLogRecordingOnStart; // 0xdd4(0x04)
	int32_t ScreenSaverInhibitorSemaphore; // 0xdd8(0x04)
	char bLockReadOnlyLevels : 1; // 0xddc(0x01)
	char pad_DDC_1 : 7; // 0xddc(0x01)
	char pad_DDD[0x3]; // 0xddd(0x03)
	struct FString ParticleEventManagerClassPath; // 0xde0(0x10)
	float SelectionHighlightIntensity; // 0xdf0(0x04)
	float BSPSelectionHighlightIntensity; // 0xdf4(0x04)
	float SelectionHighlightIntensityBillboards; // 0xdf8(0x04)
	char pad_DFC[0x2ac]; // 0xdfc(0x2ac)
	uint32_t GlobalNetTravelCount; // 0x10a8(0x04)
	char pad_10AC[0x4]; // 0x10ac(0x04)
	struct TArray<struct FNetDriverDefinition> NetDriverDefinitions; // 0x10b0(0x10)
	struct TArray<struct FIrisNetDriverConfig> IrisNetDriverConfigs; // 0x10c0(0x10)
	struct TArray<struct FString> ServerActors; // 0x10d0(0x10)
	struct TArray<struct FString> RuntimeServerActors; // 0x10e0(0x10)
	float NetErrorLogInterval; // 0x10f0(0x04)
	char bStartedLoadMapMovie : 1; // 0x10f4(0x01)
	char pad_10F4_1 : 7; // 0x10f4(0x01)
	char pad_10F5[0x3b]; // 0x10f5(0x3b)
	int32_t NextWorldContextHandle; // 0x1130(0x04)
	char pad_1134[0xc4]; // 0x1134(0xc4)
	struct FRiotPlatformInitSettings RiotPlatformInitSettings; // 0x11f8(0x48)
	char pad_1240[0x20]; // 0x1240(0x20)

	bool IsAresProfileGPUReady(); // Function Engine.Engine.IsAresProfileGPUReady // (Final|RequiredAPI|Native|Static|Public) // @ game+0x3c6df80
	void AresProfileGPU(); // Function Engine.Engine.AresProfileGPU // (Final|RequiredAPI|Native|Static|Public) // @ game+0x39f7660
};

// Class Engine.ViewModeUtils
// Size: 0x30 (Inherited: 0x30)
struct UViewModeUtils : UObject {
};

// Class Engine.EngineBaseTypes
// Size: 0x30 (Inherited: 0x30)
struct UEngineBaseTypes : UObject {
};

// Class Engine.EngineTypes
// Size: 0x30 (Inherited: 0x30)
struct UEngineTypes : UObject {
};

// Class Engine.ExponentialHeightFog
// Size: 0x470 (Inherited: 0x460)
struct AExponentialHeightFog : AInfo {
	struct UExponentialHeightFogComponent* Component; // 0x460(0x08)
	char bEnabled : 1; // 0x468(0x01)
	char pad_468_1 : 7; // 0x468(0x01)
	char pad_469[0x7]; // 0x469(0x07)

	void OnRep_bEnabled(); // Function Engine.ExponentialHeightFog.OnRep_bEnabled // (Native|Public) // @ game+0x3c7de60
};

// Class Engine.ExponentialHeightFogComponent
// Size: 0x410 (Inherited: 0x330)
struct UExponentialHeightFogComponent : USceneComponent {
	float FogDensity; // 0x330(0x04)
	float FogHeightFalloff; // 0x334(0x04)
	struct FExponentialHeightFogData SecondFogData; // 0x338(0x0c)
	struct FLinearColor FogInscatteringColor; // 0x344(0x10)
	struct FLinearColor FogInscatteringLuminance; // 0x354(0x10)
	struct FLinearColor SkyAtmosphereAmbientContributionColorScale; // 0x364(0x10)
	char pad_374[0x4]; // 0x374(0x04)
	struct UTextureCube* InscatteringColorCubemap; // 0x378(0x08)
	float InscatteringColorCubemapAngle; // 0x380(0x04)
	struct FLinearColor InscatteringTextureTint; // 0x384(0x10)
	float FullyDirectionalInscatteringColorDistance; // 0x394(0x04)
	float NonDirectionalInscatteringColorDistance; // 0x398(0x04)
	float DirectionalInscatteringExponent; // 0x39c(0x04)
	float DirectionalInscatteringStartDistance; // 0x3a0(0x04)
	struct FLinearColor DirectionalInscatteringColor; // 0x3a4(0x10)
	struct FLinearColor DirectionalInscatteringLuminance; // 0x3b4(0x10)
	float FogMaxOpacity; // 0x3c4(0x04)
	float StartDistance; // 0x3c8(0x04)
	float FogCutoffDistance; // 0x3cc(0x04)
	bool bEnableVolumetricFog; // 0x3d0(0x01)
	char pad_3D1[0x3]; // 0x3d1(0x03)
	float VolumetricFogScatteringDistribution; // 0x3d4(0x04)
	struct FColor VolumetricFogAlbedo; // 0x3d8(0x04)
	struct FLinearColor VolumetricFogEmissive; // 0x3dc(0x10)
	float VolumetricFogExtinctionScale; // 0x3ec(0x04)
	float VolumetricFogDistance; // 0x3f0(0x04)
	float VolumetricFogStartDistance; // 0x3f4(0x04)
	float VolumetricFogNearFadeInDistance; // 0x3f8(0x04)
	float VolumetricFogStaticLightingScatteringIntensity; // 0x3fc(0x04)
	bool bOverrideLightColorsWithFogInscatteringColors; // 0x400(0x01)
	char pad_401[0xf]; // 0x401(0x0f)

	void SetVolumetricFogScatteringDistribution(float NewValue); // Function Engine.ExponentialHeightFogComponent.SetVolumetricFogScatteringDistribution // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7e9e0
	void SetVolumetricFogExtinctionScale(float NewValue); // Function Engine.ExponentialHeightFogComponent.SetVolumetricFogExtinctionScale // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7e8e0
	void SetVolumetricFogEmissive(struct FLinearColor NewValue); // Function Engine.ExponentialHeightFogComponent.SetVolumetricFogEmissive // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3c7e6b0
	void SetVolumetricFogDistance(float NewValue); // Function Engine.ExponentialHeightFogComponent.SetVolumetricFogDistance // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7e5b0
	void SetVolumetricFogAlbedo(struct FColor NewValue); // Function Engine.ExponentialHeightFogComponent.SetVolumetricFogAlbedo // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3c7e7f0
	void SetVolumetricFog(bool bNewValue); // Function Engine.ExponentialHeightFogComponent.SetVolumetricFog // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7eae0
	void SetStartDistance(float Value); // Function Engine.ExponentialHeightFogComponent.SetStartDistance // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7ece0
	void SetSecondFogHeightOffset(float Value); // Function Engine.ExponentialHeightFogComponent.SetSecondFogHeightOffset // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7f0e0
	void SetSecondFogHeightFalloff(float Value); // Function Engine.ExponentialHeightFogComponent.SetSecondFogHeightFalloff // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7eee0
	void SetSecondFogDensity(float Value); // Function Engine.ExponentialHeightFogComponent.SetSecondFogDensity // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7fba0
	void SetSecondFogData(struct FExponentialHeightFogData NewValue); // Function Engine.ExponentialHeightFogComponent.SetSecondFogData // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7e470
	void SetNonDirectionalInscatteringColorDistance(float Value); // Function Engine.ExponentialHeightFogComponent.SetNonDirectionalInscatteringColorDistance // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7f660
	void SetInscatteringTextureTint(struct FLinearColor Value); // Function Engine.ExponentialHeightFogComponent.SetInscatteringTextureTint // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3c7f520
	void SetInscatteringColorCubemapAngle(float Value); // Function Engine.ExponentialHeightFogComponent.SetInscatteringColorCubemapAngle // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7f860
	void SetInscatteringColorCubemap(struct UTextureCube* Value); // Function Engine.ExponentialHeightFogComponent.SetInscatteringColorCubemap // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7f960
	void SetFullyDirectionalInscatteringColorDistance(float Value); // Function Engine.ExponentialHeightFogComponent.SetFullyDirectionalInscatteringColorDistance // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7f760
	void SetFogMaxOpacity(float Value); // Function Engine.ExponentialHeightFogComponent.SetFogMaxOpacity // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7ede0
	void SetFogInscatteringColor(struct FLinearColor Value); // Function Engine.ExponentialHeightFogComponent.SetFogInscatteringColor // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3c7fa60
	void SetFogHeightFalloff(float Value); // Function Engine.ExponentialHeightFogComponent.SetFogHeightFalloff // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7efe0
	void SetFogDensity(float Value); // Function Engine.ExponentialHeightFogComponent.SetFogDensity // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7fca0
	void SetFogCutoffDistance(float Value); // Function Engine.ExponentialHeightFogComponent.SetFogCutoffDistance // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7ebe0
	void SetDirectionalInscatteringStartDistance(float Value); // Function Engine.ExponentialHeightFogComponent.SetDirectionalInscatteringStartDistance // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7f320
	void SetDirectionalInscatteringExponent(float Value); // Function Engine.ExponentialHeightFogComponent.SetDirectionalInscatteringExponent // (Final|RequiredAPI|Native|Public|BlueprintCallable) // @ game+0x3c7f420
	void SetDirectionalInscatteringColor(struct FLinearColor Value); // Function Engine.ExponentialHeightFogComponent.SetDirectionalInscatteringColor // (Final|RequiredAPI|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3c7f1e0
};

// Class Engine.Exporter
// Size: 0x80 (Inherited: 0x30)
struct UExporter : UObject {
	struct UObject* SupportedClass; // 0x30(0x08)
	struct UObject* ExportRootScope; // 0x38(0x08)
	struct TArray<struct FString> FormatExtension; // 0x40(0x10)
	struct TArray<struct FString> FormatDescription; // 0x50(0x10)
	int32_t PreferredFormatIndex; // 0x60(0x04)
	int32_t TextIndent; // 0x64(0x04)
	char bText : 1; // 0x68(0x01)
	char bSelectedOnly : 1; // 0x68(0x01)
	char bForceFileOperations : 1; // 0x68(0x01)
	char pad_68_3 : 5; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
	struct UAssetExportTask* ExportTask; // 0x70(0x08)
	char pad_78[0x8]; // 0x78(0x08)

	bool ScriptRunAssetExportTask(struct UAssetExportTask* Task); // Function Engine.Exporter.ScriptRunAssetExportTask // (Event|Public|BlueprintEvent) // @ game+0x1b42740
	bool RunAssetExportTasks(struct TArray<struct UAssetExportTask*>& ExportTasks); // Function Engine.Exporter.RunAssetExportTasks // (Final|RequiredAPI|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x3c805d0
	bool RunAssetExportTask(struct UAssetExportTask* Task); // Function Engine.Exporter.RunAssetExportTask // (Final|RequiredAPI|Native|Static|Public|BlueprintCallable) // @ game+0x3c80750
};

// Class Engine.FieldNotificationLibrary
// Size: 0x30 (Inherited: 0x30)
struct UFieldNotificationLibrary : UBlueprintFunctionLibrary {

	bool SetPropertyValueAndBroadcastFields(bool NewValueByRef, int32_t& OldValue, int32_t& NewValue, struct UObject* Object, struct UObject* NetOwner, bool bHasLocalRepNotify, bool bShouldFlushDormancyOnSet, bool bIsNetProperty, struct TArray<struct FFieldNotificationId> ExtraFieldIds); // Function Engine.FieldNotificationLibrary.SetPropertyValueAndBroadcastFields // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x4216600
	bool SetPropertyValueAndBroadcast(bool NewValueByRef, int32_t& OldValue, int32_t& NewValue, struct UObject* Object, struct UObject* NetOwner, bool bHasLocalRepNotify, bool bShouldFlushDormancyOnSet, bool bIsNetProperty); // Function Engine.FieldNotificationLibrary.SetPropertyValueAndBroadcast // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x4215b20
	void BroadcastFieldValueChanged(struct UObject* Object, struct FFieldNotificationId FieldId); // Function Engine.FieldNotificationLibrary.BroadcastFieldValueChanged // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3c81100
	void BroadcastFieldsValueChanged(struct UObject* Object, struct TArray<struct FFieldNotificationId> FieldIds); // Function Engine.FieldNotificationLibrary.BroadcastFieldsValueChanged // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3c80db0
};

// Class Engine.FogIntensityVolume
// Size: 0x4a8 (Inherited: 0x498)
struct AFogIntensityVolume : AVolume {
	bool bEnabled; // 0x498(0x01)
	char pad_499[0x3]; // 0x499(0x03)
	float Priority; // 0x49c(0x04)
	float BlendRadius; // 0x4a0(0x04)
	float VertexFogIntensity; // 0x4a4(0x04)
};

// Class Engine.FontImportOptions
// Size: 0xe0 (Inherited: 0x30)
struct UFontImportOptions : UObject {
	struct FFontImportOptionsData Data; // 0x30(0xb0)
};

// Class Engine.ForceFeedbackAttenuation
// Size: 0xf0 (Inherited: 0x30)
struct UForceFeedbackAttenuation : UObject {
	struct FForceFeedbackAttenuationSettings Attenuation; // 0x30(0xc0)
};

// Class Engine.GameNetworkManager
// Size: 0x510 (Inherited: 0x460)
struct AGameNetworkManager : AInfo {
	float BadPacketLossThreshold; // 0x460(0x04)
	float SeverePacketLossThreshold; // 0x464(0x04)
	int32_t BadPingThreshold; // 0x468(0x04)
	int32_t SeverePingThreshold; // 0x46c(0x04)
	int32_t AdjustedNetSpeed; // 0x470(0x04)
	float LastNetSpeedUpdateTime; // 0x474(0x04)
	int32_t TotalNetBandwidth; // 0x478(0x04)
	int32_t MinDynamicBandwidth; // 0x47c(0x04)
	int32_t MaxDynamicBandwidth; // 0x480(0x04)
	char bIsStandbyCheckingEnabled : 1; // 0x484(0x01)
	char bHasStandbyCheatTriggered : 1; // 0x484(0x01)
	char pad_484_2 : 6; // 0x484(0x01)
	char pad_485[0x3]; // 0x485(0x03)
	float StandbyRxCheatTime; // 0x488(0x04)
	float StandbyTxCheatTime; // 0x48c(0x04)
	float PercentMissingForRxStandby; // 0x490(0x04)
	float PercentMissingForTxStandby; // 0x494(0x04)
	float PercentForBadPing; // 0x498(0x04)
	float JoinInProgressStandbyWaitTime; // 0x49c(0x04)
	float MoveRepSize; // 0x4a0(0x04)
	float MAXPOSITIONERRORSQUARED; // 0x4a4(0x04)
	float MAXSMALLPOSITIONERRORSQUARED; // 0x4a8(0x04)
	float MAXCROUCHERRORSQUARED; // 0x4ac(0x04)
	float MAXNEARZEROVELOCITYSQUARED; // 0x4b0(0x04)
	float CLIENTADJUSTUPDATECOST; // 0x4b4(0x04)
	float MAXCLIENTUPDATEINTERVAL; // 0x4b8(0x04)
	float MaxClientForcedUpdateDuration; // 0x4bc(0x04)
	float ServerForcedUpdateHitchThreshold; // 0x4c0(0x04)
	float ServerForcedUpdateHitchCooldown; // 0x4c4(0x04)
	float MaxMoveDeltaTime; // 0x4c8(0x04)
	float MaxClientSmoothingDeltaTime; // 0x4cc(0x04)
	float ClientNetSendMoveDeltaTime; // 0x4d0(0x04)
	float ClientNetSendMoveDeltaTimeThrottled; // 0x4d4(0x04)
	float ClientNetSendMoveDeltaTimeStationary; // 0x4d8(0x04)
	int32_t ClientNetSendMoveThrottleAtNetSpeed; // 0x4dc(0x04)
	int32_t ClientNetSendMoveThrottleOverPlayerCount; // 0x4e0(0x04)
	float ClientErrorUpdateRateLimit; // 0x4e4(0x04)
	float ClientNetCamUpdateDeltaTime; // 0x4e8(0x04)
	float ClientNetCamUpdatePositionLimit; // 0x4ec(0x04)
	bool ClientAuthorativePosition; // 0x4f0(0x01)
	bool bMovementTimeDiscrepancyDetection; // 0x4f1(0x01)
	bool bMovementTimeDiscrepancyResolution; // 0x4f2(0x01)
	char pad_4F3[0x1]; // 0x4f3(0x01)
	float MovementTimeDiscrepancyMaxTimeMargin; // 0x4f4(0x04)
	float MovementTimeDiscrepancyMinTimeMargin; // 0x4f8(0x04)
	float MovementTimeDiscrepancyResolutionRate; // 0x4fc(0x04)
	float MovementTimeDiscrepancyDriftAllowance; // 0x500(0x04)
	bool bMovementTimeDiscrepancyForceCorrectionsDuringResolution; // 0x504(0x01)
	bool bUseDistanceBasedRelevancy; // 0x505(0x01)
	char pad_506[0xa]; // 0x506(0x0a)
};

// Class Engine.SpotLight
// Size: 0x478 (Inherited: 0x470)
struct ASpotLight : ALight {
	struct USpotLightComponent* SpotLightComponent; // 0x470(0x08)

	void SetOuterConeAngle(float NewOuterConeAngle); // Function Engine.SpotLight.SetOuterConeAngle // (Final|Native|Public|BlueprintCallable) // @ game+0x4a272b0
	void SetInnerConeAngle(float NewInnerConeAngle); // Function Engine.SpotLight.SetInnerConeAngle // (Final|Native|Public|BlueprintCallable) // @ game+0x4a273e0
};

// Class Engine.GeneratedMeshAreaLight
// Size: 0x478 (Inherited: 0x478)
struct AGeneratedMeshAreaLight : ASpotLight {
};

// Class Engine.HapticFeedbackEffect_Base
// Size: 0x30 (Inherited: 0x30)
struct UHapticFeedbackEffect_Base : UObject {
};

// Class Engine.HapticFeedbackEffect_Buffer
// Size: 0x48 (Inherited: 0x30)
struct UHapticFeedbackEffect_Buffer : UHapticFeedbackEffect_Base {
	struct TArray<char> Amplitudes; // 0x30(0x10)
	int32_t SampleRate; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.HapticFeedbackEffect_Curve
// Size: 0x140 (Inherited: 0x30)
struct UHapticFeedbackEffect_Curve : UHapticFeedbackEffect_Base {
	struct FHapticFeedbackDetails_Curve HapticDetails; // 0x30(0x110)
};

// Class Engine.HapticFeedbackEffect_SoundWave
// Size: 0x50 (Inherited: 0x30)
struct UHapticFeedbackEffect_SoundWave : UHapticFeedbackEffect_Base {
	struct USoundWave* SoundWave; // 0x30(0x08)
	bool bUseStereo; // 0x38(0x01)
	char pad_39[0x17]; // 0x39(0x17)
};

// Class Engine.WorldPartitionHLODSourceActors
// Size: 0x30 (Inherited: 0x30)
struct UWorldPartitionHLODSourceActors : UObject {
};

// Class Engine.WorldPartitionHLODSourceActorsFromCell
// Size: 0x30 (Inherited: 0x30)
struct UWorldPartitionHLODSourceActorsFromCell : UWorldPartitionHLODSourceActors {
};

// Class Engine.WorldPartitionHLODSourceActorsFromLevel
// Size: 0x30 (Inherited: 0x30)
struct UWorldPartitionHLODSourceActorsFromLevel : UWorldPartitionHLODSourceActors {
};

// Class Engine.HLODTemplatedInstancedStaticMeshComponent
// Size: 0x8d0 (Inherited: 0x8b0)
struct UHLODTemplatedInstancedStaticMeshComponent : UInstancedStaticMeshComponent {
	struct AActor* TemplateActorClass; // 0x8b0(0x08)
	struct FName TemplateComponentName; // 0x8b8(0x0c)
	char pad_8C4[0xc]; // 0x8c4(0x0c)
};

// Class Engine.AnimationDataController
// Size: 0x30 (Inherited: 0x30)
struct UAnimationDataController : UInterface {

	void UpdateCurveNamesFromSkeleton(struct USkeleton* Skeleton, enum class ERawCurveTrackTypes SupportedCurveType, bool bShouldTransact); // Function Engine.AnimationDataController.UpdateCurveNamesFromSkeleton // (Native|Public|BlueprintCallable) // @ game+0x3c87130
	bool SetTransformCurveKeys(struct FAnimationCurveIdentifier& CurveId, struct TArray<struct FTransform>& TransformValues, struct TArray<float>& TimeKeys, bool bShouldTransact); // Function Engine.AnimationDataController.SetTransformCurveKeys // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c88910
	bool SetTransformCurveKey(struct FAnimationCurveIdentifier& CurveId, float Time, struct FTransform& Value, bool bShouldTransact); // Function Engine.AnimationDataController.SetTransformCurveKey // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3c885b0
	void SetPlayLength(float Length, bool bShouldTransact); // Function Engine.AnimationDataController.SetPlayLength // (Native|Public|BlueprintCallable) // @ game+0x3c8b440
	void SetNumberOfFrames(struct FFrameNumber NewLengthInFrames, bool bShouldTransact); // Function Engine.AnimationDataController.SetNumberOfFrames // (Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3c8b5f0
	void SetModel(struct TScriptInterface<IAnimationDataModel> InModel); // Function Engine.AnimationDataController.SetModel // (Native|Public|BlueprintCallable) // @ game+0x3c8bac0
	void SetFrameRate(struct FFrameRate FrameRate, bool bShouldTransact); // Function Engine.AnimationDataController.SetFrameRate // (Native|Public|BlueprintCallable) // @ game+0x3c8a790
	bool SetCurveKeys(struct FAnimationCurveIdentifier& CurveId, struct TArray<struct FRichCurveKey>& CurveKeys, bool bShouldTransact); // Function Engine.AnimationDataController.SetCurveKeys // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c87360
	bool SetCurveKey(struct FAnimationCurveIdentifier& CurveId, struct FRichCurveKey& Key, bool bShouldTransact); // Function Engine.AnimationDataController.SetCurveKey // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c87890
	bool SetCurveFlags(struct FAnimationCurveIdentifier& CurveId, int32_t Flags, bool bShouldTransact); // Function Engine.AnimationDataController.SetCurveFlags // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c88c90
	bool SetCurveFlag(struct FAnimationCurveIdentifier& CurveId, enum class EAnimAssetCurveFlags Flag, bool bState, bool bShouldTransact); // Function Engine.AnimationDataController.SetCurveFlag // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c88ef0
	bool SetCurveColor(struct FAnimationCurveIdentifier& CurveId, struct FLinearColor Color, bool bShouldTransact); // Function Engine.AnimationDataController.SetCurveColor // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3c87e30
	bool SetBoneTrackKeys(struct FName BoneName, struct TArray<struct FVector>& PositionalKeys, struct TArray<struct FQuat>& RotationalKeys, struct TArray<struct FVector>& ScalingKeys, bool bShouldTransact); // Function Engine.AnimationDataController.SetBoneTrackKeys // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c89a80
	bool ScaleCurve(struct FAnimationCurveIdentifier& CurveId, float Origin, float Factor, bool bShouldTransact); // Function Engine.AnimationDataController.ScaleCurve // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c87b20
	void ResizePlayLength(float NewLength, float T0, float T1, bool bShouldTransact); // Function Engine.AnimationDataController.ResizePlayLength // (Native|Public|BlueprintCallable) // @ game+0x3c8aec0
	void ResizeNumberOfFrames(struct FFrameNumber NewLengthInFrames, struct FFrameNumber T0, struct FFrameNumber T1, bool bShouldTransact); // Function Engine.AnimationDataController.ResizeNumberOfFrames // (Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3c8b180
	void ResizeInFrames(struct FFrameNumber NewLengthInFrames, struct FFrameNumber T0, struct FFrameNumber T1, bool bShouldTransact); // Function Engine.AnimationDataController.ResizeInFrames // (Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3c8ac00
	void Resize(float Length, float T0, float T1, bool bShouldTransact); // Function Engine.AnimationDataController.Resize // (Native|Public|BlueprintCallable) // @ game+0x3c8a940
	bool RenameCurve(struct FAnimationCurveIdentifier& CurveToRenameId, struct FAnimationCurveIdentifier& NewCurveId, bool bShouldTransact); // Function Engine.AnimationDataController.RenameCurve // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c880b0
	bool RemoveTransformCurveKey(struct FAnimationCurveIdentifier& CurveId, float Time, bool bShouldTransact); // Function Engine.AnimationDataController.RemoveTransformCurveKey // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c88340
	bool RemoveCurveKey(struct FAnimationCurveIdentifier& CurveId, float Time, bool bShouldTransact); // Function Engine.AnimationDataController.RemoveCurveKey // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c87620
	bool RemoveCurve(struct FAnimationCurveIdentifier& CurveId, bool bShouldTransact); // Function Engine.AnimationDataController.RemoveCurve // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c893c0
	bool RemoveBoneTrack(struct FName BoneName, bool bShouldTransact); // Function Engine.AnimationDataController.RemoveBoneTrack // (Native|Public|BlueprintCallable) // @ game+0x3c89fd0
	bool RemoveAttributeKey(struct FAnimationAttributeIdentifier& AttributeIdentifier, float Time, bool bShouldTransact); // Function Engine.AnimationDataController.RemoveAttributeKey // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c86530
	bool RemoveAttribute(struct FAnimationAttributeIdentifier& AttributeIdentifier, bool bShouldTransact); // Function Engine.AnimationDataController.RemoveAttribute // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c86ac0
	void RemoveAllCurvesOfType(enum class ERawCurveTrackTypes SupportedCurveType, bool bShouldTransact); // Function Engine.AnimationDataController.RemoveAllCurvesOfType // (Native|Public|BlueprintCallable) // @ game+0x3c89220
	void RemoveAllBoneTracks(bool bShouldTransact); // Function Engine.AnimationDataController.RemoveAllBoneTracks // (Native|Public|BlueprintCallable) // @ game+0x3c89ed0
	int32_t RemoveAllAttributesForBone(struct FName& BoneName, bool bShouldTransact); // Function Engine.AnimationDataController.RemoveAllAttributesForBone // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c86900
	int32_t RemoveAllAttributes(bool bShouldTransact); // Function Engine.AnimationDataController.RemoveAllAttributes // (Native|Public|BlueprintCallable) // @ game+0x3c867f0
	void OpenBracket(struct FText& InTitle, bool bShouldTransact); // Function Engine.AnimationDataController.OpenBracket // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c8b890
	int32_t InsertBoneTrack(struct FName BoneName, int32_t DesiredIndex, bool bShouldTransact); // Function Engine.AnimationDataController.InsertBoneTrack // (Native|Public|BlueprintCallable) // @ game+0x3c8a1a0
	struct TScriptInterface<IAnimationDataModel> GetModelInterface(); // Function Engine.AnimationDataController.GetModelInterface // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c8ba80
	void FindOrAddCurveNamesOnSkeleton(struct USkeleton* Skeleton, enum class ERawCurveTrackTypes SupportedCurveType, bool bShouldTransact); // Function Engine.AnimationDataController.FindOrAddCurveNamesOnSkeleton // (Native|Public|BlueprintCallable) // @ game+0x3c86f00
	bool DuplicateCurve(struct FAnimationCurveIdentifier& CopyCurveId, struct FAnimationCurveIdentifier& NewCurveId, bool bShouldTransact); // Function Engine.AnimationDataController.DuplicateCurve // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c89590
	bool DuplicateAttribute(struct FAnimationAttributeIdentifier& AttributeIdentifier, struct FAnimationAttributeIdentifier& NewAttributeIdentifier, bool bShouldTransact); // Function Engine.AnimationDataController.DuplicateAttribute // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c86200
	void CloseBracket(bool bShouldTransact); // Function Engine.AnimationDataController.CloseBracket // (Native|Public|BlueprintCallable) // @ game+0x3c8b790
	bool AddCurve(struct FAnimationCurveIdentifier& CurveId, int32_t CurveFlags, bool bShouldTransact); // Function Engine.AnimationDataController.AddCurve // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c89820
	int32_t AddBoneTrack(struct FName BoneName, bool bShouldTransact); // Function Engine.AnimationDataController.AddBoneTrack // (Native|Public|BlueprintCallable) // @ game+0x3c8a5d0
	bool AddBoneCurve(struct FName BoneName, bool bShouldTransact); // Function Engine.AnimationDataController.AddBoneCurve // (Native|Public|BlueprintCallable) // @ game+0x3c8a410
	bool AddAttribute(struct FAnimationAttributeIdentifier& AttributeIdentifier, bool bShouldTransact); // Function Engine.AnimationDataController.AddAttribute // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3c86ce0
};

// Class Engine.AnimationDataModel
// Size: 0x30 (Inherited: 0x30)
struct UAnimationDataModel : UInterface {

	bool IsValidBoneTrackName(struct FName& TrackName); // Function Engine.AnimationDataModel.IsValidBoneTrackName // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c8cc90
	bool IsValidBoneTrackIndex(int32_t TrackIndex); // Function Engine.AnimationDataModel.IsValidBoneTrackIndex // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c8cda0
	double GetPlayLength(); // Function Engine.AnimationDataModel.GetPlayLength // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c8d5f0
