// UserDefinedStruct MatchDetailsMatchHighlightsResults.MatchDetailsMatchHighlightsResults
// Size: 0x70 (Inherited: 0x00)
struct FMatchDetailsMatchHighlightsResults {
	bool MatchWentToOT_61_AAAB7A114155D988205C2797955EF99A; // 0x00(0x01)
	char pad_1[0x3]; // 0x01(0x03)
	int32_t FirstHalfWins_3_9EE49D9E4D50469DA86AAEB7FD8321BA; // 0x04(0x04)
	int32_t SecondHalfWins_5_8EE591144834EF2D764187B39E507EA5; // 0x08(0x04)
	int32_t OTWins_7_C3F2C1AC4078E3A01E5E7A86CF005699; // 0x0c(0x04)
	int32_t FirstHalfFirstBloods_9_7C65CCF840FB8BB69A5786B3F011B405; // 0x10(0x04)
	int32_t SecondHalfFirstBloods_11_482F90E64529DD1EF1370985EEDA0005; // 0x14(0x04)
	int32_t OTFirstBloods_13_1913DF114EB00DEEFE4A42AB392BEB51; // 0x18(0x04)
	int32_t FirstHalfFIrstBloodWins_37_88301D1948C9E9BB2896C5B941A8CB12; // 0x1c(0x04)
	int32_t SecondHalfFirstBloodWins_38_E597BB874305AB22A5FA2289C8018D09; // 0x20(0x04)
	int32_t OTFirstBloodWins_39_97946D964D5C22476EA2448CA82353B2; // 0x24(0x04)
	int32_t FirstHalfEliminationWins_40_B082B0C84A9003081A3008A3410E63AD; // 0x28(0x04)
	int32_t SecondHalfEliminationWins_41_A35207CA4C882C12EA9E44B04F95371A; // 0x2c(0x04)
	int32_t OTEliminationWins_42_673DE7364758321ABA3846B02D684FDA; // 0x30(0x04)
	int32_t FirstHalfSpikesDeployed_43_2C742016429EF3912CDD909E62FCEF28; // 0x34(0x04)
	int32_t SecondHalfSpikesDeployed_44_C22E33E74EBEE9FECF124C91B56B70B0; // 0x38(0x04)
	int32_t OTSpikesDeployed_45_5C227C2941B5CF9683F1D38A19334A46; // 0x3c(0x04)
	int32_t FirstHalfPostSpikeWins_46_1313792A4806B70DD84BBEA1FB5A5C14; // 0x40(0x04)
	int32_t SecondHalfPostSpikeWins_47_F936C6684F8838D3EF98EC9DAFA0EC86; // 0x44(0x04)
	int32_t OTPostSpikeWins_48_A543F80449ED4A767BC6D0B15ABDF5CF; // 0x48(0x04)
	int32_t FirstHalfDefusals_49_420CEEEB4F8479A9763FB3B5E32A2B1D; // 0x4c(0x04)
	int32_t SecondHalfDefusals_50_E4424F644038ACA0020ABDA5EB69723D; // 0x50(0x04)
	int32_t OTDefusals_51_9771F5924B192D0106B2AFA7FD233825; // 0x54(0x04)
	int32_t FirstHalfDefTeamEliminated_52_C902926845D9880DC53EC2B340860BD6; // 0x58(0x04)
	int32_t SecondHalfDefTeamEliminated_53_471F092D48A1B030C719009EDCC37B88; // 0x5c(0x04)
	int32_t OTDefTeamEliminated_54_E151295443B0625C010DFFB4BF4C519B; // 0x60(0x04)
	int32_t FirstHalfDets_55_9A9134504F2DC41DB4BE04ACA4C51E13; // 0x64(0x04)
	int32_t SecondHalfDets_56_D6C5FCD2480C17B3DE89D397E5AC472A; // 0x68(0x04)
	int32_t OTDets_57_FDEB79A34B3A85284821348A654B3869; // 0x6c(0x04)
};

