// BlueprintGeneratedClass MenuButtonStyle.MenuButtonStyle_C
// Size: 0xd60 (Inherited: 0x38)
struct UMenuButtonStyle_C : UPrimaryDataAsset {
	struct UFontStyleDataAsset* FontStyle; // 0x38(0x08)
	struct FMenuButtonStateAppearance Selected Idle Style; // 0x40(0x1e0)
	struct FMenuButtonStateAppearance Selected Hovered Style; // 0x220(0x1e0)
	struct FMenuButtonStateAppearance Selected Pressed Style; // 0x400(0x1e0)
	struct FMenuButtonStateAppearance Normal Idle Style; // 0x5e0(0x1e0)
	struct FMenuButtonStateAppearance Normal Hovered Style; // 0x7c0(0x1e0)
	struct FMenuButtonStateAppearance Normal Pressed Style; // 0x9a0(0x1e0)
	struct FMenuButtonStateAppearance Disabled Style; // 0xb80(0x1e0)
};

