// WidgetBlueprintGeneratedClass scoreboardContent.scoreboardContent_C
// Size: 0x790 (Inherited: 0x748)
struct UscoreboardContent_C : UScoreboardContentWidgetBase_C {
	struct UVerticalBox* AllyContainer; // 0x748(0x08)
	struct UVerticalBox* EnemyContainer; // 0x750(0x08)
	struct UImage* Image_29; // 0x758(0x08)
	struct UImage* Image_57; // 0x760(0x08)
	struct UInvalidationBox* InvalidationBox_1; // 0x768(0x08)
	struct UInvalidationBox* InvalidationBox_2; // 0x770(0x08)
	struct UCanvasPanel* Root; // 0x778(0x08)
	struct UScaleBox* RootScaleBox; // 0x780(0x08)
	struct UscoreboardHeader_C* scoreboardHeader; // 0x788(0x08)

	void CheckAddWidgetToPlayerScreen(); // Function scoreboardContent.scoreboardContent_C.CheckAddWidgetToPlayerScreen // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1b42740
};

