// UserDefinedStruct Struct_NearsightInfo.Struct_NearsightInfo
// Size: 0x91 (Inherited: 0x00)
struct FStruct_NearsightInfo {
	double NearSight_On_19_370B3B1E4541BCB6DC47C0917F21C1FE; // 0x00(0x08)
	double Occluder_Radius_26_A16D52954CD480EE761C9FA1F0E70111; // 0x08(0x08)
	struct FLinearColor Occluder_BaseColor_28_39EF0E464F363340E37536843B7F7CFF; // 0x10(0x10)
	double Fade_Radius_27_28C2CE404B411892116FD8BA97973F3C; // 0x20(0x08)
	struct FLinearColor Fade_BaseColor_30_9A93BFE34DB4B1032E21259B21782EC7; // 0x28(0x10)
	struct FLinearColor Fade_DepthColor_33_DA9BA71D4F83ED60C1E0F7AFD6FA64C6; // 0x38(0x10)
	double Fade_ColorDepth_40_4FD779EE4F3914B6D9A669919B4A5576; // 0x48(0x08)
	double Fade_FogDepth_41_24C5AE49491D10575B9CC5A04F0F3EDC; // 0x50(0x08)
	struct FLinearColor Fresnel_Color_52_E2A7D5184FD6F72666911586920DB7AE; // 0x58(0x10)
	double Fresnel_Multiply_53_CBE7F4BD4A66733606C3D98A42DB76A4; // 0x68(0x08)
	double Fresnel_Power_54_A4C9C683452F98B3703FEEB938EDD5E1; // 0x70(0x08)
	struct AActor* CutoutObject_57_450412484E59FEE73BAE85A89A7F961F; // 0x78(0x08)
	double CutoutSize_60_DA4EF19F4868866D32C0C0B96177C440; // 0x80(0x08)
	struct UMaterialInterface* PostProcessMaterial_65_253FAE5746D4829BFE6856ADC7199054; // 0x88(0x08)
	bool ShowInTargetView_68_ED2CFF6F4A931E2CC9E220A5B25CFFCE; // 0x90(0x01)
};

