// WidgetBlueprintGeneratedClass TechDeco.TechDeco_C
// Size: 0x3d8 (Inherited: 0x318)
struct UTechDeco_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x08)
	struct UWidgetAnimation* Intro; // 0x320(0x08)
	struct UImage* Box01; // 0x328(0x08)
	struct UImage* Box01_BL; // 0x330(0x08)
	struct UImage* Box01_BR; // 0x338(0x08)
	struct UImage* Box01_TR; // 0x340(0x08)
	struct UImage* Box02_BL; // 0x348(0x08)
	struct UImage* Box02_BR; // 0x350(0x08)
	struct UImage* Box02_TL; // 0x358(0x08)
	struct UImage* Box02_TR; // 0x360(0x08)
	struct UImage* Box03_BL; // 0x368(0x08)
	struct UImage* Box03_BR; // 0x370(0x08)
	struct UImage* Box03_TL; // 0x378(0x08)
	struct UImage* Box03_TR; // 0x380(0x08)
	struct UImage* Box04_BL; // 0x388(0x08)
	struct UImage* Box04_BR; // 0x390(0x08)
	struct UImage* Box04_TL; // 0x398(0x08)
	struct UImage* Box04_TR; // 0x3a0(0x08)
	struct UImage* Box05_BL; // 0x3a8(0x08)
	struct UImage* Box05_BR; // 0x3b0(0x08)
	struct UImage* Box05_TL; // 0x3b8(0x08)
	struct UImage* Box05_TR; // 0x3c0(0x08)
	struct UImage* Box06_BR; // 0x3c8(0x08)
	struct UImage* Box06_TR; // 0x3d0(0x08)

	void Construct(); // Function TechDeco.TechDeco_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ExecuteUbergraph_TechDeco(int32_t EntryPoint); // Function TechDeco.TechDeco_C.ExecuteUbergraph_TechDeco // (Final|UbergraphFunction) // @ game+0x1b42740
};

