// WidgetBlueprintGeneratedClass UnlockedSubscriptionPanel.UnlockedSubscriptionPanel_C
// Size: 0x358 (Inherited: 0x318)
struct UUnlockedSubscriptionPanel_C : UUserWidget {
	struct UImage* LineBot; // 0x318(0x08)
	struct UImage* LineBotLeft; // 0x320(0x08)
	struct UImage* LineBotRight; // 0x328(0x08)
	struct UImage* LineTop; // 0x330(0x08)
	struct UImage* LineTopLeft; // 0x338(0x08)
	struct UImage* LineTopRight; // 0x340(0x08)
	struct USharedBlurBg_C* SharedBlurBg; // 0x348(0x08)
	struct UImage* SubscriptionIcon; // 0x350(0x08)
};

