// WidgetBlueprintGeneratedClass WBP_Esports_CornerCard.WBP_Esports_CornerCard_C
// Size: 0x398 (Inherited: 0x318)
struct UWBP_Esports_CornerCard_C : UUserWidget {
	struct UWidgetAnimation* OnUnfocus; // 0x318(0x08)
	struct UWidgetAnimation* OnFocus; // 0x320(0x08)
	struct UImage* BL; // 0x328(0x08)
	struct UImage* BL_2; // 0x330(0x08)
	struct UImage* BL_3; // 0x338(0x08)
	struct UImage* BR; // 0x340(0x08)
	struct UImage* BR_2; // 0x348(0x08)
	struct UImage* BR_3; // 0x350(0x08)
	struct UImage* Lines_Center1; // 0x358(0x08)
	struct UImage* Lines_Center2; // 0x360(0x08)
	struct UImage* TL; // 0x368(0x08)
	struct UImage* TL_2; // 0x370(0x08)
	struct UImage* TL_3; // 0x378(0x08)
	struct UImage* TR; // 0x380(0x08)
	struct UImage* TR_2; // 0x388(0x08)
	struct UImage* TR_3; // 0x390(0x08)
};

