// WidgetBlueprintGeneratedClass WBP_Panel_Arrows.WBP_Panel_Arrows_C
// Size: 0x370 (Inherited: 0x318)
struct UWBP_Panel_Arrows_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x08)
	struct UWidgetAnimation* OnMouseLeaveRegistrationArea; // 0x320(0x08)
	struct UWidgetAnimation* OnMouseEnterRegistrationArea; // 0x328(0x08)
	struct UImage* I_Arrow1; // 0x330(0x08)
	struct UImage* I_Arrow1_2; // 0x338(0x08)
	struct UImage* I_Arrow2; // 0x340(0x08)
	struct UImage* I_Arrow2_2; // 0x348(0x08)
	struct UImage* I_Arrow3; // 0x350(0x08)
	struct UImage* I_Arrow3_2; // 0x358(0x08)
	struct UImage* I_Arrow4; // 0x360(0x08)
	struct UImage* I_Arrow4_2; // 0x368(0x08)

	void ExecuteUbergraph_WBP_Panel_Arrows(int32_t EntryPoint); // Function WBP_Panel_Arrows.WBP_Panel_Arrows_C.ExecuteUbergraph_WBP_Panel_Arrows // (Final|UbergraphFunction) // @ game+0x1b42740
};

