// WidgetBlueprintGeneratedClass WBP_Screen_EsportsGlobalEvents.WBP_Screen_EsportsGlobalEvents_C
// Size: 0x780 (Inherited: 0x520)
struct UWBP_Screen_EsportsGlobalEvents_C : UAresScreenBase {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x520(0x08)
	struct UImage* Arrow; // 0x528(0x08)
	struct UImage* Arrow_2; // 0x530(0x08)
	struct UImage* BG; // 0x538(0x08)
	struct UEsports_Dots_C* Esports_Dots_Champs; // 0x540(0x08)
	struct UEsports_Dots_C* Esports_Dots_Masters_2; // 0x548(0x08)
	struct UEsports_Dots_C* Esports_Dots_Masters_3; // 0x550(0x08)
	struct UImage* Image_8; // 0x558(0x08)
	struct UImage* Line1; // 0x560(0x08)
	struct UImage* Line1_2; // 0x568(0x08)
	struct UImage* Line1_3; // 0x570(0x08)
	struct UImage* Line1_4; // 0x578(0x08)
	struct UImage* Line1_5; // 0x580(0x08)
	struct UImage* Line1_6; // 0x588(0x08)
	struct UImage* Line1_7; // 0x590(0x08)
	struct UImage* Line1_8; // 0x598(0x08)
	struct UImage* Line1_9; // 0x5a0(0x08)
	struct UImage* Line1_10; // 0x5a8(0x08)
	struct UImage* Line1_11; // 0x5b0(0x08)
	struct UImage* Line1_12; // 0x5b8(0x08)
	struct UImage* Line1_13; // 0x5c0(0x08)
	struct UImage* Line1_14; // 0x5c8(0x08)
	struct UImage* Line1_15; // 0x5d0(0x08)
	struct UImage* Line1_16; // 0x5d8(0x08)
	struct UImage* Line1_17; // 0x5e0(0x08)
	struct UImage* Line1_18; // 0x5e8(0x08)
	struct UImage* Line1_19; // 0x5f0(0x08)
	struct UImage* Line1_20; // 0x5f8(0x08)
	struct UImage* Line1_21; // 0x600(0x08)
	struct UImage* Line1_22; // 0x608(0x08)
	struct UImage* Line1_23; // 0x610(0x08)
	struct UImage* Line1_24; // 0x618(0x08)
	struct UImage* Line1_25; // 0x620(0x08)
	struct UImage* Line1_26; // 0x628(0x08)
	struct UImage* Line1_27; // 0x630(0x08)
	struct UImage* Line1_28; // 0x638(0x08)
	struct UImage* Line1_29; // 0x640(0x08)
	struct UImage* Line1_30; // 0x648(0x08)
	struct UImage* Line1_31; // 0x650(0x08)
	struct UImage* Line1_32; // 0x658(0x08)
	struct UImage* Line1_33; // 0x660(0x08)
	struct UImage* Line1_34; // 0x668(0x08)
	struct UImage* Line1_35; // 0x670(0x08)
	struct UImage* Line1_36; // 0x678(0x08)
	struct UImage* Line1_37; // 0x680(0x08)
	struct UImage* Line1_38; // 0x688(0x08)
	struct UImage* Line1_39; // 0x690(0x08)
	struct UImage* Line1_40; // 0x698(0x08)
	struct UImage* Line1_41; // 0x6a0(0x08)
	struct UImage* Line1_42; // 0x6a8(0x08)
	struct UImage* Line1_43; // 0x6b0(0x08)
	struct UImage* Line1_44; // 0x6b8(0x08)
	struct UImage* Line1_45; // 0x6c0(0x08)
	struct UImage* Line1_46; // 0x6c8(0x08)
	struct UImage* Line1_47; // 0x6d0(0x08)
	struct UImage* Line1_48; // 0x6d8(0x08)
	struct UImage* Line1_49; // 0x6e0(0x08)
	struct UImage* Line1_50; // 0x6e8(0x08)
	struct UImage* Line1_51; // 0x6f0(0x08)
	struct UImage* Line1_52; // 0x6f8(0x08)
	struct UImage* Line1_53; // 0x700(0x08)
	struct UImage* Line1_54; // 0x708(0x08)
	struct UImage* Line1_55; // 0x710(0x08)
	struct UImage* Line1_56; // 0x718(0x08)
	struct UImage* RedL1; // 0x720(0x08)
	struct UImage* RedL1_2; // 0x728(0x08)
	struct UImage* RedL1_3; // 0x730(0x08)
	struct UImage* RedL1_4; // 0x738(0x08)
	struct UImage* RedL2; // 0x740(0x08)
	struct UImage* RedL2_2; // 0x748(0x08)
	struct UImage* RedL2_3; // 0x750(0x08)
	struct UImage* RedL2_4; // 0x758(0x08)
	struct UWBP_Panel_VCTGlobalEventButton_C* WBP_Panel_VCTGlobalEventButton_Champions; // 0x760(0x08)
	struct UWBP_Panel_VCTGlobalEventButton_C* WBP_Panel_VCTGlobalEventButton_Masters2; // 0x768(0x08)
	struct UWBP_Panel_VCTGlobalEventButton_C* WBP_Panel_VCTGlobalEventButton_Maters1; // 0x770(0x08)
	struct UWBP_Panel_VCTSeasonSchedule_C* WBP_Panel_VCTSeasonSchedule; // 0x778(0x08)

	void Construct(); // Function WBP_Screen_EsportsGlobalEvents.WBP_Screen_EsportsGlobalEvents_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ExecuteUbergraph_WBP_Screen_EsportsGlobalEvents(int32_t EntryPoint); // Function WBP_Screen_EsportsGlobalEvents.WBP_Screen_EsportsGlobalEvents_C.ExecuteUbergraph_WBP_Screen_EsportsGlobalEvents // (Final|UbergraphFunction) // @ game+0x1b42740
};

