// WidgetBlueprintGeneratedClass WBP_GroupsStageKeysToolTip.WBP_GroupsStageKeysToolTip_C
// Size: 0x368 (Inherited: 0x318)
struct UWBP_GroupsStageKeysToolTip_C : UUserWidget {
	struct UImage* Border; // 0x318(0x08)
	struct UImage* Image_266; // 0x320(0x08)
	struct UImage* Image_361; // 0x328(0x08)
	struct UImage* Image_466; // 0x330(0x08)
	struct USharedBlurBg_C* SharedBlurBg; // 0x338(0x08)
	struct UWBP_Panel_PickemAwardedPointsDisplay_C* WBP_Panel_PickemAwardedPointsDisplay_2; // 0x340(0x08)
	struct UWBP_Panel_PickemAwardedPointsDisplay_C* WBP_Panel_PickemAwardedPointsDisplay_3; // 0x348(0x08)
	struct UWBP_Panel_PickemAwardedPointsDisplay_C* WBP_Panel_PickemAwardedPointsDisplay_6; // 0x350(0x08)
	struct UWBP_Panel_PickemResultBadge_C* WBP_Panel_PickemResultBadge; // 0x358(0x08)
	struct UWBP_Panel_PickemResultBadge_C* WBP_Panel_PickemResultBadge_2; // 0x360(0x08)

	struct FEventReply OnMouseButtonDown(struct FGeometry MyGeometry, struct FPointerEvent& MouseEvent); // Function WBP_GroupsStageKeysToolTip.WBP_GroupsStageKeysToolTip_C.OnMouseButtonDown // (BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1b42740
};

