// WidgetBlueprintGeneratedClass WBP_PickemsListEntryUnderline.WBP_PickemsListEntryUnderline_C
// Size: 0x370 (Inherited: 0x318)
struct UWBP_PickemsListEntryUnderline_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x08)
	struct UImage* dot1_2; // 0x320(0x08)
	struct UImage* Dot1_Glow; // 0x328(0x08)
	struct UImage* dot2; // 0x330(0x08)
	struct UImage* Dot2_Glow; // 0x338(0x08)
	struct UImage* Line; // 0x340(0x08)
	struct UImage* RightLine_2; // 0x348(0x08)
	struct UImage* RightLine_glow; // 0x350(0x08)
	struct USpacer* Spacer_46; // 0x358(0x08)
	struct FVector2D Spacer Width; // 0x360(0x10)

	void SetLeftSpacerSize(); // Function WBP_PickemsListEntryUnderline.WBP_PickemsListEntryUnderline_C.SetLeftSpacerSize // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1b42740
	void PreConstruct(bool IsDesignTime); // Function WBP_PickemsListEntryUnderline.WBP_PickemsListEntryUnderline_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void ExecuteUbergraph_WBP_PickemsListEntryUnderline(int32_t EntryPoint); // Function WBP_PickemsListEntryUnderline.WBP_PickemsListEntryUnderline_C.ExecuteUbergraph_WBP_PickemsListEntryUnderline // (Final|UbergraphFunction) // @ game+0x1b42740
};

