// WidgetBlueprintGeneratedClass WBP_Panel_EventBanners.WBP_Panel_EventBanners_C
// Size: 0x419 (Inherited: 0x3e0)
struct UWBP_Panel_EventBanners_C : UAresCommonUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3e0(0x08)
	struct UWidgetSwitcher* BannerWidgetSwitcher; // 0x3e8(0x08)
	struct UWBP_Panel_AdHocBanner_C* WBP_Panel_AdHocBanner; // 0x3f0(0x08)
	struct UWBP_Panel_BTE_Banner_Home_Screen_Lobby_C* WBP_Panel_BTE_Banner_Home_Screen_Lobby; // 0x3f8(0x08)
	struct UWBP_Panel_EventPassHomescreenBanner_C* WBP_Panel_EventPassHomescreenBanner; // 0x400(0x08)
	struct UWBP_Panel_MFABanner_C* WBP_Panel_MFABanner; // 0x408(0x08)
	struct UWBP_Panel_NewMapIncentiveBanner_C* WBP_Panel_NewMapIncentiveBanner; // 0x410(0x08)
	bool IsLobby; // 0x418(0x01)

	void InitBanners(); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.InitBanners // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1b42740
	void Update Selected Banner(); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.Update Selected Banner // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1b42740
	void Get First Visible Banner(struct UWidget*& Banner); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.Get First Visible Banner // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1b42740
	void BndEvt__WBP_Panel_EventBanners_WBP_Panel_BTE_Banner_Home_Screen_Lobby_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature(enum class ESlateVisibility InVisibility); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.BndEvt__WBP_Panel_EventBanners_WBP_Panel_BTE_Banner_Home_Screen_Lobby_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1b42740
	void BndEvt__WBP_Panel_EventBanners_WBP_Panel_EventPassHomescreenBanner_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature(enum class ESlateVisibility InVisibility); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.BndEvt__WBP_Panel_EventBanners_WBP_Panel_EventPassHomescreenBanner_K2Node_ComponentBoundEvent_1_OnVisibilityChangedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1b42740
	void BndEvt__WBP_Panel_EventBanners_WBP_Panel_NewMapIncentiveBanner_K2Node_ComponentBoundEvent_2_OnVisibilityChangedEvent__DelegateSignature(enum class ESlateVisibility InVisibility); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.BndEvt__WBP_Panel_EventBanners_WBP_Panel_NewMapIncentiveBanner_K2Node_ComponentBoundEvent_2_OnVisibilityChangedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1b42740
	void Construct(); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1b42740
	void BndEvt__WBP_Panel_EventBanners_WBP_Panel_MFABanner_K2Node_ComponentBoundEvent_6_OnVisibilityChangedEvent__DelegateSignature(enum class ESlateVisibility InVisibility); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.BndEvt__WBP_Panel_EventBanners_WBP_Panel_MFABanner_K2Node_ComponentBoundEvent_6_OnVisibilityChangedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1b42740
	void BndEvt__WBP_Panel_EventBanners_WBP_Panel_BTE_Banner_Home_Screen_Lobby_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(struct UCommonButtonBase* Button); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.BndEvt__WBP_Panel_EventBanners_WBP_Panel_BTE_Banner_Home_Screen_Lobby_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature // (BlueprintEvent) // @ game+0x1b42740
	void BndEvt__WBP_Panel_EventBanners_WBP_Panel_EventPassHomescreenBanner_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature(struct UCommonButtonBase* Button); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.BndEvt__WBP_Panel_EventBanners_WBP_Panel_EventPassHomescreenBanner_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature // (BlueprintEvent) // @ game+0x1b42740
	void BndEvt__WBP_Panel_EventBanners_WBP_Panel_EventPassHomescreenBanner_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature(struct UCommonButtonBase* Button); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.BndEvt__WBP_Panel_EventBanners_WBP_Panel_EventPassHomescreenBanner_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature // (BlueprintEvent) // @ game+0x1b42740
	void BndEvt__WBP_Panel_EventBanners_WBP_Panel_NewMapIncentiveBanner_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature(struct UCommonButtonBase* Button); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.BndEvt__WBP_Panel_EventBanners_WBP_Panel_NewMapIncentiveBanner_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature // (BlueprintEvent) // @ game+0x1b42740
	void BndEvt__WBP_Panel_EventBanners_WBP_Panel_NewMapIncentiveBanner_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature(struct UCommonButtonBase* Button); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.BndEvt__WBP_Panel_EventBanners_WBP_Panel_NewMapIncentiveBanner_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature // (BlueprintEvent) // @ game+0x1b42740
	void BndEvt__WBP_Panel_EventBanners_WBP_Panel_AdHocBanner_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature(struct UCommonButtonBase* Button); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.BndEvt__WBP_Panel_EventBanners_WBP_Panel_AdHocBanner_K2Node_ComponentBoundEvent_12_CommonButtonBaseClicked__DelegateSignature // (BlueprintEvent) // @ game+0x1b42740
	void BndEvt__WBP_Panel_EventBanners_WBP_Panel_AdHocBanner_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature(struct UCommonButtonBase* Button); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.BndEvt__WBP_Panel_EventBanners_WBP_Panel_AdHocBanner_K2Node_ComponentBoundEvent_13_CommonButtonBaseClicked__DelegateSignature // (BlueprintEvent) // @ game+0x1b42740
	void ExecuteUbergraph_WBP_Panel_EventBanners(int32_t EntryPoint); // Function WBP_Panel_EventBanners.WBP_Panel_EventBanners_C.ExecuteUbergraph_WBP_Panel_EventBanners // (Final|UbergraphFunction) // @ game+0x1b42740
};

