// BlueprintGeneratedClass BombGameMode.BombGameMode_C
// Size: 0x10c9 (Inherited: 0xc01)
struct ABombGameMode_C : ABaseGameMode_C {
	char pad_C01[0x7]; // 0xc01(0x07)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xc08(0x08)
	struct UComp_GameMode_DelayableFinishers_C* Comp_GameMode_DelayableFinishers; // 0xc10(0x08)
	struct UTimeGameStateComponent* GameStateTimeoutCountdown; // 0xc18(0x08)
	struct UComp_Actor_MultiTargetHandler_Buff_C* Comp_Actor_MultiTargetHandler_Buff_TimeoutFreeze; // 0xc20(0x08)
	struct UBaseGameStateComponent* GameStateTimeoutQueued; // 0xc28(0x08)
	struct UTimeGameStateComponent* GameStateTimeout; // 0xc30(0x08)
	struct UBaseGameStateComponent* GameStateTimeoutInactive; // 0xc38(0x08)
	struct UStateMachineComponent* TimeoutStateMachine; // 0xc40(0x08)
	struct UComp_MatchResults_StayedInSpawn_C* Comp_MatchResults_StayedInSpawn; // 0xc48(0x08)
	struct UComp_BombRoundStateLog_C* Comp_BombRoundStateLog; // 0xc50(0x08)
	struct UGameStateVoteComponent_C* GameStateVoteComponent; // 0xc58(0x08)
	struct UComp_GameMode_OvertimeDrawVotes_C* Comp_GameMode_OvertimeDrawVotes; // 0xc60(0x08)
	struct UComp_GameMode_GrantPurchasables_C* Comp_GameMode_GrantPurchasables; // 0xc68(0x08)
	struct UComp_MatchResults_RoundCeremony_C* Comp_MatchResults_RoundCeremony; // 0xc70(0x08)
	struct UComp_MatchResults_PlayerScores_C* Comp_MatchResults_PlayerScores; // 0xc78(0x08)
	struct UComp_MatchResults_Penalites_C* Comp_MatchResults_Penalites; // 0xc80(0x08)
	struct UComp_MatchResults_Kill_C* Comp_MatchResults_Kill; // 0xc88(0x08)
	struct UComp_MatchResults_Economy_C* Comp_MatchResults_Economy; // 0xc90(0x08)
	struct UComp_MatchResults_Damage_C* Comp_MatchResults_Damage; // 0xc98(0x08)
	struct UComp_MatchResults_Bomb_C* Comp_MatchResults_Bomb; // 0xca0(0x08)
	struct UComp_MatchResults_Abilities_C* Comp_MatchResults_Abilities; // 0xca8(0x08)
	struct UTimeGameStateComponent* GameStateBuyPhase; // 0xcb0(0x08)
	struct UTimeGameStateComponent* GameStateBombPlanted; // 0xcb8(0x08)
	struct UBaseGameStateComponent* GameStateTeamSwitch; // 0xcc0(0x08)
	struct UTimeGameStateComponent* GameStatePostRound; // 0xcc8(0x08)
	struct UTimeGameStateComponent* GameStateRound; // 0xcd0(0x08)
	char pad_CD8[0x8]; // 0xcd8(0x08)
	struct FTransform BombSpawnTransform; // 0xce0(0x60)
	struct APlantedBomb_C* BombPlantedObject; // 0xd40(0x08)
	double MatchTimerWarning; // 0xd48(0x08)
	bool HasPlayedMatchTimerWarning; // 0xd50(0x01)
	char pad_D51[0x7]; // 0xd51(0x07)
	double BombPlantedMatchTimerWarning; // 0xd58(0x08)
	struct FAresGameRewardMultiplier BombPlantTeamMateMultiplier; // 0xd60(0x24)
	int32_t WinSpread; // 0xd84(0x04)
	int32_t WinningDirection; // 0xd88(0x04)
	char pad_D8C[0x4]; // 0xd8c(0x04)
	struct TArray<double> CloseLossBonuses; // 0xd90(0x10)
	struct UBaseTeamComponent* L_LosingTeam; // 0xda0(0x08)
	double EscalatingMoney; // 0xda8(0x08)
	double PerRoundEscalationMoney; // 0xdb0(0x08)
	struct FName L_RewardName; // 0xdb8(0x0c)
	char pad_DC4[0x4]; // 0xdc4(0x04)
	double PerRoundEscalationEnergy; // 0xdc8(0x08)
	double EscalatingEnergy; // 0xdd0(0x08)
	int32_t EscalatingWinEnergy; // 0xdd8(0x04)
	int32_t PerRoundWinEnergyEscalation; // 0xddc(0x04)
	int32_t StartingEnergy; // 0xde0(0x04)
	char pad_DE4[0x4]; // 0xde4(0x04)
	struct TArray<struct FRoundEndRewards> RoundEndRewards; // 0xde8(0x10)
	double KillMoneyEscalation; // 0xdf8(0x08)
	struct AActor* SensorTowerMarker; // 0xe00(0x08)
	int32_t UltimatePointsGrantedOnKill; // 0xe08(0x04)
	char pad_E0C[0x4]; // 0xe0c(0x04)
	struct TArray<struct AOwnerExclusivePlayerInfo*> RedPlayersWhoGotUltimate; // 0xe10(0x10)
	struct TArray<struct AOwnerExclusivePlayerInfo*> BluePlayersWhoGotUltimate; // 0xe20(0x10)
	int32_t UltimatePointsGrantedOnDeath; // 0xe30(0x04)
	int32_t DeadWinners; // 0xe34(0x04)
	int32_t CloseLossKillBonus; // 0xe38(0x04)
	char pad_E3C[0x4]; // 0xe3c(0x04)
	struct TArray<struct FInsuranceRewards> InsuranceRewards; // 0xe40(0x10)
	struct FString Close Loss Reward Name; // 0xe50(0x10)
	int32_t ComputedUltimatePointsForKill; // 0xe60(0x04)
	char pad_E64[0x4]; // 0xe64(0x04)
	struct ABombDetonationActor_C* BombDetonationActor; // 0xe68(0x08)
	struct FMulticastInlineDelegate OnDefendersWipe; // 0xe70(0x10)
	struct FMulticastInlineDelegate OnAttackersWipe; // 0xe80(0x10)
	struct UAudBombGameModeVOComponent_C* AudBombGameModeVOComponent; // 0xe90(0x08)
	double InitialEquippableCooldownOnRoundStart; // 0xe98(0x08)
	int32_t BombPlanterUltimatePointReward; // 0xea0(0x04)
	int32_t BombDefuserUltimatePointReward; // 0xea4(0x04)
	struct FMulticastInlineDelegate AuthSideSwitchEvent; // 0xea8(0x10)
	double New Time Out Time; // 0xeb8(0x08)
	bool IsFirstRoundOnSide; // 0xec0(0x01)
	bool IsGameserverLoggingEnabled; // 0xec1(0x01)
	char pad_EC2[0x6]; // 0xec2(0x06)
	struct UBaseAudioComponent_C* Aud_BombGameMode; // 0xec8(0x08)
	struct TArray<struct AGameObject*> BuyDomes; // 0xed0(0x10)
	struct ABaseCeremony_C* AceCeremony; // 0xee0(0x08)
	struct TSoftClassPtr<UObject> BasePistolClass; // 0xee8(0x30)
	struct TArray<struct AAresItem*> DroppedBasePistols; // 0xf18(0x10)
	int32_t MaxOnGroundBasePistols; // 0xf28(0x04)
	char pad_F2C[0x4]; // 0xf2c(0x04)
	struct FClassInclusionExclusionFilter DeletableOnGroundEquippable; // 0xf30(0x50)
	struct FMulticastInlineDelegate BuyPhaseStarted; // 0xf80(0x10)
	char DefaultTickRate; // 0xf90(0x01)
	char PreRoundTickRate; // 0xf91(0x01)
	char pad_F92[0x6]; // 0xf92(0x06)
	struct TArray<struct AShooterPlayerState*> LightArmorGrantsForDisconnects; // 0xf98(0x10)
	struct TMap<struct UBaseTeamComponent*, int32_t> UltOrbGrantsForDisconnects; // 0xfa8(0x50)
	bool HasPendingDisconnectGrants; // 0xff8(0x01)
	bool BombPlantPhaseStarted; // 0xff9(0x01)
	bool IsStoreEnabled; // 0xffa(0x01)
	bool ShouldSpawnBomb; // 0xffb(0x01)
	bool ShouldTrackPistolDropsForDeletion; // 0xffc(0x01)
	char pad_FFD[0x3]; // 0xffd(0x03)
	double MatchTimeoutQueued; // 0x1000(0x08)
	struct UBaseTeamComponent* LastRoundWinningTeam; // 0x1008(0x08)
	struct ABombEquippable_C* BombEquippableActor; // 0x1010(0x08)
	struct FMulticastInlineDelegate InitializeTimeoutStateMachine; // 0x1018(0x10)
	struct FMulticastInlineDelegate QueueTimeout; // 0x1028(0x10)
	struct AShooterPlayerState* MatchTimeoutCallingPlayer; // 0x1038(0x08)
	struct FMulticastInlineDelegate CancelTimeout; // 0x1040(0x10)
	bool MatchTimeoutWasStoreEnabled; // 0x1050(0x01)
	bool NewVar_1; // 0x1051(0x01)
	bool SwitchingSide_VO; // 0x1052(0x01)
	bool MatchPoint_VO; // 0x1053(0x01)
	char pad_1054[0x4]; // 0x1054(0x04)
	struct FTimerHandle OvertimeCheatTimerHandle; // 0x1058(0x08)
	struct FTimerHandle AdvanceNumRoundsCheatTimerHandle; // 0x1060(0x08)
	int32_t AdvanceNumRoundsCheatTotalStartPoints; // 0x1068(0x04)
	bool DisableVandalRound2; // 0x106c(0x01)
	char pad_106D[0x3]; // 0x106d(0x03)
	struct TArray<struct TSoftClassPtr<UObject>> AllowedWeapons; // 0x1070(0x10)
	struct FMulticastInlineDelegate OnPostRoundEnded; // 0x1080(0x10)
	struct FMulticastInlineDelegate OnPostRoundPreExit; // 0x1090(0x10)
	struct UInteractableUserComponent* FurthestProgressCharacter; // 0x10a0(0x08)
	struct FName RoundWinReasonAttacker; // 0x10a8(0x0c)
	struct FName RoundWinReasonDefender; // 0x10b4(0x0c)
	double MinTimeRemainingForDisplayOnDefuse; // 0x10c0(0x08)
	bool ResetStateFlowOnGameStateRoundEnter; // 0x10c8(0x01)

	void Clean Up Round(enum class EAresRoundOutcome RoundResult, struct UBaseTeamComponent* WinningTeam, struct FName Reason); // Function BombGameMode.BombGameMode_C.Clean Up Round // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1af5410
	void Bomb Defused Round Cleanup(struct AShooterCharacter* DefusingCharacter, bool& BombStateSet); // Function BombGameMode.BombGameMode_C.Bomb Defused Round Cleanup // (Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1af5410
	bool Did Bomb Defuser Die(); // Function BombGameMode.BombGameMode_C.Did Bomb Defuser Die // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1af5410
	void CheatAdvanceRoundsEnd(struct FTimerHandle TickTimerToInvalidate); // Function BombGameMode.BombGameMode_C.CheatAdvanceRoundsEnd // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1af5410
