// WidgetBlueprintGeneratedClass ByeAwardedModal.ByeAwardedModal_C
// Size: 0x380 (Inherited: 0x318)
struct UByeAwardedModal_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x08)
	struct UImage* BG; // 0x320(0x08)
	struct UWBP_MenuButtonPrimary_C* Button_Confirm; // 0x328(0x08)
	struct UImage* Gradient; // 0x330(0x08)
	struct UWidgetSwitcher* LoadingSwitcher; // 0x338(0x08)
	struct UImage* Logo; // 0x340(0x08)
	struct UImage* Pattern; // 0x348(0x08)
	struct USizeBox* SizeBoxConfirmation; // 0x350(0x08)
	struct UTextBlock* TextBlock_Main; // 0x358(0x08)
	struct UTextBlock* TextBlock_Title; // 0x360(0x08)
	struct UThrobber* Throbber_237; // 0x368(0x08)
	struct UImage* tint_bg; // 0x370(0x08)
	struct UImage* topornament; // 0x378(0x08)

	void BndEvt__ByeAwardedModal_Button_Confirm_K2Node_ComponentBoundEvent_1_OnUniversalButtonVoidEvent__DelegateSignature(); // Function ByeAwardedModal.ByeAwardedModal_C.BndEvt__ByeAwardedModal_Button_Confirm_K2Node_ComponentBoundEvent_1_OnUniversalButtonVoidEvent__DelegateSignature // (BlueprintEvent) // @ game+0x1af5410
	void ExecuteUbergraph_ByeAwardedModal(int32_t EntryPoint); // Function ByeAwardedModal.ByeAwardedModal_C.ExecuteUbergraph_ByeAwardedModal // (Final|UbergraphFunction) // @ game+0x1af5410
};

