// BlueprintGeneratedClass Comp_PlayerCharacter_SpawnInvulnerability.Comp_PlayerCharacter_SpawnInvulnerability_C
// Size: 0x128 (Inherited: 0xd8)
struct UComp_PlayerCharacter_SpawnInvulnerability_C : UActorComponent {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xd8(0x08)
	struct AShooterCharacter* OwnerCharacter; // 0xe0(0x08)
	struct FTimerHandle CheckSpeedTimerHandle; // 0xe8(0x08)
	struct FTimerHandle DurationTimerHandle; // 0xf0(0x08)
	struct FActiveGameplayEffectHandle InvulnerabilityBuffHandle; // 0xf8(0x08)
	struct AEffectContainer* InvulnerabilitySoundFXC; // 0x100(0x08)
	bool HasHandle; // 0x108(0x01)
	char pad_109[0x7]; // 0x109(0x07)
	struct FEffectID FXC_InvulnerabilitySound; // 0x110(0x18)

	void Apply Spawn Invulnerability(bool DisableOnFire, bool DisableOnMove, double Duration); // Function Comp_PlayerCharacter_SpawnInvulnerability.Comp_PlayerCharacter_SpawnInvulnerability_C.Apply Spawn Invulnerability // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1af5410
	void OnAuthEquippableUsed(struct AAresEquippable* Equippable); // Function Comp_PlayerCharacter_SpawnInvulnerability.Comp_PlayerCharacter_SpawnInvulnerability_C.OnAuthEquippableUsed // (BlueprintCallable|BlueprintEvent) // @ game+0x1af5410
	void CheckSpeed(); // Function Comp_PlayerCharacter_SpawnInvulnerability.Comp_PlayerCharacter_SpawnInvulnerability_C.CheckSpeed // (BlueprintCallable|BlueprintEvent) // @ game+0x1af5410
	void InvalidatePreviousTimer(struct AShooterCharacter* Character, struct UDamageResponse* DamageResponse); // Function Comp_PlayerCharacter_SpawnInvulnerability.Comp_PlayerCharacter_SpawnInvulnerability_C.InvalidatePreviousTimer // (BlueprintCallable|BlueprintEvent) // @ game+0x1af5410
	void DisableInvulnerability(); // Function Comp_PlayerCharacter_SpawnInvulnerability.Comp_PlayerCharacter_SpawnInvulnerability_C.DisableInvulnerability // (BlueprintCallable|BlueprintEvent) // @ game+0x1af5410
	void ReceiveBeginPlay(); // Function Comp_PlayerCharacter_SpawnInvulnerability.Comp_PlayerCharacter_SpawnInvulnerability_C.ReceiveBeginPlay // (Event|Public|BlueprintEvent) // @ game+0x1af5410
	void ExecuteUbergraph_Comp_PlayerCharacter_SpawnInvulnerability(int32_t EntryPoint); // Function Comp_PlayerCharacter_SpawnInvulnerability.Comp_PlayerCharacter_SpawnInvulnerability_C.ExecuteUbergraph_Comp_PlayerCharacter_SpawnInvulnerability // (Final|UbergraphFunction|HasDefaults) // @ game+0x1af5410
};

