// ScriptStruct EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C.AnimBlueprintGeneratedConstantData
// Size: 0x168 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName __NameProperty_168; // 0x04(0x0c)
	struct FName __NameProperty_169; // 0x10(0x0c)
	int32_t __IntProperty_170; // 0x1c(0x04)
	struct FName __NameProperty_171; // 0x20(0x0c)
	int32_t __IntProperty_172; // 0x2c(0x04)
	struct FName __NameProperty_173; // 0x30(0x0c)
	int32_t __IntProperty_174; // 0x3c(0x04)
	struct FName __NameProperty_175; // 0x40(0x0c)
	int32_t __IntProperty_176; // 0x4c(0x04)
	struct FName __NameProperty_177; // 0x50(0x0c)
	int32_t __IntProperty_178; // 0x5c(0x04)
	bool __BoolProperty_179; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	float __FloatProperty_180; // 0x64(0x04)
	struct FInputScaleBiasClampConstants __StructProperty_181; // 0x68(0x2c)
	float __FloatProperty_182; // 0x94(0x04)
	bool __BoolProperty_183; // 0x98(0x01)
	enum class EAnimSyncMethod __EnumProperty_184; // 0x99(0x01)
	enum class EAnimGroupRole __ByteProperty_185; // 0x9a(0x01)
	char pad_9B[0x1]; // 0x9b(0x01)
	struct FName __NameProperty_186; // 0x9c(0x0c)
	struct FAnimNodeFunctionRef __StructProperty_187; // 0xa8(0x28)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xd0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x150(0x18)
};

// ScriptStruct EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph.EQ_Bomb_S0_Skelmesh_Skeleton_AnimGraph_C.AnimBlueprintGeneratedMutableData
// Size: 0x08 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	char pad_1[0x3]; // 0x01(0x03)
	float __FloatProperty; // 0x04(0x04)
};

