// WidgetBlueprintGeneratedClass Esports_TabbedContentBtn.Esports_TabbedContentBtn_C
// Size: 0x370 (Inherited: 0x318)
struct UEsports_TabbedContentBtn_C : UUserWidget {
	struct UWidgetAnimation* IsOpen; // 0x318(0x08)
	struct UWidgetAnimation* onUnhover; // 0x320(0x08)
	struct UWidgetAnimation* OnHover; // 0x328(0x08)
	struct UImage* Image; // 0x330(0x08)
	struct UImage* Image_120; // 0x338(0x08)
	struct UImage* IMG_Card_2; // 0x340(0x08)
	struct UImage* IMG_Card_3; // 0x348(0x08)
	struct UImage* IMG_Card_4; // 0x350(0x08)
	struct UImage* IMG_Card_5; // 0x358(0x08)
	struct UImage* IMG_Card_6; // 0x360(0x08)
	struct UImage* IMG_Card_7; // 0x368(0x08)
};

