// WidgetBlueprintGeneratedClass Esports_BracketBtnMulti.Esports_BracketBtnMulti_C
// Size: 0x380 (Inherited: 0x318)
struct UEsports_BracketBtnMulti_C : UUserWidget {
	struct UWidgetAnimation* Unhover_Bracketbtn; // 0x318(0x08)
	struct UWidgetAnimation* Hover_Bracketbtn; // 0x320(0x08)
	struct UEsports_BracketBtnMatchup_C* Esports_BracketBtnMatchup; // 0x328(0x08)
	struct UEsports_BracketBtnMatchup_C* Esports_BracketBtnMatchup_2; // 0x330(0x08)
	struct UEsports_BracketBtnMatchup_C* Esports_BracketBtnMatchup_3; // 0x338(0x08)
	struct UEsports_BracketBtnMatchup_C* Esports_BracketBtnMatchup_4; // 0x340(0x08)
	struct UImage* Image; // 0x348(0x08)
	struct UImage* Image_2; // 0x350(0x08)
	struct UImage* Image_3; // 0x358(0x08)
	struct UImage* Image_4; // 0x360(0x08)
	struct UImage* Image_5; // 0x368(0x08)
	struct UImage* Image_6; // 0x370(0x08)
	struct UImage* Image_93; // 0x378(0x08)
};

