// WidgetBlueprintGeneratedClass Esports_StandingBtnMult.Esports_StandingBtnMult_C
// Size: 0x398 (Inherited: 0x318)
struct UEsports_StandingBtnMult_C : UUserWidget {
	struct UWidgetAnimation* StandingUnHover; // 0x318(0x08)
	struct UWidgetAnimation* StandingHover; // 0x320(0x08)
	struct UImage* Card1; // 0x328(0x08)
	struct UImage* Card2; // 0x330(0x08)
	struct UImage* Card3; // 0x338(0x08)
	struct UImage* Card4; // 0x340(0x08)
	struct UImage* Image; // 0x348(0x08)
	struct UImage* Image_2; // 0x350(0x08)
	struct UImage* Image_3; // 0x358(0x08)
	struct UImage* Image_4; // 0x360(0x08)
	struct UImage* Image_5; // 0x368(0x08)
	struct UImage* Image_6; // 0x370(0x08)
	struct UImage* Image_7; // 0x378(0x08)
	struct UImage* Image_8; // 0x380(0x08)
	struct UImage* Image_9; // 0x388(0x08)
	struct UImage* Image_179; // 0x390(0x08)
};

