// ScriptStruct FP_Core_AnimGraph.FP_Core_AnimGraph_C.AnimBlueprintGeneratedConstantData
// Size: 0x200 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x7]; // 0x01(0x07)
	struct TArray<float> __ArrayProperty_812; // 0x08(0x10)
	struct TArray<float> __ArrayProperty_813; // 0x18(0x10)
	enum class ERefPoseType __ByteProperty_814; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	struct FName __NameProperty_815; // 0x2c(0x0c)
	struct TArray<float> __ArrayProperty_816; // 0x38(0x10)
	struct FName __NameProperty_817; // 0x48(0x0c)
	struct FName __NameProperty_818; // 0x54(0x0c)
	enum class EAnimSyncMethod __EnumProperty_819; // 0x60(0x01)
	char pad_61[0x3]; // 0x61(0x03)
	struct FName __NameProperty_820; // 0x64(0x0c)
	struct FName __NameProperty_821; // 0x70(0x0c)
	struct FName __NameProperty_822; // 0x7c(0x0c)
	struct FName __NameProperty_823; // 0x88(0x0c)
	int32_t __IntProperty_824; // 0x94(0x04)
	struct FName __NameProperty_825; // 0x98(0x0c)
	int32_t __IntProperty_826; // 0xa4(0x04)
	struct FName __NameProperty_827; // 0xa8(0x0c)
	int32_t __IntProperty_828; // 0xb4(0x04)
	struct FName __NameProperty_829; // 0xb8(0x0c)
	int32_t __IntProperty_830; // 0xc4(0x04)
	struct FName __NameProperty_831; // 0xc8(0x0c)
	int32_t __IntProperty_832; // 0xd4(0x04)
	struct FName __NameProperty_833; // 0xd8(0x0c)
	int32_t __IntProperty_834; // 0xe4(0x04)
	struct UBlendProfile* __BlendProfile_835; // 0xe8(0x08)
	struct UCurveFloat* __CurveFloat_836; // 0xf0(0x08)
	enum class EAlphaBlendOption __EnumProperty_837; // 0xf8(0x01)
	enum class EBlendListTransitionType __EnumProperty_838; // 0xf9(0x01)
	bool __BoolProperty_839; // 0xfa(0x01)
	char pad_FB[0x1]; // 0xfb(0x01)
	float __FloatProperty_840; // 0xfc(0x04)
	struct FInputScaleBiasClampConstants __StructProperty_841; // 0x100(0x2c)
	float __FloatProperty_842; // 0x12c(0x04)
	bool __BoolProperty_843; // 0x130(0x01)
	enum class EAnimSyncMethod __EnumProperty_844; // 0x131(0x01)
	enum class EAnimGroupRole __ByteProperty_845; // 0x132(0x01)
	char pad_133[0x1]; // 0x133(0x01)
	struct FName __NameProperty_846; // 0x134(0x0c)
	struct FAnimNodeFunctionRef __StructProperty_847; // 0x140(0x28)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x168(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x1e8(0x18)
};

// ScriptStruct FP_Core_AnimGraph.FP_Core_AnimGraph_C.AnimBlueprintGeneratedMutableData
// Size: 0x114 (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	bool __BoolProperty_1; // 0x02(0x01)
	bool __BoolProperty_2; // 0x03(0x01)
	bool __BoolProperty_3; // 0x04(0x01)
	char pad_5[0x3]; // 0x05(0x03)
	float __FloatProperty_4; // 0x08(0x04)
	float __FloatProperty_5; // 0x0c(0x04)
	struct TArray<float> __ArrayProperty_6; // 0x10(0x10)
	int32_t __IntProperty_7; // 0x20(0x04)
	char pad_24[0x4]; // 0x24(0x04)
	struct TArray<float> __ArrayProperty_8; // 0x28(0x10)
	int32_t __IntProperty_9; // 0x38(0x04)
	bool __BoolProperty_10; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	struct TArray<float> __ArrayProperty_11; // 0x40(0x10)
	int32_t __IntProperty_12; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	struct TArray<float> __ArrayProperty_13; // 0x58(0x10)
	int32_t __IntProperty_14; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct TArray<float> __ArrayProperty_15; // 0x70(0x10)
	int32_t __IntProperty_16; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct TArray<float> __ArrayProperty_17; // 0x88(0x10)
	int32_t __IntProperty_18; // 0x98(0x04)
	float __FloatProperty_19; // 0x9c(0x04)
	float __FloatProperty_20; // 0xa0(0x04)
	float __FloatProperty_21; // 0xa4(0x04)
	struct TArray<float> __ArrayProperty_22; // 0xa8(0x10)
	int32_t __IntProperty_23; // 0xb8(0x04)
	float __FloatProperty_24; // 0xbc(0x04)
	float __FloatProperty_25; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct TArray<float> __ArrayProperty_26; // 0xc8(0x10)
	int32_t __IntProperty_27; // 0xd8(0x04)
	float __FloatProperty_28; // 0xdc(0x04)
	float __FloatProperty_29; // 0xe0(0x04)
	char pad_E4[0x4]; // 0xe4(0x04)
	struct TArray<float> __ArrayProperty_30; // 0xe8(0x10)
	int32_t __IntProperty_31; // 0xf8(0x04)
	float __FloatProperty_32; // 0xfc(0x04)
	struct TArray<float> __ArrayProperty_33; // 0x100(0x10)
	int32_t __IntProperty_34; // 0x110(0x04)
};

