// ScriptStruct Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.AnimBlueprintGeneratedConstantData
// Size: 0x1a0 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName __NameProperty_157; // 0x04(0x0c)
	struct UBlendProfile* __BlendProfile_158; // 0x10(0x08)
	struct UCurveFloat* __CurveFloat_159; // 0x18(0x08)
	enum class EAlphaBlendOption __EnumProperty_160; // 0x20(0x01)
	enum class EBlendListTransitionType __EnumProperty_161; // 0x21(0x01)
	char pad_22[0x6]; // 0x22(0x06)
	struct TArray<float> __ArrayProperty_162; // 0x28(0x10)
	struct FName __NameProperty_163; // 0x38(0x0c)
	int32_t __IntProperty_164; // 0x44(0x04)
	struct FName __NameProperty_165; // 0x48(0x0c)
	int32_t __IntProperty_166; // 0x54(0x04)
	struct FName __NameProperty_167; // 0x58(0x0c)
	int32_t __IntProperty_168; // 0x64(0x04)
	struct FName __NameProperty_169; // 0x68(0x0c)
	struct FInputScaleBiasClampConstants __StructProperty_170; // 0x74(0x2c)
	float __FloatProperty_171; // 0xa0(0x04)
	bool __BoolProperty_172; // 0xa4(0x01)
	enum class EAnimSyncMethod __EnumProperty_173; // 0xa5(0x01)
	enum class EAnimGroupRole __ByteProperty_174; // 0xa6(0x01)
	char pad_A7[0x1]; // 0xa7(0x01)
	struct FName __NameProperty_175; // 0xa8(0x0c)
	struct FName __NameProperty_176; // 0xb4(0x0c)
	int32_t __IntProperty_177; // 0xc0(0x04)
	struct FName __NameProperty_178; // 0xc4(0x0c)
	struct FName __NameProperty_179; // 0xd0(0x0c)
	int32_t __IntProperty_180; // 0xdc(0x04)
	struct FAnimNodeFunctionRef __StructProperty_181; // 0xe0(0x28)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0x108(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x188(0x18)
};

// ScriptStruct Gun_Core_AnimGraph.Gun_Core_AnimGraph_C.AnimBlueprintGeneratedMutableData
// Size: 0x3c (Inherited: 0x01)
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData {
	bool __BoolProperty; // 0x01(0x01)
	bool __BoolProperty_1; // 0x02(0x01)
	char pad_3[0x1]; // 0x03(0x01)
	float __FloatProperty_2; // 0x04(0x04)
	float __FloatProperty_3; // 0x08(0x04)
	bool __BoolProperty_4; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	float __FloatProperty_5; // 0x10(0x04)
	float __FloatProperty_6; // 0x14(0x04)
	bool __BoolProperty_7; // 0x18(0x01)
	char pad_19[0x3]; // 0x19(0x03)
	float __FloatProperty_8; // 0x1c(0x04)
	float __FloatProperty_9; // 0x20(0x04)
	bool __BoolProperty_10; // 0x24(0x01)
	char pad_25[0x3]; // 0x25(0x03)
	float __FloatProperty_11; // 0x28(0x04)
	float __FloatProperty_12; // 0x2c(0x04)
	bool __BoolProperty_13; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	float __FloatProperty_14; // 0x34(0x04)
	float __FloatProperty_15; // 0x38(0x04)
};

