// UserDefinedStruct KillBannerStruct.KillBannerStruct
// Size: 0x128 (Inherited: 0x00)
struct FKillBannerStruct {
	struct FLinearColor PrimaryColor_2_E5FCE8F2449464E9BE54588D1A1DDA81; // 0x00(0x10)
	struct UOptionalKillBannerEffects_Parent_C* OptionalEffects_9_A3519EB94C0895ECBA6551A079FC2EE5; // 0x10(0x08)
	int32_t OptionalEffectsKillCount_68_A0D957A64DCB262638DC7B922EC3DD3C; // 0x18(0x04)
	char pad_1C[0x4]; // 0x1c(0x04)
	struct UTexture2D* BackgroundFrame_TXT_12_AE806B364880513036A646929D3B6758; // 0x20(0x08)
	struct UTexture2D* BackgroundFrame_DSLV_14_6635B10B4261B551BF81D1A4FBF2DF04; // 0x28(0x08)
	struct UTexture2D* KillWheel-TXT_16_FEBDF04D4D730BD70C7995B402C44EF2; // 0x30(0x08)
	struct UTexture2D* KillWheel_Slice_Default_18_A2EF828C4325ABF6030B19962A75A149; // 0x38(0x08)
	struct UTexture2D* KillWheel_Slice_Hover_20_493CD45B4598268ADD2FA380C4354AB8; // 0x40(0x08)
	double KillWheel_Slice_Radius_23_93B498D8455F7ECBDF0367ADF77B93E3; // 0x48(0x08)
	struct UObject* Badge_Default_TXT_69_50160A5A4C36A394A83226BD4C657FF8; // 0x50(0x08)
	struct FVector2D Badge_HeadshotOffset_34_46CE41534C94C72E84BC8195F948FA17; // 0x58(0x10)
	struct FVector2D Badge_HeadshotScale_81_8702C50E4394C88B72045985FE364910; // 0x68(0x10)
	struct UTexture2D* HeadShot_Badge_78_346C8E9F4CDE842F80BB4EBC58D0140A; // 0x78(0x08)
	struct UTexture2D* Badge_DSLV_28_8BA9284A4916700DC0B6FB8C7B83D9E9; // 0x80(0x08)
	struct TArray<struct UPaperFlipbook*> FlipBookFX_40_14D5E76C4960D85642D1518E610A489B; // 0x88(0x10)
	struct UAkAudioEvent* HeadShot_Sound_kill_74_2BAFAEB04EBE90BE827DCA9814E87F2A; // 0x98(0x08)
	struct UAkAudioEvent* Sound_Appear_43_E68DB6A74381CE1688E8258E8CA11515; // 0xa0(0x08)
	struct UAkAudioEvent* Sound_ReAppear_62_E338B12F43E49760EA023CBB3524DE40; // 0xa8(0x08)
	struct UAkAudioEvent* Sound_Kill_47_9B1FDAB843DC6512CC6DEBBFD285D954; // 0xb0(0x08)
	struct UAkAudioEvent* Sound_DoubleKill_49_8199936D41C25E655FC118B3DA0B872A; // 0xb8(0x08)
	struct UAkAudioEvent* Sound_TripleKill_53_42692B884F482A6931BC6C866150C6B8; // 0xc0(0x08)
	struct UAkAudioEvent* Sound_QuadraKill_55_C843BB9C412F8CA18FA293B4A540C23B; // 0xc8(0x08)
	struct UAkAudioEvent* Sound_PentaKill_57_5B911D164B9C15F47622B882028A6C4C; // 0xd0(0x08)
	struct UAkAudioEvent* Sound_OverKill_61_CEE59617464E924CBC7649A3520DC1AA; // 0xd8(0x08)
	struct UAkAudioEvent* Sound_Kill_Headshot_84_7AA3B35949132BFD8C778797F1372E5B; // 0xe0(0x08)
	struct UAkAudioEvent* Sound_DoubleKill_Headshot_90_9CCF17DF4804935485F7CD9B4A7F7D75; // 0xe8(0x08)
	struct UAkAudioEvent* Sound_TripleKill_Headshot_91_8EE825E6427620DD6C4797BA40C68633; // 0xf0(0x08)
	struct UAkAudioEvent* Sound_QuadraKill_Headshot_92_B65535FA4750FEBE8D82E5B1ED54EAD2; // 0xf8(0x08)
	struct UAkAudioEvent* Sound_PentaKill_Headshot_93_5FC4FB724E1D110402C461ADED74798E; // 0x100(0x08)
	struct UAkAudioEvent* Sound_OverKill_Headshot_94_F725461F46F522A7AF6C859B08C0183B; // 0x108(0x08)
	struct FKillBannerStruct_Special Special_Overrides_65_6CA58C414641F0212ECF9B90331950CD; // 0x110(0x18)
};

