// WidgetBlueprintGeneratedClass MatchDetailsSummaryTabTeamStats.MatchDetailsSummaryTabTeamStats_C
// Size: 0x564 (Inherited: 0x318)
struct UMatchDetailsSummaryTabTeamStats_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x08)
	struct UTextBlock* AlliedFirstHalfDefusals; // 0x320(0x08)
	struct UTextBlock* AlliedFirstHalfEliminationWins; // 0x328(0x08)
	struct UTextBlock* AlliedFirstHalfFirstBloods; // 0x330(0x08)
	struct UTextBlock* AlliedFirstHalfFirstBloodWins; // 0x338(0x08)
	struct UTextBlock* AlliedFirstHalfPostSpikeWins; // 0x340(0x08)
	struct UTextBlock* AlliedFirstHalfSpikesDeployed; // 0x348(0x08)
	struct UTextBlock* AlliedFirstHalfWins; // 0x350(0x08)
	struct UTextBlock* AlliedOvertimeDefusals; // 0x358(0x08)
	struct UTextBlock* AlliedOvertimeEliminationWins; // 0x360(0x08)
	struct UTextBlock* AlliedOvertimeFirstBloods; // 0x368(0x08)
	struct UTextBlock* AlliedOvertimeFirstBloodWins; // 0x370(0x08)
	struct UTextBlock* AlliedOvertimePostSpikeWins; // 0x378(0x08)
	struct UTextBlock* AlliedOvertimeSpikesDeployed; // 0x380(0x08)
	struct UTextBlock* AlliedOvertimeWins; // 0x388(0x08)
	struct UTextBlock* AlliedSecondHalfDefusals; // 0x390(0x08)
	struct UTextBlock* AlliedSecondHalfEliminationWins; // 0x398(0x08)
	struct UTextBlock* AlliedSecondHalfFirstBloods; // 0x3a0(0x08)
	struct UTextBlock* AlliedSecondHalfFirstBloodWins; // 0x3a8(0x08)
	struct UTextBlock* AlliedSecondHalfPostSpikeWins; // 0x3b0(0x08)
	struct UTextBlock* AlliedSecondHalfSpikesDeployed; // 0x3b8(0x08)
	struct UTextBlock* AlliedSecondHalfWins; // 0x3c0(0x08)
	struct UTextBlock* AlliedStartingSide; // 0x3c8(0x08)
	struct UTextBlock* FirstHalfDefenderTeamEliminated; // 0x3d0(0x08)
	struct UTextBlock* FirstHalfDetonations; // 0x3d8(0x08)
	struct UImage* Image_A1; // 0x3e0(0x08)
	struct UImage* Image_A2; // 0x3e8(0x08)
	struct UImage* Image_A3; // 0x3f0(0x08)
	struct UImage* Image_A4; // 0x3f8(0x08)
	struct UImage* Image_A5; // 0x400(0x08)
	struct UImage* Image_A6; // 0x408(0x08)
	struct UImage* Image_A7; // 0x410(0x08)
	struct UImage* Image_A8; // 0x418(0x08)
	struct UImage* Image_A9; // 0x420(0x08)
	struct UImage* Image_B1; // 0x428(0x08)
	struct UImage* Image_B1_2; // 0x430(0x08)
	struct UImage* Image_B2; // 0x438(0x08)
	struct UImage* Image_B2_2; // 0x440(0x08)
	struct UImage* Image_B3; // 0x448(0x08)
	struct UImage* Image_B3_2; // 0x450(0x08)
	struct UImage* Image_B4; // 0x458(0x08)
	struct UImage* Image_B4_2; // 0x460(0x08)
	struct UImage* Image_B5; // 0x468(0x08)
	struct UImage* Image_B5_2; // 0x470(0x08)
	struct UImage* Image_B6; // 0x478(0x08)
	struct UImage* Image_B6_2; // 0x480(0x08)
	struct UImage* Image_B7; // 0x488(0x08)
	struct UImage* Image_B7_2; // 0x490(0x08)
	struct UImage* Image_B8; // 0x498(0x08)
	struct UImage* Image_B8_2; // 0x4a0(0x08)
	struct UImage* Image_B9; // 0x4a8(0x08)
	struct UImage* Image_B9_2; // 0x4b0(0x08)
	struct UTextBlock* OpponentStartingSide; // 0x4b8(0x08)
	struct UGridPanel* OvertimeColumn; // 0x4c0(0x08)
	struct UTextBlock* OvertimeDetonations; // 0x4c8(0x08)
	struct UTextBlock* OvertimeTeamEliminated; // 0x4d0(0x08)
	struct UTextBlock* SecondHalfDefenderTeamEliminated; // 0x4d8(0x08)
	struct UTextBlock* SecondHalfDetonations; // 0x4e0(0x08)
	int32_t FirstHalfWins; // 0x4e8(0x04)
	int32_t SecondHalfWins; // 0x4ec(0x04)
	int32_t FirstHalfFIrstBloods; // 0x4f0(0x04)
	int32_t SecondHalfFirstBloods; // 0x4f4(0x04)
	int32_t FirstHalfFirstBloodWins; // 0x4f8(0x04)
	int32_t SecondHalfFirstBloodWins; // 0x4fc(0x04)
	int32_t FirstHalfEliminationWins; // 0x500(0x04)
	int32_t SecondHalfEliminationWins; // 0x504(0x04)
	int32_t FirstHalfSpikesDeployed; // 0x508(0x04)
	int32_t SecondHalfSpikesDeployed; // 0x50c(0x04)
	int32_t FirstHalfPostSpikeWins; // 0x510(0x04)
	int32_t SecondHalfPostSpikeWins; // 0x514(0x04)
	int32_t FirstHalfDefusals; // 0x518(0x04)
	int32_t SecondHalfDefusals; // 0x51c(0x04)
	int32_t FirstHalfDefTeamElminated; // 0x520(0x04)
	int32_t SecondHalfDefTeamEliminated; // 0x524(0x04)
	int32_t FirstHalfDets; // 0x528(0x04)
	int32_t SecondHalfDets; // 0x52c(0x04)
	struct FName AllyTeamID; // 0x530(0x0c)
	bool MatchWentToOT; // 0x53c(0x01)
	char pad_53D[0x3]; // 0x53d(0x03)
	int32_t OTWins; // 0x540(0x04)
	int32_t OTFirstBloods; // 0x544(0x04)
	int32_t OTFirstBloodWins; // 0x548(0x04)
	int32_t OTEliminationWins; // 0x54c(0x04)
	int32_t OTSpikesDeployed; // 0x550(0x04)
	int32_t OTPostSpikeWIns; // 0x554(0x04)
	int32_t OTDefusals; // 0x558(0x04)
	int32_t OTDefTeamEliminated; // 0x55c(0x04)
	int32_t OTDets; // 0x560(0x04)

	void SetArrow(int32_t AlliedCount, int32_t OpponentCount, struct UImage* Arrow); // Function MatchDetailsSummaryTabTeamStats.MatchDetailsSummaryTabTeamStats_C.SetArrow // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1af5410
	void Construct(); // Function MatchDetailsSummaryTabTeamStats.MatchDetailsSummaryTabTeamStats_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1af5410
	void ExecuteUbergraph_MatchDetailsSummaryTabTeamStats(int32_t EntryPoint); // Function MatchDetailsSummaryTabTeamStats.MatchDetailsSummaryTabTeamStats_C.ExecuteUbergraph_MatchDetailsSummaryTabTeamStats // (Final|UbergraphFunction|HasDefaults) // @ game+0x1af5410
};

