// UserDefinedStruct NVCRadialItemOptions.NVCRadialItemOptions
// Size: 0x38 (Inherited: 0x00)
struct FNVCRadialItemOptions {
	struct FText DisplayText_23_E61ACDF345C32E442F6361AB7651881F; // 0x00(0x18)
	enum class NonVerbalCommTypesEnum CommEnum_5_9477836B481A6FAAB102C284E3089D9E; // 0x18(0x01)
	enum class TacticalVOEnum Voiceline_11_56B303684AEE2E460992A1B540060C0C; // 0x19(0x01)
	enum class VOPriorityEnum VoicelinePriority_34_3C8306C84C371B13DFE205ADACF33ADF; // 0x1a(0x01)
	enum class VOEmoteEnum EmoteVoiceline_31_7FCB5C6C419F2C96B7782C913BAD0E2B; // 0x1b(0x01)
	bool ShouldPing_20_5B9126A8403EBFC5769D7E80EFF42EC1; // 0x1c(0x01)
	char pad_1D[0x3]; // 0x1d(0x03)
	struct FText ChatText_26_728D57DB49E7E099748636BF343BF552; // 0x20(0x18)
};

