// WidgetBlueprintGeneratedClass PremierDivisionsInfo.PremierDivisionsInfo_C
// Size: 0x380 (Inherited: 0x318)
struct UPremierDivisionsInfo_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x08)
	struct UImage* AdvancedIcon_2; // 0x320(0x08)
	struct UImage* BackgroundGradient_Bot; // 0x328(0x08)
	struct UImage* BackgroundGradient_Top; // 0x330(0x08)
	struct UImage* BackgroundOverlay; // 0x338(0x08)
	struct UTextBlock* ContenderEligibilityBlurb; // 0x340(0x08)
	struct UImage* ContenderEligibleIcon; // 0x348(0x08)
	struct UImage* ContenderIcon_2; // 0x350(0x08)
	struct UCustomCloseButton_C* CustomCloseButton; // 0x358(0x08)
	struct UImage* EliteIcon_2; // 0x360(0x08)
	struct UImage* IntermediateIcon_2; // 0x368(0x08)
	struct UImage* IntermediateIcon_3; // 0x370(0x08)
	struct UImage* InviteIcon_2; // 0x378(0x08)

	void PreConstruct(bool IsDesignTime); // Function PremierDivisionsInfo.PremierDivisionsInfo_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1af5410
	void Construct(); // Function PremierDivisionsInfo.PremierDivisionsInfo_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1af5410
	void BndEvt__PremierDivisionsInfo_CustomCloseButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(); // Function PremierDivisionsInfo.PremierDivisionsInfo_C.BndEvt__PremierDivisionsInfo_CustomCloseButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature // (BlueprintEvent) // @ game+0x1af5410
	void ExecuteUbergraph_PremierDivisionsInfo(int32_t EntryPoint); // Function PremierDivisionsInfo.PremierDivisionsInfo_C.ExecuteUbergraph_PremierDivisionsInfo // (Final|UbergraphFunction|HasDefaults) // @ game+0x1af5410
};

