// WidgetBlueprintGeneratedClass PremiumContractXP_ToolTip.PremiumContractXP_ToolTip_C
// Size: 0x388 (Inherited: 0x318)
struct UPremiumContractXP_ToolTip_C : UUserWidget {
	struct UImage* BGBlue; // 0x318(0x08)
	struct UButton* bgButton_2; // 0x320(0x08)
	struct UTextBlock* Description; // 0x328(0x08)
	struct UImage* Image; // 0x330(0x08)
	struct UImage* Image_2; // 0x338(0x08)
	struct UImage* Image_3; // 0x340(0x08)
	struct UImage* Image_7; // 0x348(0x08)
	struct UImage* Image_8; // 0x350(0x08)
	struct UImage* Image_9; // 0x358(0x08)
	struct UImage* Image_14; // 0x360(0x08)
	struct UImage* Image_15; // 0x368(0x08)
	struct UImage* Image_16; // 0x370(0x08)
	struct UTextBlock* Title; // 0x378(0x08)
	struct USizeBox* ViewDetailsContainer; // 0x380(0x08)
};

