// ScriptStruct RedDot_S0_AnimBlueprint.RedDot_S0_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// Size: 0x138 (Inherited: 0x01)
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData {
	char pad_1[0x3]; // 0x01(0x03)
	struct FName __NameProperty_36; // 0x04(0x0c)
	struct FName __NameProperty_37; // 0x10(0x0c)
	int32_t __IntProperty_38; // 0x1c(0x04)
	bool __BoolProperty_39; // 0x20(0x01)
	char pad_21[0x3]; // 0x21(0x03)
	float __FloatProperty_40; // 0x24(0x04)
	struct FInputScaleBiasClampConstants __StructProperty_41; // 0x28(0x2c)
	float __FloatProperty_42; // 0x54(0x04)
	bool __BoolProperty_43; // 0x58(0x01)
	enum class EAnimSyncMethod __EnumProperty_44; // 0x59(0x01)
	enum class EAnimGroupRole __ByteProperty_45; // 0x5a(0x01)
	char pad_5B[0x1]; // 0x5b(0x01)
	struct FName __NameProperty_46; // 0x5c(0x0c)
	struct FName __NameProperty_47; // 0x68(0x0c)
	int32_t __IntProperty_48; // 0x74(0x04)
	struct FAnimNodeFunctionRef __StructProperty_49; // 0x78(0x28)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess; // 0xa0(0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtension_Base; // 0x120(0x18)
};

