// UserDefinedStruct ScoreboardPlayerInfo.ScoreboardPlayerInfo
// Size: 0xb4 (Inherited: 0x00)
struct FScoreboardPlayerInfo {
	struct FName CharacterClass_15_20388372481CC65A68AB868ADB24F403; // 0x00(0x0c)
	bool bIsAlive_5_B0192CA84B8730C157ED518663ADFA24; // 0x0c(0x01)
	char pad_D[0x3]; // 0x0d(0x03)
	int32_t Kills_19_7532AC9242C92AC330C759AB704F89D4; // 0x10(0x04)
	int32_t Deaths_20_EFD5D7E143D32F83A5B699899EAE58CB; // 0x14(0x04)
	int32_t Assists_21_890D5C8B45F31940177D20BBBABF0C5E; // 0x18(0x04)
	int32_t Score_23_952D089841F8478EA85DCF857D1366E3; // 0x1c(0x04)
	struct FString Subject_26_2596FE97448245CB84B94A947E2055F8; // 0x20(0x10)
	bool bIsUltReady_35_A9BFBDD045CACF29B9A5F499EE8D9C8C; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	int32_t UltCharges_32_8F7A43B844EC159780F995B187A83999; // 0x34(0x04)
	int32_t RequiredUltCharges_34_CFA94104421B0A99AA8AEBAEFE35E4C2; // 0x38(0x04)
	int32_t Ping_68_C442A8AD4D13E9161ACC09899E70DFBE; // 0x3c(0x04)
	bool bHasBomb_41_F8F7EDBD4265DCEAA4632CABE01963B0; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct AAresItem* Armor_44_956FBA3B4350544C5802CD8C878A6571; // 0x48(0x08)
	struct AAresEquippable* BestWeapon_47_C52862654D30BB9FBF533A80BCDB3DC0; // 0x50(0x08)
	int32_t Money_50_0B72484A46EB45467327D6ABE3CF9882; // 0x58(0x04)
	int32_t StartOfRoundMoney_88_CDFE3B6D4D2BBD1FFACBC58C64717DF0; // 0x5c(0x04)
	int32_t CompetitiveTier_52_C952D403410A8B9DECD41DA4A0EDD520; // 0x60(0x04)
	bool bIsAFK_55_2D2CEC5C48B397A10079119471D7D3F4; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	int32_t ConnectionStatus_59_897588054E1B10D7309DEB8B139A2EF7; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
	struct UTexture* CharacterPortrait_64_6368A38446F6CE5193D2569B64C0D4F6; // 0x70(0x08)
	struct FText CharacterNameText_67_EF04DE644221730B99128BBB19CE3A35; // 0x78(0x18)
	bool IsValid_72_8DEBA3134093A0FB7F086EA2FEFD8F2D; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct AAresPlayerStateBase* PlayerState_75_ABCE074E42925051C724709D0E47D25C; // 0x98(0x08)
	bool bIsDowned_78_E7C0F6D945F8F3301FCB12B5E887A577; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	struct FScoreboardPlayerFinalStatsInfo FinalStats_85_B10EF46A4002871774812E9562EFDDE2; // 0xa4(0x10)
};

