// WidgetBlueprintGeneratedClass scoreboardHeader.scoreboardHeader_C
// Size: 0x380 (Inherited: 0x318)
struct UscoreboardHeader_C : UUserWidget {
	struct UBorder* AllyCardContainer; // 0x318(0x08)
	struct UImage* BG; // 0x320(0x08)
	struct UImage* BottomLine; // 0x328(0x08)
	struct USizeBox* kdaContainer; // 0x330(0x08)
	struct UImage* LeftOverlay; // 0x338(0x08)
	struct USizeBox* moneyContainer; // 0x340(0x08)
	struct UImage* RightOverlay; // 0x348(0x08)
	struct UTextBlock* TextBlock_6; // 0x350(0x08)
	struct UTextBlock* TextBlock_9; // 0x358(0x08)
	struct UTextBlock* TextBlock_11; // 0x360(0x08)
	struct UTextBlock* TextBlock_13; // 0x368(0x08)
	struct UTextBlock* TextBlock_17; // 0x370(0x08)
	struct UTextBlock* UltPointCount; // 0x378(0x08)
};

