// BlueprintGeneratedClass StoreItemStyle.StoreItemStyle_C
// Size: 0x270 (Inherited: 0x38)
struct UStoreItemStyle_C : UPrimaryDataAsset {
	bool bDisplayRewardTitleBG; // 0x38(0x01)
	enum class ETextJustify RewardTitleAlignment; // 0x39(0x01)
	bool bDisplayTierIcon; // 0x3a(0x01)
	char pad_3B[0x5]; // 0x3b(0x05)
	struct FWidgetTransform LargeTierLogoTransform; // 0x40(0x38)
	enum class EHorizontalAlignment TextSizeBoxHorizontalAlignment; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	double RewardTitleWrapAt; // 0x80(0x08)
	bool bDisableHoverAnim; // 0x88(0x01)
	char pad_89[0x3]; // 0x89(0x03)
	struct FMargin RewardTitlePadding; // 0x8c(0x10)
	struct FMargin RewardTextPadding; // 0x9c(0x10)
	char pad_AC[0x4]; // 0xac(0x04)
	struct FSlateFontInfo RewardTitleFont; // 0xb0(0x60)
	struct FMargin CostHorizontalBoxPadding; // 0x110(0x10)
	struct FMargin CurrencyLogoPadding; // 0x120(0x10)
	struct FVector2D CurrencyIconImageSize; // 0x130(0x10)
	struct FWidgetTransform RewardThumbnailTransform; // 0x140(0x38)
	char pad_178[0x8]; // 0x178(0x08)
	struct FSlateBrush BackgroundGradientOverride; // 0x180(0xd0)
	double OpacityOverride; // 0x250(0x08)
	bool UseBackgroundGradientOverride; // 0x258(0x01)
	bool UseOpacityOverride; // 0x259(0x01)
	char pad_25A[0x2]; // 0x25a(0x02)
	struct FWidgetAlignmentArgs CostRegionAlignment; // 0x25c(0x14)
};

