// WidgetBlueprintGeneratedClass UI_OneForAll_Picker.UI_OneForAll_Picker_C
// Size: 0x368 (Inherited: 0x318)
struct UUI_OneForAll_Picker_C : UUserWidget {
	struct UWidgetAnimation* WhenCharacterIsSelected; // 0x318(0x08)
	struct UImage* Anim1; // 0x320(0x08)
	struct UImage* BGTexture; // 0x328(0x08)
	struct UImage* BotGrad; // 0x330(0x08)
	struct UImage* Checkmark; // 0x338(0x08)
	struct UImage* Image_306; // 0x340(0x08)
	struct UImage* Image_446; // 0x348(0x08)
	struct UImage* MiddleCheck; // 0x350(0x08)
	struct UImage* OpaqueCheck; // 0x358(0x08)
	struct UImage* TopGrad; // 0x360(0x08)
};

