// WidgetBlueprintGeneratedClass Viewing_SettingsWidget.Viewing_SettingsWidget_C
// Size: 0x3e0 (Inherited: 0x318)
struct UViewing_SettingsWidget_C : USettingsSubsectionBase_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x08)
	struct UBoolSettingsWidget_C* HandednessByTeam; // 0x320(0x08)
	struct UBoolSettingsWidget_C* Hide1PWidget; // 0x328(0x08)
	struct UBoolSettingsWidget_C* HideOutlinesAndFresnel; // 0x330(0x08)
	struct UBoolSettingsWidget_C* HideSpectatorPortrait; // 0x338(0x08)
	struct USettingsV2_Subheader_C* ObserverAndReplay_Settings_Subheader; // 0x340(0x08)
	struct UVerticalBox* ObserverAndReplaySubsection; // 0x348(0x08)
	struct USettingsV2_Subheader_C* ObserverOnly_Settings_Subheader; // 0x350(0x08)
	struct UTextSettingsWidgetWithSlider_C* ObserverRunSpeed; // 0x358(0x08)
	struct UBoolSettingsWidget_C* ObserverToggleScoreboard; // 0x360(0x08)
	struct UTextSettingsWidgetWithSlider_C* ObserverWalkSpeed; // 0x368(0x08)
	struct UBoolSettingsWidget_C* OpaqueMegamapBackground; // 0x370(0x08)
	struct USettingsV2_Subheader_C* Replay_Settings_Subheader; // 0x378(0x08)
	struct UVerticalBox* ReplaySubsection; // 0x380(0x08)
	struct UBoolSettingsWidget_C* ShowAllyLoadoutInfo; // 0x388(0x08)
	struct UBoolSettingsWidget_C* ShowDeathMarkersOnTimeline; // 0x390(0x08)
	struct UBoolSettingsWidget_C* ShowFinalStats; // 0x398(0x08)
	struct UBoolSettingsWidget_C* ShowFullScreenBlind; // 0x3a0(0x08)
	struct UBoolSettingsWidget_C* ShowKeybindsOnMegamap; // 0x3a8(0x08)
	struct UBoolSettingsWidget_C* ShowKeybindsOnMinimap; // 0x3b0(0x08)
	struct UBoolSettingsWidget_C* ShowKeyboardShortcuts; // 0x3b8(0x08)
	struct UBoolSettingsWidget_C* ShowUltimateMarkersOnTimeline; // 0x3c0(0x08)
	struct UBoolSettingsWidget_C* SpectateDeadPlayers; // 0x3c8(0x08)
	struct UBoolSettingsWidget_C* TeamBasedCrosshairColor; // 0x3d0(0x08)
	struct UBoolSettingsWidget_C* TeamColorAffectsHUD; // 0x3d8(0x08)

	void Construct(); // Function Viewing_SettingsWidget.Viewing_SettingsWidget_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1af5410
	void ExecuteUbergraph_Viewing_SettingsWidget(int32_t EntryPoint); // Function Viewing_SettingsWidget.Viewing_SettingsWidget_C.ExecuteUbergraph_Viewing_SettingsWidget // (Final|UbergraphFunction) // @ game+0x1af5410
};

