// WidgetBlueprintGeneratedClass WBP_Screen_Esports_League_Events.WBP_Screen_Esports_League_Events_C
// Size: 0x670 (Inherited: 0x520)
struct UWBP_Screen_Esports_League_Events_C : UAresScreenBase {
	struct UEsports_Dots_C* B_Esports_Dots_ILkickoff; // 0x520(0x08)
	struct UEsports_Dots_C* B_Esports_Dots_stage1; // 0x528(0x08)
	struct UEsports_Dots_C* B_Esports_Dots_stage2; // 0x530(0x08)
	struct UImage* Image_8; // 0x538(0x08)
	struct UImage* Image_60; // 0x540(0x08)
	struct UImage* Line1; // 0x548(0x08)
	struct UImage* Line1_2; // 0x550(0x08)
	struct UImage* Line1_3; // 0x558(0x08)
	struct UImage* Line1_4; // 0x560(0x08)
	struct UImage* Line1_5; // 0x568(0x08)
	struct UImage* Line1_6; // 0x570(0x08)
	struct UImage* Line1_7; // 0x578(0x08)
	struct UImage* Line1_8; // 0x580(0x08)
	struct UImage* Line1_9; // 0x588(0x08)
	struct UImage* Line1_10; // 0x590(0x08)
	struct UImage* Line1_11; // 0x598(0x08)
	struct UImage* Line1_12; // 0x5a0(0x08)
	struct UImage* Line1_13; // 0x5a8(0x08)
	struct UImage* Line1_14; // 0x5b0(0x08)
	struct UImage* Line1_15; // 0x5b8(0x08)
	struct UImage* Line1_16; // 0x5c0(0x08)
	struct UImage* Line1_17; // 0x5c8(0x08)
	struct UImage* Line1_18; // 0x5d0(0x08)
	struct UImage* Line1_19; // 0x5d8(0x08)
	struct UImage* Line1_20; // 0x5e0(0x08)
	struct UImage* Line1_21; // 0x5e8(0x08)
	struct UImage* Line1_22; // 0x5f0(0x08)
	struct UImage* Line1_23; // 0x5f8(0x08)
	struct UImage* Line1_24; // 0x600(0x08)
	struct UImage* RedL1; // 0x608(0x08)
	struct UImage* RedL1_2; // 0x610(0x08)
	struct UImage* RedL1_3; // 0x618(0x08)
	struct UImage* RedL1_4; // 0x620(0x08)
	struct UImage* RedL2; // 0x628(0x08)
	struct UImage* RedL2_2; // 0x630(0x08)
	struct UImage* RedL2_3; // 0x638(0x08)
	struct UImage* RedL2_4; // 0x640(0x08)
	struct UWBP_Panel_VCTSeasonEventColumn_C* VCT_Americas_Column; // 0x648(0x08)
	struct UWBP_Panel_VCTSeasonEventColumn_C* VCT_CN_Column; // 0x650(0x08)
	struct UWBP_Panel_VCTSeasonEventColumn_C* VCT_EMEA_Column; // 0x658(0x08)
	struct UWBP_Panel_VCTSeasonEventColumn_C* VCT_Pacific_Column; // 0x660(0x08)
	struct UWBP_Panel_VCTSeasonSchedule_C* WBP_Panel_VCTSeasonSchedule; // 0x668(0x08)
};

