// WidgetBlueprintGeneratedClass WBP_Panel_VCTSeasonSchedule.WBP_Panel_VCTSeasonSchedule_C
// Size: 0x450 (Inherited: 0x3e0)
struct UWBP_Panel_VCTSeasonSchedule_C : UAresCommonUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3e0(0x08)
	struct UImage* Arrow; // 0x3e8(0x08)
	struct UImage* Arrow_2; // 0x3f0(0x08)
	struct UImage* Arrow_3; // 0x3f8(0x08)
	struct UImage* Arrow_4; // 0x400(0x08)
	struct UImage* Arrow_5; // 0x408(0x08)
	struct UAresCommonText* CT_VCTYear; // 0x410(0x08)
	struct UImage* Image_62; // 0x418(0x08)
	struct UWBP_Panel_VCTSeasonScheduleEntry_C* WBP_Panel_VCTSeasonScheduleEntry; // 0x420(0x08)
	struct UWBP_Panel_VCTSeasonScheduleEntry_C* WBP_Panel_VCTSeasonScheduleEntry_2; // 0x428(0x08)
	struct UWBP_Panel_VCTSeasonScheduleEntry_C* WBP_Panel_VCTSeasonScheduleEntry_3; // 0x430(0x08)
	struct UWBP_Panel_VCTSeasonScheduleEntry_C* WBP_Panel_VCTSeasonScheduleEntry_5; // 0x438(0x08)
	struct UWBP_Panel_VCTSeasonScheduleEntry_C* WBP_Panel_VCTSeasonScheduleEntry_6; // 0x440(0x08)
	struct UWBP_Panel_VCTSeasonScheduleEntry_C* WBP_Panel_VCTSeasonScheduleEntry_8; // 0x448(0x08)

	void PreConstruct(bool IsDesignTime); // Function WBP_Panel_VCTSeasonSchedule.WBP_Panel_VCTSeasonSchedule_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1af5410
	void ExecuteUbergraph_WBP_Panel_VCTSeasonSchedule(int32_t EntryPoint); // Function WBP_Panel_VCTSeasonSchedule.WBP_Panel_VCTSeasonSchedule_C.ExecuteUbergraph_WBP_Panel_VCTSeasonSchedule // (Final|UbergraphFunction|HasDefaults) // @ game+0x1af5410
};

