// WidgetBlueprintGeneratedClass WBP_Panel_TournamentHeader.WBP_Panel_TournamentHeader_C
// Size: 0x398 (Inherited: 0x318)
struct UWBP_Panel_TournamentHeader_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x318(0x08)
	struct UImage* Image; // 0x320(0x08)
	struct UImage* Image_2; // 0x328(0x08)
	struct UImage* Image_3; // 0x330(0x08)
	struct UImage* Image_4; // 0x338(0x08)
	struct UImage* Image_5; // 0x340(0x08)
	struct UImage* Image_6; // 0x348(0x08)
	struct UImage* Image_7; // 0x350(0x08)
	struct UImage* Image_8; // 0x358(0x08)
	struct UImage* Image_9; // 0x360(0x08)
	struct UImage* Image_10; // 0x368(0x08)
	struct UImage* Image_75; // 0x370(0x08)
	struct UImage* Image_102; // 0x378(0x08)
	struct UImage* Image_152; // 0x380(0x08)
	struct UTextBlock* T_PrimaryText; // 0x388(0x08)
	struct UTextBlock* T_SecondaryText; // 0x390(0x08)

	void Construct(); // Function WBP_Panel_TournamentHeader.WBP_Panel_TournamentHeader_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1af5410
	void PreConstruct(bool IsDesignTime); // Function WBP_Panel_TournamentHeader.WBP_Panel_TournamentHeader_C.PreConstruct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1af5410
	void ExecuteUbergraph_WBP_Panel_TournamentHeader(int32_t EntryPoint); // Function WBP_Panel_TournamentHeader.WBP_Panel_TournamentHeader_C.ExecuteUbergraph_WBP_Panel_TournamentHeader // (Final|UbergraphFunction) // @ game+0x1af5410
};

