// WidgetBlueprintGeneratedClass WBP_Button_EsportsEventsNavButton.WBP_Button_EsportsEventsNavButton_C
// Size: 0x1bf9 (Inherited: 0x1ae0)
struct UWBP_Button_EsportsEventsNavButton_C : UAresCommonButton {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x1ae0(0x08)
	struct UWidgetAnimation* OnUnhovered; // 0x1ae8(0x08)
	struct UWidgetAnimation* OnHovered; // 0x1af0(0x08)
	struct UImage* Image; // 0x1af8(0x08)
	struct UImage* Image_2; // 0x1b00(0x08)
	struct UImage* Image_3; // 0x1b08(0x08)
	struct UImage* Image_4; // 0x1b10(0x08)
	struct UImage* Image_5; // 0x1b18(0x08)
	struct UImage* Image_6; // 0x1b20(0x08)
	struct UImage* Image_7; // 0x1b28(0x08)
	struct UImage* Image_8; // 0x1b30(0x08)
	struct UImage* Image_9; // 0x1b38(0x08)
	struct UImage* Image_10; // 0x1b40(0x08)
	struct UImage* Image_11; // 0x1b48(0x08)
	struct UImage* Image_12; // 0x1b50(0x08)
	struct UImage* Image_13; // 0x1b58(0x08)
	struct UImage* Image_14; // 0x1b60(0x08)
	struct UImage* Image_15; // 0x1b68(0x08)
	struct UImage* Image_16; // 0x1b70(0x08)
	struct UImage* Image_17; // 0x1b78(0x08)
	struct UImage* Image_18; // 0x1b80(0x08)
	struct UImage* Image_19; // 0x1b88(0x08)
	struct UImage* Image_20; // 0x1b90(0x08)
	struct UImage* Image_21; // 0x1b98(0x08)
	struct UImage* Image_22; // 0x1ba0(0x08)
	struct UImage* Image_23; // 0x1ba8(0x08)
	struct UImage* Image_24; // 0x1bb0(0x08)
	struct UImage* Image_25; // 0x1bb8(0x08)
	struct UImage* Image_26; // 0x1bc0(0x08)
	struct UImage* Image_27; // 0x1bc8(0x08)
	struct UImage* Image_28; // 0x1bd0(0x08)
	struct UImage* Image_141; // 0x1bd8(0x08)
	struct UImage* Image_216; // 0x1be0(0x08)
	struct UImage* Image_530; // 0x1be8(0x08)
	struct UAresCommonText* T_VCT25; // 0x1bf0(0x08)
	enum class EEsportsHubTab NavToTabType; // 0x1bf8(0x01)

	void Construct(); // Function WBP_Button_EsportsEventsNavButton.WBP_Button_EsportsEventsNavButton_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x1af5410
	void BP_OnHovered(); // Function WBP_Button_EsportsEventsNavButton.WBP_Button_EsportsEventsNavButton_C.BP_OnHovered // (Event|Protected|BlueprintEvent) // @ game+0x1af5410
	void BP_OnUnhovered(); // Function WBP_Button_EsportsEventsNavButton.WBP_Button_EsportsEventsNavButton_C.BP_OnUnhovered // (Event|Protected|BlueprintEvent) // @ game+0x1af5410
	void ExecuteUbergraph_WBP_Button_EsportsEventsNavButton(int32_t EntryPoint); // Function WBP_Button_EsportsEventsNavButton.WBP_Button_EsportsEventsNavButton_C.ExecuteUbergraph_WBP_Button_EsportsEventsNavButton // (Final|UbergraphFunction|HasDefaults) // @ game+0x1af5410
};

